{
  "episode_name": "Archie Abrams",
  "filename": "Archie Abrams.txt",
  "segments": [
    {
      "speaker": "Archie Abrams",
      "timestamp": "00:00:00)",
      "timestamp_seconds": 0.0,
      "content": "When you have teams naturally break up the world into different funnel stages or different points in the journey, it gets very seductive to look at my part of the funnel and what's my conversion rate through that part of the funnel, right? And then the team starts to optimize for that conversion rate as their north star. But in practice, it's actually almost always easier to just make it harder to do the thing right before your step in the funnel to increase your conversion rate. Instead of I'm trying to convert a bunch of people,"
    },
    {
      "speaker": "I just want more people to get activated.",
      "timestamp": "00:00:32)",
      "timestamp_seconds": 0.0,
      "content": "And then once you start thinking that way, you realize actually the best way to get more people to get to a step is just get more people in the door in the first place. That will always hurt your conversion rate,"
    },
    {
      "speaker": "but it may actually give you more people on the outside.\n\nLenny Rachitsky",
      "timestamp": "00:00:48)",
      "timestamp_seconds": 0.0,
      "content": "Today my guest is Archie Abrams. Archie is VP of product and head of growth at Shopify, where he leads an org of over 600 people across product, design, engineering, data ops, and growth marketing. Shopify is both an incredibly unique and also an incredibly successful business, and they do things very differently. And as a result,"
    },
    {
      "speaker": "there's a lot that we can learn from how they approach building product and driving growth.",
      "timestamp": "00:01:12)",
      "timestamp_seconds": 0.0,
      "content": "Some examples include their priorities in product roadmap are driven by a 100-year vision that comes from Tobi, the CEO. And the core product teams don't have metrics or KPIs. They're essentially banned. And instead, decisions are made based on taste, and intuition, and building towards this long-term vision. Also, the growth team optimizes for churn, which is unlike any other company I've ever come across. And once you hear why,"
    },
    {
      "speaker": "this will make a lot of sense.",
      "timestamp": "00:01:38)",
      "timestamp_seconds": 0.0,
      "content": "Also, they keep long-term holdouts for every experiment they run, and they automatically look at the impact these experiments have had on the business a year later, two years later, and three years later,"
    },
    {
      "speaker": "and then revisit these decisions down the road.",
      "timestamp": "00:01:52)",
      "timestamp_seconds": 0.0,
      "content": "And in our conversation, we dig into all of this plus how Shopify organizes their growth team, how they run experiments, how the growth team collaborates with the product team, how they measure impact. Plus, Archie shares a bunch of very specific and interesting examples of changes that have driven growth for the business and so much more. This is such a fascinating conversation, and I know this will give you a lot to think about in terms of how you run and organize your own product and growth teams. If you enjoy this podcast, don't forget to subscribe and follow it in your favorite podcasting app or YouTube. It's the best way to avoid missing feature episodes and it helps the podcast tremendously. With that,"
    },
    {
      "speaker": "I bring you Archie Abrams.",
      "timestamp": "00:02:34)",
      "timestamp_seconds": 0.0,
      "content": "Archie,"
    },
    {
      "speaker": "Thanks Lenny.\n\nLenny Rachitsky",
      "timestamp": "00:02:38)",
      "timestamp_seconds": 0.0,
      "content": "Excited to be here. Okay, so what I want to do with our time together is to basically do kind of a living archeology of how Shopify grows and what you specifically have learned about growing a company like Shopify into this just juggernaut of a business that it's turned into. To give people a little bit of a sense of just how large Shopify has gotten, so maybe surprising them about the scale of this company at this point. Could you share some stats about the scale of the business at this point?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "00:03:09)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, absolutely. So overall, we're about 10% of e-commerce in the United States. So basically if you're not buying an Amazon or Walmart, you're probably buying on a Shopify-powered store. And behind the scenes globally, we did about 235 billion in GMV in 2023,"
    },
    {
      "speaker": "which is roughly the size of the economy of Finland. So we've got a big economy and big impact happening from Shopify.\n\nLenny Rachitsky",
      "timestamp": "00:03:37)",
      "timestamp_seconds": 0.0,
      "content": "Wow. I think interestingly with Shopify, it's kind of this behind the scenes tool, and so I imagine many people have no idea they're using Shopify a lot of time when they're buying stuff online,"
    },
    {
      "speaker": "and I think some of these numbers kind of creep up on people with just how large a company like Shopify has gotten.\n\nArchie Abrams",
      "timestamp": "00:03:53)",
      "timestamp_seconds": 0.0,
      "content": "100%."
    },
    {
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:03:56)",
      "timestamp_seconds": 0.0,
      "content": "This episode is brought to you by Explo, a game changer for customer facing analytics and data reporting. Are your users craving more dashboards, reports, and analytics within your product? Are you tired of trying to build it yourself? As a product leader, you probably have these requests on your roadmap, but the struggle to prioritize them is real. Building analytics from scratch can be time-consuming, expensive,"
    },
    {
      "speaker": "and a really challenging process. Enter Explo. Explo is a fully white labeled embedded analytics solution designed entirely with your user in mind.",
      "timestamp": "00:04:29)",
      "timestamp_seconds": 0.0,
      "content": "Getting started is easy. Explo connects to any relational database or warehouse. And with its low-code functionality, you can build and style dashboards in minutes. Once you're ready, simply embed the dashboard or report into your application with a tiny code snippet. The best part, your end users can use Explo's AI features for their own report and dashboard generation,"
    },
    {
      "speaker": "eliminating customer data requests for your support team. Build and embed a fully white labeled analytics experience in days. Try for free at explo.co/lenny. That's E-X-P-L-O dot C-O slash Lenny.",
      "timestamp": "00:05:08)",
      "timestamp_seconds": 0.0,
      "content": "This episode is brought to you by Dovetail, the AI first customer insights hub for all teams. Dovetail has always been the go-to tool for teams who want to find insights in customer calls, user interviews, or documents. Now they've stepped it up with the release of Dovetail 3.0. that's three new products and a ton of AI features that make it faster and easier than ever before to truly get at the heart of what your customers want. You can get a real-time pulse on what your customers are thinking with Dovetail's, automated feedback analysis platform, channels, or pull summaries and insights from every customer interaction your team has ever had with their AI chatbot Ask Dovetail. You can even recruit from over 3 million participants directly in Dovetail. All this is just the tip of the Iceberg. Dovetail wants to give everyone in their organization instant access to their customers at any time. From roadmaps, discovery, to strategy sessions and more, it's never been easier to make customer-centric decisions. The good news is Lenny's listeners can try Dovetail's Pro plan along with their newest products and features free for 30"
    },
    {
      "speaker": "days. Just go to dovetail.com/lenny.",
      "timestamp": "00:06:18)",
      "timestamp_seconds": 0.0,
      "content": "I want to start with something that I think is most unique from what I've heard, and I think there's going to be a lot of really unique approaches to how you all think about growth. One of the most interesting things I've heard is that how you think about churn and retention. To most companies, the most important thing is to increase retention, reduce churn. My sense or my understanding is you guys are kind of the opposite. You one, don't think tons about churn, you almost optimize for churn. Talk about that. How does that work?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "00:06:48)",
      "timestamp_seconds": 0.0,
      "content": "The way we think about churn is really going back to Shopify as a kind of our mission and what we want to do, which is to increase the amount of entrepreneurship on the internet. And so as a business, we want to make it as easy as possible to get started with your online store,"
    },
    {
      "speaker": "with your business.",
      "timestamp": "00:07:06)",
      "timestamp_seconds": 0.0,
      "content": "But most businesses do ultimately fail. And so the way we look at it is can we lower the barriers to getting started and get as many people in the door trying their hand at entrepreneurship? If we do that, again, many of those businesses, many of those folks will maybe on their first attempt not be as successful, but we're going to have a set of merchants who go on to become extremely big businesses, the Allbirds of the world, FIGS,"
    },
    {
      "speaker": "etc.",
      "timestamp": "00:07:36)",
      "timestamp_seconds": 0.0,
      "content": "And the way the Shopify business model works is we do charge a subscription, but most of our revenue comes from payments, which is tied to directly to a merchant's success. So in a given cohort of merchants, a lot of people will start. Some of those people on their first attempt that's entrepreneurship might not succeed, but the folks who do go on to be successful will make that entire cohort of merchants who started something that makes Shopify as a business extremely successful. And that's why we lower the barriers to get started and help folks grow,"
    },
    {
      "speaker": "and those winners make the whole thing work.\n\nLenny Rachitsky",
      "timestamp": "00:08:12)",
      "timestamp_seconds": 0.0,
      "content": "I love that. So what I'm hearing is it's not that you don't want people to stick around,"
    },
    {
      "speaker": "it's not that you don't want people to succeed. It's that you're not optimizing every new shop for sticking around long-term. It's basically make it as easy as possible for people to try it. And all you need is a few big wins for it to all work out.\n\nArchie Abrams",
      "timestamp": "00:08:33)",
      "timestamp_seconds": 0.0,
      "content": "Correct. And that's really a different insight than most SaaS companies that they get a customer,"
    },
    {
      "speaker": "they really never want that person to leave. And we want to lower that barriers to get started and be successful.\n\nLenny Rachitsky",
      "timestamp": "00:08:44)",
      "timestamp_seconds": 0.0,
      "content": "One of the main reasons companies focus so much on churn and retention is because it costs them a lot of money to drive new customers and users. I imagine there's almost an implied it's really cheap for you all to find new customers because of maybe the brand and word of mouth. Is that true?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "00:08:59)",
      "timestamp_seconds": 0.0,
      "content": "I think that definitely has some dynamics. I think the bigger factor is the monetization model. For most SaaS companies, they're making from a subscription, right? 29 bucks a month is the only way that they're going to really monetize. Whereas our business works, you have folks who are paying a subscription. But as folks get bigger, because we're monetizing on that GMV that that merchant is producing or the revenue the merchant is producing in the form of payments and other services, it allows us to grow with the merchant in those really successful merchants,"
    },
    {
      "speaker": "make the whole system work well.\n\nLenny Rachitsky",
      "timestamp": "00:09:34)",
      "timestamp_seconds": 0.0,
      "content": "Got it. So basically, your net dollar retention or network revenue retention is just absurd for the winners and it makes up for all the losers slash not losers,"
    },
    {
      "speaker": "people that have tried to build an online-\n\nArchie Abrams",
      "timestamp": "00:09:44)",
      "timestamp_seconds": 0.0,
      "content": "Yes, tried and haven't been very successful. When you can think of the other parallel is in angel investing, right? Most of angel investments are not going to work out,"
    },
    {
      "speaker": "but the couple that do make that entire investment portfolio successful.\n\nLenny Rachitsky",
      "timestamp": "00:10:00)",
      "timestamp_seconds": 0.0,
      "content": "With retention not being the primary goal and the metric you guys focus on optimizing, how do you know if you're doing well? Is it some number of these winners have to come out every quarter, every year? How do you think about progress and achieving, and success basically for growth?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "00:10:18)",
      "timestamp_seconds": 0.0,
      "content": "This way is thinking about a cohort of users we acquire in a given time period, say a quarter. And then over the next year, two years, three years, four years, five years, how much GMV have those merchants produced in total? Not about per merchant basis, but in total, did that cohort generate GMV? And if they generate GMV, that will translate into revenue and gross profit and all of those things that we can then use to reinvest in growing the business. So it's really looking at the total value,"
    },
    {
      "speaker": "but on that GMV basis. And GMV is a power law based metric. And so it's really that power law that drives the success of each cohort.",
      "timestamp": "00:10:56)",
      "timestamp_seconds": 0.0,
      "content": "Again, going back to investing, same thing there. Each vintage from a fund, how much did that return as a fund?"
    },
    {
      "speaker": "And it's really driven by the few really successful outliers.\n\nLenny Rachitsky",
      "timestamp": "00:11:09)",
      "timestamp_seconds": 0.0,
      "content": "So this begs the question, that sounds like a very long feedback loop. And I don't know what I do with that information if five years from now, \"Oh okay, that was a really good idea we did five years ago.\""
    },
    {
      "speaker": "Correct.\n\nLenny Rachitsky",
      "timestamp": "00:11:19)",
      "timestamp_seconds": 0.0,
      "content": "Comment on that. It touches on something you said about how metrics aren't actually a driver of how you all think at Shopify,"
    },
    {
      "speaker": "so take that wherever you want to go.\n\nArchie Abrams",
      "timestamp": "00:11:26)",
      "timestamp_seconds": 0.0,
      "content": "Yeah. So it's interesting. I think with Shopify, we very purposely set up different parts of the org to think on very different time horizons and with very different ways of thinking about how to build product and the like. Very different than a lot of companies that typically, have maybe one kind of unified,"
    },
    {
      "speaker": "there's one north star that the entire company is rallying around.",
      "timestamp": "00:11:49)",
      "timestamp_seconds": 0.0,
      "content": "And so there's three major product groups at Shopify. There's core product which is basically building the 100 year, the right things for commerce 100 years from now. There's merchant services which is building things like payments, shipping, the tools that entrepreneurs need to be successful with a more shorter or medium term horizon. And then growth is really thinking about that end-to-end customer journey. How can we bring folks on and make sure they're successful? (00:12:19): And then from a metrics standpoint,"
    },
    {
      "speaker": "we do have obviously some leading indicators in growth that we're looking at on a given experiment or what have you. But the key in what we try to instrument in our experimentation is the ability to really look at longterm effects of experiments.",
      "timestamp": "00:12:37)",
      "timestamp_seconds": 0.0,
      "content": "So we constantly will relook at an experiment a year later, see that the way the GMV curve for the distribution was different than we might've originally thought. And that'll actually change what we do from that previous experiment. And so there's a lot of longterm monitoring of experiments over these very long time horizons to both inform what those input metrics are and more importantly hold ourselves accountable to, did we actually move what we cared about, which is that longterm GMV, in the right way?"
    },
    {
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:13:12)",
      "timestamp_seconds": 0.0,
      "content": "Wow. Okay. I want to spend more time here. So the way you're describing it is the way the business operates is you think, what is our 100-year plan? How do we think, where does this need to be in 100 years? And with that, it allows you to run these long holdout experiments to see, is something we're doing impacting the business broadly? And because you think so longterm, you can take a year, or two, or three to see if there's an impact and then make adjustments versus I'm having to drive a certain metric every quarter,"
    },
    {
      "speaker": "every year.\n\nArchie Abrams",
      "timestamp": "00:13:47)",
      "timestamp_seconds": 0.0,
      "content": "Correct. And I mean on growth, we're definitely in the... We want to drive metrics on a short-term basis and we can do that obviously, but we have the luxury, and the way Tobi thinks about the world and the way we operate, to really think about these longterm effects and make sure that we're holding ourselves accountable with these longterm holdouts, and then constantly refining the input metrics that we're using and getting a lot smarter about that. But because we take that long horizon,"
    },
    {
      "speaker": "it allows us to be better in the short term and just get a lot smarter.",
      "timestamp": "00:14:17)",
      "timestamp_seconds": 0.0,
      "content": "And a lot of counterintuitive things. And I would encourage everyone, if you can, look at some of the experiments that you thought were your biggest winners. Look at the downstream metrics for a year,"
    },
    {
      "speaker": "two years on that experiment. And I'll bet you'd be surprised how many times the metric is different than what you thought it would be after a year.\n\nLenny Rachitsky",
      "timestamp": "00:14:36)",
      "timestamp_seconds": 0.0,
      "content": "Because where people just make a call at a certain point in time, here's the list in it, here's the list experience. I love this, because very few people have experiences running a longterm experiment, and so this is a really interesting insight that you're sharing that, I guess how often do you find this to be true in your long-term holdouts, where things end up being very different downstream?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "00:14:59)",
      "timestamp_seconds": 0.0,
      "content": "I think there's probably two things that have been very common. And I would say in quite a few cases, you get a lift on a metric up front, a more short-term metric. Number of people who become a paying shopper, number of people who make their first sale in Shopify. And then you look a year later,"
    },
    {
      "speaker": "and there's actually no incremental lift on GMV from that cohort.",
      "timestamp": "00:15:21)",
      "timestamp_seconds": 0.0,
      "content": "And so I think it actually trains, a lot of us in growth are looking at these short-term metrics. A lot of the time it's actually more pull-forward effect,"
    },
    {
      "speaker": "than you fully realize or an incremental user that's just really not worth that much. So that's one.",
      "timestamp": "00:15:35)",
      "timestamp_seconds": 0.0,
      "content": "And then two, so this effect size goes away. There are cases where the experiment has flipped the other way. And then there are cases, and these are the most interesting ones, where you realize that you uncovered a pocket of merchants that are actually extremely valuable entrepreneurs who go on to be successful,"
    },
    {
      "speaker": "that you missed in your normal short-term measurement techniques. And so all across the board we see that. But actually the most common is it actually isn't a long-term lift from a lot of things that you might think of the short-term are.\n\nLenny Rachitsky",
      "timestamp": "00:16:16)",
      "timestamp_seconds": 0.0,
      "content": "Is there an example in that second bucket of what you mean when you say there's a pocket of valuable merchants?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "00:16:22)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, I think a lot of this has to do with, we call it monetary friction. So one of the hardest things to do with a business is when you're getting started, is you might not have any revenue coming in, and you are kind of bootstrapping, which in Shopify's case might be 39 bucks a month. But still,"
    },
    {
      "speaker": "it's a real expense.",
      "timestamp": "00:16:43)",
      "timestamp_seconds": 0.0,
      "content": "And so typically when you can lower the barriers to monetary friction in some form, that could be all sorts of monetary friction early. The common belief is that we'll usually get lower quality folks coming in the door,"
    },
    {
      "speaker": "because usually discounts are associated with lower quality.",
      "timestamp": "00:17:03)",
      "timestamp_seconds": 0.0,
      "content": "If you think about in a business case, if I give you a little monetary boost and reduce that monetary friction, I can actually causally change your ability to become successful,"
    },
    {
      "speaker": "To make it work.\n\nLenny Rachitsky",
      "timestamp": "00:17:40)",
      "timestamp_seconds": 0.0,
      "content": "Okay. So just roughly, do you have a sense of how often you find no effect after a year that you saw early impact?"
    },
    {
      "speaker": "Just to ballpark that.\n\nArchie Abrams",
      "timestamp": "00:17:50)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, it's in the 30 to 40%"
    },
    {
      "speaker": "range.\n\nLenny Rachitsky",
      "timestamp": "00:17:51)",
      "timestamp_seconds": 0.0,
      "content": "Okay. I think you're tearing the heart out of so many growth people right now,"
    },
    {
      "speaker": "and nobody wants to hear this that works on growth where you're saying potentially a third of the experiments they're running today that are showing lift probably don't have that same... Don't have any impact down the road.\n\nArchie Abrams",
      "timestamp": "00:18:09)",
      "timestamp_seconds": 0.0,
      "content": "Yes. Unfortunately,"
    },
    {
      "speaker": "I think that's brutal. Probably more common than we like to believe.\n\nLenny Rachitsky",
      "timestamp": "00:18:15)",
      "timestamp_seconds": 0.0,
      "content": "Yes, and nobody wants to hear this, except people that you should want to hear this because if you want to build a business that grows and need to grow,"
    },
    {
      "speaker": "Yeah.\n\nLenny Rachitsky",
      "timestamp": "00:18:29)",
      "timestamp_seconds": 0.0,
      "content": "Okay. So for people that can't run whole long hold that experiments, I guess is there anything that you find is a good early indicator that might be the case? Most people don't have time to sit around and wait a year or two or three. They're not thinking 100"
    },
    {
      "speaker": "years.\n\nArchie Abrams",
      "timestamp": "00:18:43)",
      "timestamp_seconds": 0.0,
      "content": "I mean I think end of the day that is going to be the most effective and you actually learn the most. I think it is, though even in shorter term horizons, really being as specific as you can be about what are the early signs of success in your product, and making sure you instrument those. And then making sure, particularly up funnel experiments,"
    },
    {
      "speaker": "you are actually looking at the further downstream metrics to make sure you have some understanding of what's moving down.",
      "timestamp": "00:19:17)",
      "timestamp_seconds": 0.0,
      "content": "So as deep as you can go in the funnel for as long as you can wait. Do that. And if you can't, you know what I would say? Still you should just bet on, if something is showing lift up funnel, still ship it and it's probably not going to hurt you,"
    },
    {
      "speaker": "but don't overestimate the amount of impact that this is having.",
      "timestamp": "00:19:34)",
      "timestamp_seconds": 0.0,
      "content": "So it's funny, two things here is, my recommendation to folks is don't think, \"Oh my goodness, I have to wait all this time.\" Because if you didn't move the short-term impact, you're not going to have the long-term lift. So still ship if it's short-term lift. Just be reasonable that if you can measure it longer term,"
    },
    {
      "speaker": "you'll get better about identifying what things are that are really impactful.\n\nLenny Rachitsky",
      "timestamp": "00:19:57)",
      "timestamp_seconds": 0.0,
      "content": "Got it. And so it may be positive initially, but often neutral. Rarely is it neutral initially and then positive down the road?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "00:20:09)",
      "timestamp_seconds": 0.0,
      "content": "There are some cases of that, but it's rarely... I've seen neutral be positive,"
    },
    {
      "speaker": "That resulted positive. \n\nLenny Rachitsky",
      "timestamp": "00:20:17)",
      "timestamp_seconds": 0.0,
      "content": "Got it. Okay. So that's reassuring. You're not harming the business,"
    },
    {
      "speaker": "Likely.\n\nLenny Rachitsky",
      "timestamp": "00:20:28)",
      "timestamp_seconds": 0.0,
      "content": "Likely, right?"
    },
    {
      "speaker": "Likely.\n\nLenny Rachitsky",
      "timestamp": "00:20:29)",
      "timestamp_seconds": 0.0,
      "content": "And there's also just trade-offs to moving on and on balance, you're probably doing good things if you continue to ship things that are showing positive. Right?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "00:20:39)",
      "timestamp_seconds": 0.0,
      "content": "100%."
    },
    {
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:20:40)",
      "timestamp_seconds": 0.0,
      "content": "Okay. This is awesome. For people that want to run long-term holdout experiments, I imagine you've built your own experimentation system internally? Yeah,"
    },
    {
      "speaker": "Yeah.\n\nLenny Rachitsky",
      "timestamp": "00:20:51)",
      "timestamp_seconds": 0.0,
      "content": "And is it basically you hold out 10%, say it was some percentage of users from seeing the new change? Is that how you approach it or is there a different way of approach?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "00:20:59)",
      "timestamp_seconds": 0.0,
      "content": "Two things. We have two layers of holdouts. So one is more the holdouts of every change in a quarter, holdout 5% across the board. Second is for changes that only affect new merchants, what we'll do is we'll take that group of folks, let's call it 50/50 split, and then run that for a few weeks. And then what we're doing, we look at the long-term effects is actually ship the winner to 100%,"
    },
    {
      "speaker": "but we're looking at the cohort of folks who was assigned to the experiment. We're going back and looking at those people who were assigned a year later.",
      "timestamp": "00:21:36)",
      "timestamp_seconds": 0.0,
      "content": "So it allows us to still ship, get stuff out, but we've kind of held the experiment in a way that allows us to see those long-term effects just for the cohort that was exposed. That only works if you're doing it on new users. For existing, it's a little more complicated. That's okay. And then in our experimentation tools, all experimenters are paying that three months, six months, nine months, 12 months with here are the updated results. So you can't really get hide from, what did this really result in over a longer term horizon?"
    },
    {
      "speaker": "Correct.\n\nLenny Rachitsky",
      "timestamp": "00:22:16)",
      "timestamp_seconds": 0.0,
      "content": "I love that. Okay, that's awesome. It's interesting that you use kind of these cohort curves for GMV, and is that the core metric you look at to see?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "00:22:25)",
      "timestamp_seconds": 0.0,
      "content": "There's a few GMV,"
    },
    {
      "speaker": "So it's interesting. Most people use cohort retention curves. You're using cohort because you don't look at retention. You're looking at for GMV over time. So that's really interesting. \n\nArchie Abrams",
      "timestamp": "00:22:45)",
      "timestamp_seconds": 0.0,
      "content": "GMV over time,"
    },
    {
      "speaker": "which correlates better. And there's a retention in profit. And then really the absolute number of merchants who are on the platform and then reaching certain GMV.\n\nLenny Rachitsky",
      "timestamp": "00:22:56)",
      "timestamp_seconds": 0.0,
      "content": "Okay, I'm going to not keep falling this path. We can go on and on. While we're in the topic of experiments and what you've done, I'm curious if there's any examples of big wins that your team has shipped that might inspire people as they're thinking about launching experiments. I know there's probably some trade secret stuff you don't want competitors to know, and I know this is particular to Shopify and a platform in eCommerce. But I guess is there anything that would be worth sharing of like, \"Here's a huge win that maybe we didn't expect.\""
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "00:23:25)",
      "timestamp_seconds": 0.0,
      "content": "Going back, there's always a lot of value in thinking through monetary friction as I mentioned. That's always going to be something to export. Trial dynamics, different types of incentives,"
    },
    {
      "speaker": "all of those things are very impactful.",
      "timestamp": "00:23:39)",
      "timestamp_seconds": 0.0,
      "content": "I would say on things that are maybe more practical and for everyone, there's an enormous amount, and we do see these with long-term effects. But just the nuts and bolts of sign up, collecting the right information. And you usually want to collect more information than most people think you do in your sign up flow. If you can then leverage that to personalize the guidance. And this is for SaaS product,"
    },
    {
      "speaker": "the guidance that someone can get when they onboard into Shopify.",
      "timestamp": "00:24:09)",
      "timestamp_seconds": 0.0,
      "content": "So whether you're coming on, Shopify is a very diverse product, in-person selling, online selling different channels. There's the nuts and bolts of get more information from folks, build trust in there,"
    },
    {
      "speaker": "give them right amount of guidance when they come on in a personalized way.",
      "timestamp": "00:24:25)",
      "timestamp_seconds": 0.0,
      "content": "And that may sound like, okay, that's kind of obvious. But the amount of impact by just nailing those flows has never ceased to amaze me and setting up that person for long-term success. So monetary friction. Then just really good onboarding, personalization,"
    },
    {
      "speaker": "a well of opportunities there.\n\nLenny Rachitsky",
      "timestamp": "00:24:49)",
      "timestamp_seconds": 0.0,
      "content": "I love that onboarding comes up every time I ask anyone where they've seen ongoing success and opportunities, particularly in actually surprisingly driving retention. It's interesting that that's not what you look at, but it turns out that's one of the biggest levers for increasing retention. Interesting that even for a company that doesn't look at retention,"
    },
    {
      "speaker": "that's a big opportunity.\n\nArchie Abrams",
      "timestamp": "00:25:07)",
      "timestamp_seconds": 0.0,
      "content": "Yes. Yeah, it's really because it's setting people up, for Shopify's case,"
    },
    {
      "speaker": "I think the big thing about all of our metrics is... What we get very nervous about is the easiest way to increase retention is always to constrict the funnel stage one above the retention metric you're trying to optimize for.",
      "timestamp": "00:25:27)",
      "timestamp_seconds": 0.0,
      "content": "The simplest way to increase my signup to activated thing is just make it harder to sign up. Nuts and bolts, that will always happen is when you have teams on that local conversion rates, you get all these weird team incentives,"
    },
    {
      "speaker": "because they're optimizing to basically implicitly make it harder to do the step before them.",
      "timestamp": "00:25:49)",
      "timestamp_seconds": 0.0,
      "content": "And because we focus on that long-term GMV, number of merchants who are successful, orienting every team to think about the total number of people, not the rate, but the total number of people who got to the end of their part of the journey is a very powerful way to incentivize people to do the right thing in terms of getting people set up versus do the, \"I'm going to constrict the funnel step right before me to make my local conversion rate look better,\" which is the bane of my existence but something I see a lot of teams,"
    },
    {
      "speaker": "Incentives. What a power.\n\nArchie Abrams",
      "timestamp": "00:26:34)",
      "timestamp_seconds": 0.0,
      "content": "Incentives, what a power,"
    },
    {
      "speaker": "what a lever.\n\nLenny Rachitsky",
      "timestamp": "00:26:36)",
      "timestamp_seconds": 0.0,
      "content": "I definitely want to chat a little bit more about metrics. I know you have a really interesting take that's kind of built on what you're just talking about. But first of all, you mentioned this term monetary friction as one of the levers that you've seen success with. Can you just describe what that actually means?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "00:26:48)",
      "timestamp_seconds": 0.0,
      "content": "Totally. So things like trial, trial dynamics, trial length, trial amount. It means incentives. So what is in your product? What do people value and need in order to be successful? So in Shopify's case, that might be app score credits or things like that,"
    },
    {
      "speaker": "but those are the two forms of monetary friction we talk about and then of course actual price point. But that's what the larger bucket of monetary friction is.\n\nLenny Rachitsky",
      "timestamp": "00:27:16)",
      "timestamp_seconds": 0.0,
      "content": "So let's follow this thread of metrics. You're big on absolute numbers and you've been talking about this already,"
    },
    {
      "speaker": "versus percentages and ratios. Talk about that and how you encourage your teams to think about metrics.\n\nArchie Abrams",
      "timestamp": "00:27:29)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, I think one of the things that I think happens particularly in large, in Shopify's growth order, it's about 600 folks. When you have teams naturally break up the world into different funnel stages or different points in the journey, it gets very seductive to look at my part of the funnel, and what's my conversion rate through that part of the funnel? And then the team starts to optimize for that conversion rate as their north star over a longer time period. I'm going to try to move my conversion rate from 10 to 12%"
    },
    {
      "speaker": "or what have you.",
      "timestamp": "00:28:04)",
      "timestamp_seconds": 0.0,
      "content": "But in practice, I talked about it's actually almost always easier to just make it harder to do the thing right before your step in the funnel to increase your conversion rate. If I make it harder to sign up, it's going to be very easy to increase sign up to activated rate,"
    },
    {
      "speaker": "because I just have fewer people and the people who made it through our higher intent.",
      "timestamp": "00:28:23)",
      "timestamp_seconds": 0.0,
      "content": "And so I see teams get really stuck when they are trying to optimize conversion rate, but they just make it harder to do the previous thing. Versus everyone is thinking about absolute number of people who made it through their \"stage\" of the funnel. So instead of I'm trying to convert a bunch of people, a conversion rate,"
    },
    {
      "speaker": "I just want more people to get activated.",
      "timestamp": "00:28:48)",
      "timestamp_seconds": 0.0,
      "content": "And then once you start thinking that way, you realize actually the best way to get more people to get to a step sometimes,"
    },
    {
      "speaker": "and often they just get more people in the door in the first place. So make it easier to sign up or reduce friction. It's the opposite.",
      "timestamp": "00:29:05)",
      "timestamp_seconds": 0.0,
      "content": "Because that will always hurt your conversion rate, but it may actually give you more people on the outside. And a lot of teams get very nervous, their retention rate went down, their LTV went down. Oh my goodness, is this this going to affect our ability to pay? No, your CAC also went down by probably more. And so now you have the ability to likely spend more and you have more people through the door,"
    },
    {
      "speaker": "getting to each point in the activation or the immersion journeys.\n\nLenny Rachitsky",
      "timestamp": "00:29:33)",
      "timestamp_seconds": 0.0,
      "content": "What I'm hearing is essentially teams are gold not on increase, lift this conversion step by some percentage. It's drive some absolute number of new merchants,"
    },
    {
      "speaker": "potentially.\n\nArchie Abrams",
      "timestamp": "00:29:45)",
      "timestamp_seconds": 0.0,
      "content": "Merchants,"
    },
    {
      "speaker": "yeah. Exactly. \n\nLenny Rachitsky",
      "timestamp": "00:29:47)",
      "timestamp_seconds": 0.0,
      "content": "This is a good segue to I want to hear how you structure your growth team at Shopify. Essentially, what's the raw structure, what are the different teams, and what do they focus on? And then what are the functions within each teams?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "00:29:59)",
      "timestamp_seconds": 0.0,
      "content": "We have two big groups within growth. So one is what we call growth R&D. So this might be what you traditionally consider product design engineering, data, your traditional product teams. Then we have growth marketing, which in Shopify's case is paid acquisition, media buying, affiliate marketing, email, content, and SEO. So that's growth R&D,"
    },
    {
      "speaker": "growth marketing.",
      "timestamp": "00:30:23)",
      "timestamp_seconds": 0.0,
      "content": "Within growth R&D, three pillars. One is what we call growth products. And so this is basically everything from landing pages, sign up, onboarding, monetization. So trial, incentives, the like, all the way through to what we call our home feed, our engagement to basically get more merchants. Again, not necessarily to retain, but to keep giving entrepreneurship a try to become bigger and bigger businesses. So that's growth product,"
    },
    {
      "speaker": "the full life cycle there.",
      "timestamp": "00:30:56)",
      "timestamp_seconds": 0.0,
      "content": "Second is what we call our enable pillar, and this pillar is building tools for both growth and the rest of Shopify. So things like experimentation platform, our communication platform, our business intelligence tooling that powers a lot of what we're doing,"
    },
    {
      "speaker": "our more tech work to support our growth marketing team.",
      "timestamp": "00:31:14)",
      "timestamp_seconds": 0.0,
      "content": "And then our third bucket, which is maybe a little different from most growth teams is actually our customer support, groups within growth. We want to think about customer support as part of this merchant journey of coming on, giving entrepreneurship a try, all the way through to here's the support I need as I'm becoming a multi-billion dollar business on Shopify. So those are the three big growth product buckets. And then within growth marketing, it's a more traditional channel setup. Paid, all the different channels online, offline, SEO, email,"
    },
    {
      "speaker": "and affiliates.\n\nLenny Rachitsky",
      "timestamp": "00:31:49)",
      "timestamp_seconds": 0.0,
      "content": "Super cool. Okay. So within growth RD, I just took notes. I'm going to summarize what you just shared, which is awesome. So there's three big buckets. One is growth product, which essentially is onboarding. It feels like it's like the top of funnel, get people in. Well okay,"
    },
    {
      "speaker": "That's super top funnel. \n\nLenny Rachitsky",
      "timestamp": "00:32:08)",
      "timestamp_seconds": 0.0,
      "content": "Yeah. Okay, got it. So growth marketing, drive people to Shopify.com. Then within RD team,"
    },
    {
      "speaker": "Correct. Both growth and outside growth.\n\nLenny Rachitsky",
      "timestamp": "00:32:29)",
      "timestamp_seconds": 0.0,
      "content": "Awesome. Okay. And then the customer support team, that's really interesting. So there's a customer support product team that helps new merchants be successful. And does that include actual customer support agents? Is that within that team?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "00:32:46)",
      "timestamp_seconds": 0.0,
      "content": "That's not. We build a tooling to make those support advisors superheroes. And then on the help center,"
    },
    {
      "speaker": "all of our AI stuff to make a great customer experience for people who are just engaging in a self-serve. So it's the tooling and the experience for merchants.\n\nLenny Rachitsky",
      "timestamp": "00:33:03)",
      "timestamp_seconds": 0.0,
      "content": "Okay. So with these teams, is there anything you can share about just how you think about metrics/goals for these different buckets? We don't need to get too deeply, but does everyone basically have an absolute new merchants goal or is it a little different?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "00:33:18)",
      "timestamp_seconds": 0.0,
      "content": "So yeah. So at the highest level we think about that total cohort value. We bring in a set of merchants in a given year. How much GMV, how much that set of merchants worth over the next three, four years to Shopify? And that's the most important thing that we want to focus on. And then that of course, from an efficiency standpoint,"
    },
    {
      "speaker": "that of course meeting our payback guardrails and all of that. So that's the macro growth perspective. Cohort value over cost and payback. So that's the macro point of view.",
      "timestamp": "00:33:52)",
      "timestamp_seconds": 0.0,
      "content": "And then within growth marketing, each channel operates with certain guardrails around their LTV CACs. Same thing for content and SEO. That operates with kind of a guardrail model for each piece of content. How much is that going to come back and down the line? (00:34:09): For growth products, it's also a combination of total GP incremental cohort value that's produced from those teams. So everything is basically going to be measured on from an experiment, ideally measured over a very long time period. What was the incremental cohort value lift that this generated?"
    },
    {
      "speaker": "And that's how we think about and measure the impact of each of those sub teams along the way.",
      "timestamp": "00:34:40)",
      "timestamp_seconds": 0.0,
      "content": "Each of those have a civic part of the funnel they play with. But because they're measured on absolutes and they really think about that absolute value, we don't get caught into, did your conversion rate over the course of this year go up or down? It's kind of irrelevant. What was the sum of the impact over a long period on that total cohort value that we're trying to produce from before merchants?"
    },
    {
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:35:01)",
      "timestamp_seconds": 0.0,
      "content": "And the way you come up with this goal I imagine is you have a forecast of where things would go organically, and then here's the lift we want to see from the work this team does this quarter,"
    },
    {
      "speaker": "this year.\n\nArchie Abrams",
      "timestamp": "00:35:12)",
      "timestamp_seconds": 0.0,
      "content": "Correct. And then we're going to measure against for each experiment, did it actually get to where we expect that lift to be?"
    },
    {
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:35:21)",
      "timestamp_seconds": 0.0,
      "content": "And those experiments again,"
    },
    {
      "speaker": "are those all long-term holdout experiments where you look wait a year or some-\n\nArchie Abrams",
      "timestamp": "00:35:29)",
      "timestamp_seconds": 0.0,
      "content": "We call. We call the experiment after three weeks, but in all cases, the group is held, we watch them. And that's where that ping comes back, every experiment is watched. And that ping comes back three, six months, 12 months to re-look at was this actually successful?"
    },
    {
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:35:42)",
      "timestamp_seconds": 0.0,
      "content": "Okay,"
    },
    {
      "speaker": "cool.\n\nArchie Abrams",
      "timestamp": "00:35:44)",
      "timestamp_seconds": 0.0,
      "content": "So that creates the loop of shipping value quickly, but making sure we're holding ourselves accountable to did this actually produce results over a long period, or did it actually just have this neutral effect? It's like, oh,"
    },
    {
      "speaker": "then we can learn from that and get better.\n\nLenny Rachitsky",
      "timestamp": "00:36:01)",
      "timestamp_seconds": 0.0,
      "content": "This episode is brought to you by Dovetail, the AI-first customer insights hub for all teams. Dovetail has always been the go-to tool for teams who want to find insights in customer calls, user interviews, or documents. Now they've stepped it up with the release of Dovetail 3.0. That's three new products and a ton of AI features that make it faster and easier than ever before to truly get at the heart of what your customers want. You can get a real-time pulse on what your customers are thinking with Dovetail's, automated feedback analysis platform, channels, or full summaries and insights from every customer interaction your team has ever had with their AI chatbot ask Dovetail. You can even recruit from over 3"
    },
    {
      "speaker": "million participants directly in Dovetail.",
      "timestamp": "00:36:43)",
      "timestamp_seconds": 0.0,
      "content": "All this is just the tip of the iceberg. Dovetail wants to give everyone in their organization instant access to their customers at any time. From roadmaps, discovery, to strategy sessions and more,"
    },
    {
      "speaker": "it's never been easier to make customer-centric decisions.",
      "timestamp": "00:36:58)",
      "timestamp_seconds": 0.0,
      "content": "The good news is Lenny's listeners can try Dovetail's Pro plan along with their newest products and features free for 30"
    },
    {
      "speaker": "days. Just go to dovetail.com/Lenny.",
      "timestamp": "00:37:10)",
      "timestamp_seconds": 0.0,
      "content": "So maybe just to dig into this again, because it's so interesting. Basically, product team ships stuff, they run an experiment, they see impact. Say it's 5% lift on something. Huzzah, you did it. Great work, performance review. Your exceeds, you're doing great. This team's killing it. And then a year later you realize, \"Oh, that didn't last.\" How often do you find a team that is shipping wins looks back and ends up seeing, \"That wasn't actually as successful as it.\""
    },
    {
      "speaker": "I know you said maybe it's a third of the time.\n\nArchie Abrams",
      "timestamp": "00:37:38)",
      "timestamp_seconds": 0.0,
      "content": "30."
    },
    {
      "speaker": "Yeah.\n\nLenny Rachitsky",
      "timestamp": "00:37:39)",
      "timestamp_seconds": 0.0,
      "content": "Yeah. Okay, so it's still roughly,"
    },
    {
      "speaker": "yeah.\n\nArchie Abrams",
      "timestamp": "00:37:42)",
      "timestamp_seconds": 0.0,
      "content": "And it's great learning and that's why we take it. It's like, wow, okay, now we really uncovered something and it's such a successful discovery. Wow, okay, we thought this thing. But now we learned it actually wasn't as true as we thought. Cool. What can we take from that and be smarter next time so we don't just double down on the wrong things?"
    },
    {
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:38:02)",
      "timestamp_seconds": 0.0,
      "content": "That's so interesting. And again, and you mentioned most of the reason this is the case when something doesn't show lift down the road is it's pulling forward success that would've been seen later on its own if you had not even shipped this thing?"
    },
    {
      "speaker": "Correct.\n\nLenny Rachitsky",
      "timestamp": "00:38:14)",
      "timestamp_seconds": 0.0,
      "content": "Awesome. Is there an example by any chance that comes to mind of something like that that's just like, \"Wow, that was a big win. And then oh I see we just pulled forward some revenue from the future.\""
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "00:38:25)",
      "timestamp_seconds": 0.0,
      "content": "So I think one good example is something around payment failure notifications. So one of the things that a lot of teams have or see is we call Dunning effects where somebody might have a payment not go through, a credit card that doesn't go through. So we did a bunch of experimentation around, hey, how can we alert people that their credit card is failed, their payment attempt failed? (00:38:47): And that's a typical growth win, usually produces a lot of short-term impact. And that's what we saw here. We were doing much better alerting, reminding people, sending them a million emails about it. Cool,"
    },
    {
      "speaker": "we got some pretty major lift.",
      "timestamp": "00:38:59)",
      "timestamp_seconds": 0.0,
      "content": "You look back six, 12 months. There was really no long-term lift. And why is that? Because there's really a little bit of a selection bias there that people who were letting that payment fail probably weren't actually that dedicated to this entrepreneurship craft. They may have updated their credit card,"
    },
    {
      "speaker": "but they still really weren't in it.",
      "timestamp": "00:39:22)",
      "timestamp_seconds": 0.0,
      "content": "And so that was a good example of in a bunch of this stuff around payments, even \"preventing\" churn where you look, it's six, 12, 18 months. On a GMV metric,"
    },
    {
      "speaker": "not a lot of lift over that long-term horizon.\n\nLenny Rachitsky",
      "timestamp": "00:39:37)",
      "timestamp_seconds": 0.0,
      "content": "I love this example. I could see so many people having run experiments like this and like, \"Oh, we found such a huge win. This team's killing it. What a great idea. Of course this makes sense,\""
    },
    {
      "speaker": "and then turns out it's nothing long term.\n\nArchie Abrams",
      "timestamp": "00:39:54)",
      "timestamp_seconds": 0.0,
      "content": "Which is great. We were going to spend a lot of time, okay, what else can we do here? It's like,"
    },
    {
      "speaker": "no actually bigger fish to fry in a lot of other areas. So it helps the team just feel really good that their work is really the things that were good.",
      "timestamp": "00:40:13)",
      "timestamp_seconds": 0.0,
      "content": "Another one that went the other way, which was really interesting was in our online store, and this might be if you use Shopify, we have sections and blocks that come pre-configured. And so we tested, okay, if we give you a pre-configured block of you should have an image up top, then a text banner,"
    },
    {
      "speaker": "and then a collage with your products. That should help folks understand what to do when they're building the online store. It actually had no lift in people converting to a paying merchant.",
      "timestamp": "00:40:48)",
      "timestamp_seconds": 0.0,
      "content": "However, when we looked longer term on that six months later, it had a pretty massive impact on the number of people who were selling and producing GMV. And why is that? Because it didn't likely really influence anyone to buy Shopify or pay for Shopify. But the people who used it created better stores that were higher converting, and so they got early sales. They actually converted one of their visitors and they got momentum,"
    },
    {
      "speaker": "and they stuck with entrepreneurship a little bit longer. And we saw that in that opposite way.",
      "timestamp": "00:41:21)",
      "timestamp_seconds": 0.0,
      "content": "And so this is an example where that neutral,"
    },
    {
      "speaker": "and so we tend to ship neutral. It's like it could be positive and so let's let it go if we have good intuition about it and it'll turn. So we've seen a bunch of these things go in very different directions.\n\nLenny Rachitsky",
      "timestamp": "00:41:36)",
      "timestamp_seconds": 0.0,
      "content": "This is so fascinating. I didn't realize that you ship neutral experiments. That's an interesting insight. So it's like if you feel good about it and it's neutral, you ship it?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "00:41:45)",
      "timestamp_seconds": 0.0,
      "content": "In our culture of the kind of aim heavy, if the intuition is right that this probably is helping merchants, why do we start with that the original control is better if it's neutral? Let's start with, what would we have shipped if we were a blank slate? And if it's neutral, actually neither is better,"
    },
    {
      "speaker": "so let's just pick the one we feel better about and ship that. \n\nLenny Rachitsky",
      "timestamp": "00:42:03)",
      "timestamp_seconds": 0.0,
      "content": "Makes so much sense. Oh man. Okay, so let's talk about this a little bit more. So this aim heavy concept, this idea of thinking 100 years out, can you just share more about that insight and that philosophy?"
    },
    {
      "speaker": "I know it sounds like it comes from Tobi of how he likes to think about the business.\n\nArchie Abrams",
      "timestamp": "00:42:18)",
      "timestamp_seconds": 0.0,
      "content": "Totally. It is all Tobi of really making sure Shopify is so oriented around, we are here to build 100 year company. And so the decisions we're going to make are really oriented towards the long-term success of merchants, of Shopify. Embedded in all of our principles are make the best product in the world, make money to do more of one. Never reverse principles two and three. In every kind of executive meeting, every town hall, that slide comes up. It's like you've been at Shopify, you've probably seen that slide 10,000 times. But it's an important reminder job is to build the best product for merchants over the long period of time. And then all of the metrics and the make money part of it,"
    },
    {
      "speaker": "secondary to that. So what we care about is that long term piece. It ties a little bit to that original conversation about entrepreneurs and being the core of why we just want more people to start businesses and go.",
      "timestamp": "00:43:15)",
      "timestamp_seconds": 0.0,
      "content": "It's very seductive I think in most companies, including in Shopify because we can support large enterprise businesses today, right? Big brands who want to get off an outdated solution and come over to Shopify. It's very easy to just say, \"Oh, that's very concrete.\" There's an existing business,"
    },
    {
      "speaker": "we want to have them come join Shopify.",
      "timestamp": "00:43:40)",
      "timestamp_seconds": 0.0,
      "content": "And in the short term it feels really good. It brings a lot of revenue right away. But if you're thinking about the long-term 100 years from now, guess what? All of the big brands of today be out of business. And many of them will be out of business in 30, 40, 50 years. The real success of Shopify is getting every business to start with us and go, but making that type of an investment and being so focused on that entrepreneur segment and making it easier is how we build a very, very long-term oriented company. So just even how we do capital investment, how we do product decision-making comes back to, hey,"
    },
    {
      "speaker": "we can't chase the short-term. Even more concrete things.\n\nLenny Rachitsky",
      "timestamp": "00:44:24)",
      "timestamp_seconds": 0.0,
      "content": "Is there an example that comes to mind where you did that where something short-term looked like, \"We should definitely do this,\" but we're thinking thinking 100 years out so we're going to approach it this way?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "00:44:35)",
      "timestamp_seconds": 0.0,
      "content": "It's kind of very much just imbued in the culture. Almost everything kind of feels that way. And I'll give, practically speaking, every six weeks all the R&D group leads we get together and we sit with Tobi and each other and review every single project across the company. Every six weeks, every single R&D pull up the dashboard,"
    },
    {
      "speaker": "and look at it.",
      "timestamp": "00:44:56)",
      "timestamp_seconds": 0.0,
      "content": "And in that conversation, so much of the conversation is about both the technical how. How are we building this in a way that allows for Shopify to have optionality in the technical decisions that we are making? And I think for Tobi, one of the things I've learned and so is that how, the technical architecture determines strategy in a technology company even more than the what and who we're building for. If you build the right technical how and set yourself up to have a platform that can be adaptable, flexible, that is incredibly valuable over the long term. It means we will sometimes take longer to ship a feature. It means we'll not chase certain deals or what have you,"
    },
    {
      "speaker": "but we're going to kind of make that investment. And it comes through in all of our reviews and just how we got to do our work together.\n\nLenny Rachitsky",
      "timestamp": "00:45:53)",
      "timestamp_seconds": 0.0,
      "content": "Wow, that is really unique. I've not heard of that where how... Usually it's the opposite. Let's not worry about how we're going to build this thing. It's why are we building this thing and then when are we building it?"
    },
    {
      "speaker": "And not just the architecture is the most important thing.\n\nArchie Abrams",
      "timestamp": "00:46:09)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, I mean in the last one, it was great. We had a 30-minute discussion about how to build CSV importers for people coming over from different platforms, and it was all about are we using open source library, doing it internally, are we doing it in the core code base? Are we building a separate first party app to do it?"
    },
    {
      "speaker": "It was incredible detail.",
      "timestamp": "00:46:29)",
      "timestamp_seconds": 0.0,
      "content": "This is what's amazing about Tobi. The technical detail of how we're going to do this was incredibly important to get right, to kind of set up this type of infrastructure. And most companies it'd be okay what, you're going to make it easier for people to migrate their data over. Cool. Team, go figure out how. And if team does figure out the how do we work on it with Tobi and the details,"
    },
    {
      "speaker": "because the how is so important to how we build for the future.\n\nLenny Rachitsky",
      "timestamp": "00:46:54)",
      "timestamp_seconds": 0.0,
      "content": "That's fascinating. And usually it's how do we do this as quick as possible, because CVS importing is not our core differentiator. It'll just build something good enough, we'll ship it,"
    },
    {
      "speaker": "Correct.\n\nLenny Rachitsky",
      "timestamp": "00:47:02)",
      "timestamp_seconds": 0.0,
      "content": "Totally the opposite. That is fascinating. What's also really interesting about this is I think about Brian Chesky at Airbnb where I worked for a while and his... So one, he also had this idea of the 100-year vision and thinking for the future way out in 100 years. But interestingly, since he's a designer, he had a very different focus. So Tobi, he was an engineer. He still codes from what I can see on Twitter,"
    },
    {
      "speaker": "Absolutely.\n\nLenny Rachitsky",
      "timestamp": "00:47:26)",
      "timestamp_seconds": 0.0,
      "content": "So I could see why his brain goes there and why he's really strong in the how. Brian on the other hand is very focused on the experience and making sure the design is amazing, and the app is exactly what he wants it to feel like. It is very experience oriented. So it's interesting that these founders lean into the thing that they're strong at, and understand deeply, and that ideally connects with the way this business specifically wins and grows. And it makes sense a platform, I could see why engineering would be so essential to get right. Travel, hospitality,"
    },
    {
      "speaker": "consumer app. I could see why design is so important. \n\nArchie Abrams",
      "timestamp": "00:48:03)",
      "timestamp_seconds": 0.0,
      "content": "100%."
    },
    {
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:48:04)",
      "timestamp_seconds": 0.0,
      "content": "Fascinating. One more tidbit that I've heard about how you all think about this is metrics. And you mentioned before we started recording that a lot of the company doesn't actually have metrics that drive what they build, especially within the core business, which I think surprised a lot of people. Most people are like, \"Every team needs a metric and a KPI, and this is how we measure progress and this is how we know if they're doing well.\" Talk about just how that works,"
    },
    {
      "speaker": "how most of the companies doesn't have a metric.\n\nArchie Abrams",
      "timestamp": "00:48:31)",
      "timestamp_seconds": 0.0,
      "content": "Yeah. It's funny, we ran against KPIs are basically banned as OKRs or banned and all that. And so certainly, in growth you have metrics, but they take a different form. And then in core, it truly is, do we have conviction that this is the right technical foundation to build the future of commerce? And that is built through certainly looking at data. So it's not that teams are not looking at data and using it as a piece of their puzzle, but it's not the overriding. And when we go to ship a feature in core, it's not like a team is held accountable for this metric over this six months. It's much more, did we ship the right thing? And we're going to kind of get at that through a variety of lenses. Could be some of that could be data, qualitative,"
    },
    {
      "speaker": "just our own product sense of what's good or not.",
      "timestamp": "00:49:24)",
      "timestamp_seconds": 0.0,
      "content": "And so I think the upside of that is I think we tend to ship things in core and that are incredibly forward-facing and we take more risk. I think to acknowledge some of the downside of it though is sometimes conversations get extremely subjective about what is the right thing to do. And so that requires the right way of having good discussions, openness from all leaders and from teams to debate those things. But it does result in some squishiness, which again has its pros and cons,"
    },
    {
      "speaker": "but taste is what drives a lot of what we're shipping in core.\n\nLenny Rachitsky",
      "timestamp": "00:50:05)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, I'm glad you touched on that. I was going to say, okay, everyone would love this idea of just build things that we think are awesome. It's going to be great. But then you build a whole org with teams and people building stuff. How does one know if they're building things that are good and helping versus not? (00:50:21): And you're pointing out there are pros and cons to that. The pros is we're not optimizing for some short-term wins and driving some poor metric. The con is you might ship stuff that... There's a lot of subjectivity, and people may not agree,"
    },
    {
      "speaker": "and it's a lot of squishy stuff.\n\nArchie Abrams",
      "timestamp": "00:50:39)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, totally. Glen, who's heads of core product,"
    },
    {
      "speaker": "I mean one of the things that's so impressive about Glen and that core team is they go incredibly deep into every single release that is shipped. And so you do have a central eye on the quality and how it all fits together.",
      "timestamp": "00:51:00)",
      "timestamp_seconds": 0.0,
      "content": "And so that I think helps make sure there's a consistent kind of bar for taste. A bunch of folks Tobi obviously that can enforce that. So it's subjective, but it's objective in the sense that it's kind of a small number of people who really hold what that bar is and needs to be. I think if it's just subjective, let's just ship what we want without a couple people really holding that quality and that taste bar,"
    },
    {
      "speaker": "that's where things go really sideways.\n\nLenny Rachitsky",
      "timestamp": "00:51:31)",
      "timestamp_seconds": 0.0,
      "content": "Awesome. That's exactly what I was going to ask is, who's the ultimate decider of taste and what is good? And so it sounds like basically Tobi above, and then he's kind of deputized Glen and relies on him to make a lot of these final calls. And then I imagine Glen has some folks that he kind of deputizes to make smaller decisions along the way. Or not,"
    },
    {
      "speaker": "And I think this is the fun thing about Shopify. Literally we have our own internal project management system that's been kind of crafted just for Shopify and every shift-\n\nLenny Rachitsky",
      "timestamp": "00:52:03)",
      "timestamp_seconds": 0.0,
      "content": "What is that called by the way? It's got a cool name, right?"
    },
    {
      "speaker": "GSD. \n\nLenny Rachitsky",
      "timestamp": "00:52:07)",
      "timestamp_seconds": 0.0,
      "content": "GSD, yeah. [inaudible 00:52:10]."
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "00:52:10)",
      "timestamp_seconds": 0.0,
      "content": "Yeah,"
    },
    {
      "speaker": "That's what I remember.\n\nArchie Abrams",
      "timestamp": "00:52:12)",
      "timestamp_seconds": 0.0,
      "content": "So get shit done. And every project, so you got a core project, you have emergency service, you got growth project. And the expectation is that the group leads. Every single project that goes out has a few minute video with Figmas and everything, and everything that shipped. Needs to be okay-toed, so approved by the group lead. There's nothing that can ship without that okay-to approval. And that okay-to approval has to be Glen, Carl, myself with different groups. And so that is how everything is reviewed. Now of course there's great amazing teams that do amazing work,"
    },
    {
      "speaker": "but it is that that's how the system works.\n\nLenny Rachitsky",
      "timestamp": "00:52:50)",
      "timestamp_seconds": 0.0,
      "content": "And okay-to specifically means someone above reviews it or all this whole team, everyone looks at it?"
    },
    {
      "speaker": "No. So Glen reviews the core stuff. Carl reviews the MS. Okay-to. It's interesting.\n\nLenny Rachitsky",
      "timestamp": "00:53:05)",
      "timestamp_seconds": 0.0,
      "content": "It's basically Glen is founder mode and not as a founder where he's involved in all the details, has final say. So this is a really cool example of founder mode,"
    },
    {
      "speaker": "In the way you guys operate. And I imagine sometimes Tobi disagrees with Glen and then they talk about it and things get ironed out.\n\nArchie Abrams",
      "timestamp": "00:53:22)",
      "timestamp_seconds": 0.0,
      "content": "Totally. And that's why we come together every six weeks, everyone in person to review every project so we can hash out those disagreements. Go through all the core projects, all the merge service projects, all the growth projects. And it's a great forum to say, \"Hey, here's where we disagree,\" really on the how and the tactics of what's happening. And we can flag those things,"
    },
    {
      "speaker": "have good debates about whether there might be misalignment.\n\nLenny Rachitsky",
      "timestamp": "00:53:43)",
      "timestamp_seconds": 0.0,
      "content": "Amazing. What a unique way of working. I'm so fascinated by all this. So what I'm hearing essentially within Core, Glen and his team come up with, \"Here's what we're going to build the next quarter.\" You guys have twice a year releases, is that right? Or is it every season?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "00:53:58)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, so big additions. Twice a year. Obviously continually shipping,"
    },
    {
      "speaker": "but we package them twice a year in a big bang.\n\nLenny Rachitsky",
      "timestamp": "00:54:05)",
      "timestamp_seconds": 0.0,
      "content": "Big launch. Yep, I've seen those. Okay. So he's like, \"Here's what we're going to do in the next release. We're just going to build this because we think this is right. And we're not driving a specific goal. We're building for 100 years in the future. Let's just build it.\" And basically you build it. He's like, \"This is great, not great, iterate until it's this good,\" and then ship. And great. Okay, this is great. Okay, so then there's that team, and then there's your team, which is drive some freaking numbers, drive growth, hit these goals. How do you collaborate across these two teams? Do you have a model for how you work together? Because these feel like very different ways of working?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "00:54:41)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, honestly, it's been one of the things I'm very proud of. We built a really great partnership for the last three and a half years, because it's intentionally meant to be almost at odds,"
    },
    {
      "speaker": "and that's part of the structure of how we want to work.",
      "timestamp": "00:54:56)",
      "timestamp_seconds": 0.0,
      "content": "But it comes from, I think, a place of respect on both sides. And I'd say for anyone, it's okay, here's what growth is going to do. We're going to do it in a way that is high quality, that is shipping really good stuff for merchants. We're probably going to approach it in a faster way. We might disagree on things,"
    },
    {
      "speaker": "but we're going to have reasonable paths to handle that conflict.",
      "timestamp": "00:55:17)",
      "timestamp_seconds": 0.0,
      "content": "And so while there's no magic bullet, it wasn't like these are the surfaces that growth can touch, these are not. It was like you can go anywhere in the product, but let's go figure out how to work together to figure out that quality bar to understand when you're going to be different on it, on the quality bar to get something out to learn, and just building trust along the way that we're actually going to ship high quality things and we ship it to 100%"
    },
    {
      "speaker": "and move. And so a lot of great work on the team to make those relationships really strong.\n\nLenny Rachitsky",
      "timestamp": "00:55:47)",
      "timestamp_seconds": 0.0,
      "content": "Got it. So basically, you guys are like, \"Moving this button over here is going to drive so much growth,\" and then Glen's like, \"No, this is not acceptable. We don't want a button here. This looks terrible. Everyone's going to hate it.\""
    },
    {
      "speaker": "So that's the healthy tension. I'm describing a combative-\n\nArchie Abrams",
      "timestamp": "00:56:01)",
      "timestamp_seconds": 0.0,
      "content": "[inaudible 00:56:01] totally. And it's like, okay, so how are we going to work to figure this out? It might be, \"Hey, we're going to move the button. Hey let's run the test,\" but see the short-term lift. You know we're going to monitor it long term. You know when we ship it, it's going to be high quality,"
    },
    {
      "speaker": "high quality polish. And you trust us to make those trade-offs.",
      "timestamp": "00:56:19)",
      "timestamp_seconds": 0.0,
      "content": "I wish I had a better answer of it's very human. It's very that trust that's that's very important in any of these. I think growth with other teams is like, there's no replacement for just the human trust and then following through on commitments of no,"
    },
    {
      "speaker": "we are actually going to make this thing really good. \n\nLenny Rachitsky",
      "timestamp": "00:56:38)",
      "timestamp_seconds": 0.0,
      "content": "Is there an example of that, that comes to mind where you had something that was you thought was going to drive meaningful growth? You showed it to Glenn, he is like, \"No, don't know about this.\" And then either you iterated or you just forget it, this isn't right for the platform even though it's going to drive some meaningful growth?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "00:56:54)",
      "timestamp_seconds": 0.0,
      "content": "The place that we often come back to is, and this is with I think Tobi is great, Tobi and Glen,"
    },
    {
      "speaker": "Onboarding carousels.\n\nArchie Abrams",
      "timestamp": "00:57:08)",
      "timestamp_seconds": 0.0,
      "content": "Onboarding carousels. Some way that basically has folks get set up by not using the actual product. And so we've always kind of danced around and we have very specific no wizard principle, but I think that sometimes the tension is wizards can serve a purpose in certain circumstances, but we've avoided doing that. But we've always worked to try to make the principles of what a wizard does really well, which is it simplifies the product into something that allows people to have a lower bar,"
    },
    {
      "speaker": "to try to work with core to bring that into the actual experience itself.",
      "timestamp": "00:57:52)",
      "timestamp_seconds": 0.0,
      "content": "So the example of that experiment I mentioned to you of giving pre-filled sections in the online store editor, you could have solved that in a wizardy way of, \"Enter a few things, and we're going to generate these sections for you.\" Instead,"
    },
    {
      "speaker": "we actually took those pre-generated things based on what we know about you and put it into the actual project experience itself.",
      "timestamp": "00:58:15)",
      "timestamp_seconds": 0.0,
      "content": "So it tried to get at some of the principles of what a wizard can do well without avoiding the wizard principle, without creating actual wizard. So that's been some of the, how do we work together to get the intent of what the growth ideas but in a way that's consistent with the way we want to build in core?"
    },
    {
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:58:34)",
      "timestamp_seconds": 0.0,
      "content": "Got it. And I get why that you think about this a lot because you talked about one of the biggest levers is onboarding and helping more people get activated,"
    },
    {
      "speaker": "Yes.\n\nLenny Rachitsky",
      "timestamp": "00:58:48)",
      "timestamp_seconds": 0.0,
      "content": "I want to ask your insight on this idea that people might be listening to this and feeling like, \"Oh, we need to build a team that just builds great product and is not constrained by metrics and driving growth.\" Short-term thinking, long-term thinking, 100"
    },
    {
      "speaker": "years. This is inspiring I think to a lot of companies because the sounds great.",
      "timestamp": "00:59:08)",
      "timestamp_seconds": 0.0,
      "content": "What do you think it takes to make something like that work? Because in a bad case, this team just sits around and builds whatever they want, and the rest of the company's like, \"God damn, this sucks. I have to show success in metrics and moving a metric in this team, over there just build beautiful things.\" Is it like you need a founder like Tobi, that prioritizes this and values it and has a very good taste and intuition? What do you think are important elements of something like that, of this approach working at a company based on what you've seen?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "00:59:37)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, I think it needs to have a very opinionated founder set of people who are driving what good looks like. And I think Shopify a few years ago and before maybe sometimes drifted into the mode of, \"We are just going to build stuff and each kind of team is just going to build stuff not really accountable for it,\" and that is a very, very bad state to end up. So I think you either have to use, my sense is metrics as accountability, which is the most common kind of way to drive accountability and focus. Or extremely strong founder or set of folks who have extremely strong opinions on what good is and what taste is. If you have one of those two, you can make it work,"
    },
    {
      "speaker": "but the worst case is let's just go build a bunch of cool stuff in kind of a haphazard way. That I don't think would work.\n\nLenny Rachitsky",
      "timestamp": "01:00:30)",
      "timestamp_seconds": 0.0,
      "content": "Yeah,"
    },
    {
      "speaker": "Correct.\n\nLenny Rachitsky",
      "timestamp": "01:00:42)",
      "timestamp_seconds": 0.0,
      "content": "Cool. I think that's a really good way of... And I imagine every founder is going to think, \"Oh, that's me. I have this, I can do this.\" I think it's rare in real life. It's rare that you're like a Tobi, or Brian Chesky,"
    },
    {
      "speaker": "or Elon.\n\nArchie Abrams",
      "timestamp": "01:00:43)",
      "timestamp_seconds": 0.0,
      "content": "100%."
    },
    {
      "speaker": "Lenny Rachitsky",
      "timestamp": "01:00:57)",
      "timestamp_seconds": 0.0,
      "content": "Yeah. It's hard to internalize that,"
    },
    {
      "speaker": "Yes. \n\nLenny Rachitsky",
      "timestamp": "01:01:08)",
      "timestamp_seconds": 0.0,
      "content": "Awesome. This is very fascinating. I'm so happy we're spending so much time on this. Okay, there's a few other random things I'm going to touch on. One is sales. So historically, Shopify has been very product-like growth, very organic. Go check it out, sign up, shop a store, start a store, grow. And you guys have layered on sales. In a sales motion that's an increasing part of your business. What have you learned about your team, the growth team working with sales and making that a successful relationship?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "01:01:36)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, no, it has been great over the last couple of years as built out, the sales order has added a whole new kind of motion to Shopify. As Shopify's product got better, it can serve the biggest companies in the world. It's like the natural evolution. Well what are you going to do that for people to grow up on Shopify and to be the biggest companies, but we're also going to take folks another platform,"
    },
    {
      "speaker": "bring them over.",
      "timestamp": "01:01:57)",
      "timestamp_seconds": 0.0,
      "content": "For growth in sales, I think the biggest learning from the the R&D side at least has been the scale is very different with sales, and so it's really hard to use as much quantitative data to make growth,"
    },
    {
      "speaker": "to make some of those decisions.",
      "timestamp": "01:02:18)",
      "timestamp_seconds": 0.0,
      "content": "And so a lot of it has been building much more qualitative insights working with merchant success, sales about the challenges they're facing and onboarding a large customer. So how do we build import tools that work for them? How do we make sure they have the right guidance in the product for a very different set of use cases? So a lot of it has just been very much empathy building with sales about what that merchant journey looks like,"
    },
    {
      "speaker": "and quite frankly challenging ourselves to think differently. It's been one thing.",
      "timestamp": "01:02:49)",
      "timestamp_seconds": 0.0,
      "content": "And then second, we kind of built two very distinct funnels for a little bit. There's a sales funnel. You come in, you contact us, that's it. There's no mention of self-service, there's no this. There's just drive MQLs,"
    },
    {
      "speaker": "boom. Then there's the self-service thing. There's no mention of sales anywhere.",
      "timestamp": "01:03:05)",
      "timestamp_seconds": 0.0,
      "content": "So one of the last thing the year, last year we've been really doing is how do we create these hyper journeys where there is... We shouldn't force the merchant to choose, do you want to talk to sales? You want to do self-service? Should give them the options,"
    },
    {
      "speaker": "whatever path that they want to go on.",
      "timestamp": "01:03:19)",
      "timestamp_seconds": 0.0,
      "content": "And so a lot of that has been building into the self-service journey over to sales and then from sales into self-service. That's broken a lot of metrics in the business. That's broken a lot of ways people have thought about their jobs, and so there's been a lot of cultural resetting and just getting smarter from a metric standpoint about, how do we measure this thing of hybrid journey? They came in via self-service, they went over to sales. How do we value each of those components in the process? And transparently, that's something we're still getting better at,"
    },
    {
      "speaker": "but it's really important to get there.\n\nLenny Rachitsky",
      "timestamp": "01:03:55)",
      "timestamp_seconds": 0.0,
      "content": "Is there an example of something that broke that would be illustrative of what you're describing?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "01:04:01)",
      "timestamp_seconds": 0.0,
      "content": "Yeah. So I think that breaks is drive someone from an ad over to self-service. We typically look at only the self-service LTV of that person. But what happens if they come in, they sign up via self-service and then they go talk to sales? They get changed to a sales driven merchant, which means that that value of that merchant, which is usually actually quite large, does not get associated back to that ad campaign. Oh, guess what that means? That means you would probably reduce investment on that ad campaign because you weren't valuing that. Our system had two different models for calculating LTV. Sales driven one, and a self-service one. Uh oh,"
    },
    {
      "speaker": "we're going to make suboptimal investment decisions now by kind of moving things around even though it's the right thing to do.",
      "timestamp": "01:04:55)",
      "timestamp_seconds": 0.0,
      "content": "So a lot of it's in rebuilding all instrumentation, how we do LTV modeling, how we do attribution, how we do incrementality testing across each of those different types of outcomes,"
    },
    {
      "speaker": "because it was not an intuitive thing for us originally because we had built all of these systems with a much more siloed view.\n\nLenny Rachitsky",
      "timestamp": "01:05:16)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, basically attribution gets a lot more complicated. Are you going in a multi-touch attribution direction or is there something even more clever?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "01:05:26)",
      "timestamp_seconds": 0.0,
      "content": "My rant is I am... Multi-touch attribution as its place. I think ideally what we want to get through is what we really care about is incrementality. So incrementality is kind of the gold standards, for people who are less like attribution measure is, how do you assign value to a given touch point, right? Click, a view, etc. But it doesn't tell you causally what drove something. That's where incrementality tells you. Incrementality test is basically don't show ads on meta for certain number of people. Show it to the other set,"
    },
    {
      "speaker": "see what the lift is and the outcome.",
      "timestamp": "01:06:04)",
      "timestamp_seconds": 0.0,
      "content": "A lot of what we're doing is trying to get a lot, is continuing to get even more sophisticated in incrementality measurement for not just self-serve outcomes, but for self-service outcomes that then drive to sales for sales specific outcomes. And as soon as we have that kind of incrementality at the channel level, we can get a lot more sophisticated in terms of our bidding, budgeting,"
    },
    {
      "speaker": "There's certain topics that alone can be their own podcast conversation to just dive deep into this stuff. But I'm going to stop myself and I'll go further down that track. Let me touch on a couple more things before I let you go.",
      "timestamp": "01:06:46)",
      "timestamp_seconds": 0.0,
      "content": "One is marketing. So we talked about sales, marketing. You guys don't have a CMO, there's no Shopify CMO. Instead you embed marketing leads within the org. For folks that are trying to grapple with that, should we hire CMO? Should we do something else? What have you learned about maybe the benefits and also maybe some downsides of approaching it the way you guys have approached it?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "01:07:07)",
      "timestamp_seconds": 0.0,
      "content": "The benefit is, so there's growth marketing who sits in growth, there's revenue marketing who sits over closer to sales. There's a brand team under Harley who does amazing work. Our president. There's marketing embedded in core and PMM,"
    },
    {
      "speaker": "sit with the product managers there. There's shop marketing on a consumer side. So marketing is truly everywhere in the org.",
      "timestamp": "01:07:28)",
      "timestamp_seconds": 0.0,
      "content": "And I think the benefit of it is it's closest to the primary goal that those marketers are trying to do. They sit with growth so we can focus on that self-service motion. Harley is an amazing communicator, so brand sits with him so he can have a lot of influence over that. And so I think it sits with the people its most relevant outcomes are driving,"
    },
    {
      "speaker": "which is great. It allows us move faster with less kind of coordination.",
      "timestamp": "01:07:58)",
      "timestamp_seconds": 0.0,
      "content": "I think it only works because Tobi and Harley has such amazing intuition on what the brand is, needs to be,"
    },
    {
      "speaker": "and all of that. Some of what the CMO does of kind of creating the cohesive story of Shopify it held in their heads and they have the pen on that.",
      "timestamp": "01:08:19)",
      "timestamp_seconds": 0.0,
      "content": "And so that allows then, that piece of that CMO's job to not be as important at Shopify. But the other pieces are obviously critical,"
    },
    {
      "speaker": "but they can be now closer to the action and where they're going to drive the most impact. The downside is things are sometimes very messy. So that's...\n\nLenny Rachitsky",
      "timestamp": "01:08:40)",
      "timestamp_seconds": 0.0,
      "content": "It's another example where the founder, their background and interest in skills can impact significantly the way the work is structured and who you hire and don't hire. Okay, one last question. Totally different topic, discounting. So you worked at Udemy for a long time. And from what I understand, discounting was one of the key reasons Udemy succeeded and one of the big differentiators. I'm curious what you learned about discounting,"
    },
    {
      "speaker": "the power of discounting as a growth lever.\n\nArchie Abrams",
      "timestamp": "01:09:09)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, so Udemy is a very an online marketplace for online courses. So come on course. And I think what was happening in I started, and we were there 2012-ish was people were like, \"What is this online course thing? I don't really understand what it is. I don't understand what the value is and what I'm willing to pay.\" (01:09:30): And so what discounting has a really powerful effect on is it can signal value with a high list price, but then bring something down to an affordable price. And that may seem like of course that's obvious, but in online courses what was important is the list price would be high at 100"
    },
    {
      "speaker": "bucks. So it's associated with a college course. But what people really value this thing as was a book.",
      "timestamp": "01:09:54)",
      "timestamp_seconds": 0.0,
      "content": "And so you could signal very high, signal quality through price, which was very murky at that point in online learning. Signal value through price. Discount it to 10 bucks, or that was a typical Udemy deal. And then so 99% off, 90% off. We might see fire sales, but it changed the value in willingness to pay and then it tapped into the fact that,"
    },
    {
      "speaker": "and still is education is very aspirational.",
      "timestamp": "01:10:23)",
      "timestamp_seconds": 0.0,
      "content": "And so what a lot of people missed in education is yes, we want people to actually take the course, but that's actually in many cases not the job to be done. That there's an emotional job that's even more important, which is I'm feeling like I'm making progress in my educational journey,"
    },
    {
      "speaker": "and just the act of purchasing a course or the act of buying a book is progress.",
      "timestamp": "01:10:47)",
      "timestamp_seconds": 0.0,
      "content": "And so if you can make it very enticing, very high value thing, cheap, urgency, you can let people make that emotional journey by the act of purchasing, which then allowed us to actually have very good retention. Because you could keep coming back to that emotional job over and over again,"
    },
    {
      "speaker": "which just counting with urgency allowed us to do.\n\nLenny Rachitsky",
      "timestamp": "01:11:10)",
      "timestamp_seconds": 0.0,
      "content": "Amazing. Well with that, we reached our very exciting lightning round. Archie, are you ready?"
    },
    {
      "speaker": "I'm ready. \n\nLenny Rachitsky",
      "timestamp": "01:11:17)",
      "timestamp_seconds": 0.0,
      "content": "First question, what are two or three books that you recommended most to other people?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "01:11:21)",
      "timestamp_seconds": 0.0,
      "content": "So one, I love to go back to marketers who wrote in the 1920s. And so one that I love is Scientific Advertising by Claude Hopkins. So it's basically one of the first direct marketers that came out and he innovated on some of the concepts of copywriting and just how you sell a product around can't make this product, can't sell the product, can you tell the product will help the customer achieve their goals? And so it's really fun. I find it really fun to go back in time, because there's a lot of really good first principles thinking that I think we've actually lost in more modern stuff where it's like personalization band, it's optimization, all this stuff. Where it's like how do you actually write and sell things really effectively? Scientific Advertising,"
    },
    {
      "speaker": "it's a great book.\n\nLenny Rachitsky",
      "timestamp": "01:12:09)",
      "timestamp_seconds": 0.0,
      "content": "It's just like the name alone,"
    },
    {
      "speaker": "it sounds really cool. Especially for someone in your shoes that feels like the perfect book for your role. And I think there's so much wisdom in just the thing someone figured out many years ago about what convinces people to buy something is still true and people overcomplicate it. Just going back to the original is often really useful.\n\nArchie Abrams",
      "timestamp": "01:12:28)",
      "timestamp_seconds": 0.0,
      "content": "Totally. And The Perfect Mile about the chase for sub four minute mile by Roger Bannister and a few other folks is just a wonderful... As a runner, it's a really fun book to read about perseverance, how these folks really,"
    },
    {
      "speaker": "they all competed to get to that really amazing goal of under four minutes in a mile.\n\nLenny Rachitsky",
      "timestamp": "01:12:52)",
      "timestamp_seconds": 0.0,
      "content": "Awesome. Do you have a favorite recent movie or TV show you really enjoyed?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "01:12:58)",
      "timestamp_seconds": 0.0,
      "content": "I went back in time and I watched for the first time actually the entire season or all the episodes of The Sopranos,"
    },
    {
      "speaker": "It's a lot of watching.\n\nArchie Abrams",
      "timestamp": "01:13:14)",
      "timestamp_seconds": 0.0,
      "content": "It's a lot watching. Work out in the morning on my elliptical or bike,"
    },
    {
      "speaker": "Workout show.\n\nLenny Rachitsky",
      "timestamp": "01:13:22)",
      "timestamp_seconds": 0.0,
      "content": "That's a good motivator to just work out out something. I got to watch the next episode. The Wire, it's hour long episodes and five seasons times 20. I think it's 22 episodes per season, right?"
    },
    {
      "speaker": "Yeah.\n\nLenny Rachitsky",
      "timestamp": "01:13:33)",
      "timestamp_seconds": 0.0,
      "content": "Oh geez. It's a lot of watching and I did that once and I was like, \"I've got a lot of episodes to watch,\""
    },
    {
      "speaker": "but incredible. Okay. It's funny you should say The Sopranos. I feel like a number of people recently told me they're watching the full Sopranos again. It's like a trend recently for some reason.\n\nArchie Abrams",
      "timestamp": "01:13:50)",
      "timestamp_seconds": 0.0,
      "content": "Oh,"
    },
    {
      "speaker": "interesting.\n\nLenny Rachitsky",
      "timestamp": "01:13:51)",
      "timestamp_seconds": 0.0,
      "content": "Anyway, do you have a favorite product you've recently discovered that you really love?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "01:13:54)",
      "timestamp_seconds": 0.0,
      "content": "So the AI music creator. My kids and I... I'm the least musical person in the world and it's been amazing. My kids and I will create songs together about our days, about what's going on. So it's just been really fun to be able to have a musical experience for a non-musical person,"
    },
    {
      "speaker": "and have that creative experience for them and it's been really awesome to use. \n\nLenny Rachitsky",
      "timestamp": "01:14:15)",
      "timestamp_seconds": 0.0,
      "content": "Suno is Insane. I think it's Suno.ai, folks want to check it out. It's just such a fun party trick too, just to write a song on the spot about something that you're thinking about. Awesome. Two more questions. Do you have a favorite life motto that you often come back to, find helpful and worker life?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "01:14:31)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, I often come back to the plan is the plan until it's not. And it's basically like we have a plan. It's the plan, it's our best, let's commit to it. But acknowledge it might change and we'll deal with it then. But if the combination of we have a plan, stay focused on that, with also the acknowledgement that you need to be flexible,"
    },
    {
      "speaker": "Totally.\n\nLenny Rachitsky",
      "timestamp": "01:15:08)",
      "timestamp_seconds": 0.0,
      "content": "Awesome. Okay, final question. So I asked your wife what to ask you when you came on this podcast and she suggested that I ask you about your late father who had a lot of impact on your leadership style. So here's my question, what did you learn from your dad that impacts the way you work today?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "01:15:26)",
      "timestamp_seconds": 0.0,
      "content": "Yeah. My dad a lot is a father, and he was an entrepreneur in technology. And I think one of the things that I so appreciate about his leadership style was the empathy, and curiosity, and kindness that he showed in everything. And I hope in some of the stories that of him, it's like no matter who anyone was, curious,"
    },
    {
      "speaker": "love to engage and learn from. And I hope that's something that I try to take inspiration from is just be with everyone kind and learn from everyone you're with and around. So something I think about a lot.\n\nLenny Rachitsky",
      "timestamp": "01:16:08)",
      "timestamp_seconds": 0.0,
      "content": "That super resonates. He sounds like a wonderful human as are you. Archie, this was wonderful. We touched on so much. We covered so much. I feel like we could go on for many more hours. Maybe we'll do round two as you learn more things at your time at Shopify. Two final questions. Where can folks find you online if they want to potentially reach out or follow the stuff you're up to, and how can listeners be useful to you?"
    },
    {
      "speaker": "Archie Abrams",
      "timestamp": "01:16:30)",
      "timestamp_seconds": 0.0,
      "content": "So not super on social media. But on LinkedIn, check me out, send me a message. And then yeah, if folks are hiring a bunch of folks, growth marketers, PMs, engineers, data folks, UXers, you want to work at Shopify and growth or other parts?"
    },
    {
      "speaker": "Fully remote. So we'd love to have great people join.\n\nLenny Rachitsky",
      "timestamp": "01:16:54)",
      "timestamp_seconds": 0.0,
      "content": "Awesome. And that last point, I think I'll just highlight one of the few remaining fully remote tech companies that is not returning to work. Returning to the office [inaudible 01:17:05]"
    },
    {
      "speaker": "All functions.\n\nLenny Rachitsky",
      "timestamp": "01:17:13)",
      "timestamp_seconds": 0.0,
      "content": "Perfect. Archie,"
    },
    {
      "speaker": "thank you so much for being here.\n\nArchie Abrams",
      "timestamp": "01:17:17)",
      "timestamp_seconds": 0.0,
      "content": "Thank you Lenny,"
    },
    {
      "speaker": "Bye everyone.",
      "timestamp": "01:17:21)",
      "timestamp_seconds": 0.0,
      "content": "Thank you so much for listening. If you found this valuable, you can subscribe to the show on Apple Podcasts, Spotify, or your favorite podcast app. Also, please consider giving us a rating or leaving a review, as that really helps other listeners find the podcast. You can find all past episodes or learn more about the show at lennyspodcast.com. See you in the next episode."
    }
  ],
  "num_segments": 219,
  "full_text": "Archie Abrams (00:00:00):\nWhen you have teams naturally break up the world into different funnel stages or different points in the journey, it gets very seductive to look at my part of the funnel and what's my conversion rate through that part of the funnel, right? And then the team starts to optimize for that conversion rate as their north star. But in practice, it's actually almost always easier to just make it harder to do the thing right before your step in the funnel to increase your conversion rate. Instead of I'm trying to convert a bunch of people, I just want more people to get activated.\n\n(00:00:32):\nAnd then once you start thinking that way, you realize actually the best way to get more people to get to a step is just get more people in the door in the first place. That will always hurt your conversion rate, but it may actually give you more people on the outside.\n\nLenny Rachitsky (00:00:48):\nToday my guest is Archie Abrams. Archie is VP of product and head of growth at Shopify, where he leads an org of over 600 people across product, design, engineering, data ops, and growth marketing. Shopify is both an incredibly unique and also an incredibly successful business, and they do things very differently. And as a result, there's a lot that we can learn from how they approach building product and driving growth.\n\n(00:01:12):\nSome examples include their priorities in product roadmap are driven by a 100-year vision that comes from Tobi, the CEO. And the core product teams don't have metrics or KPIs. They're essentially banned. And instead, decisions are made based on taste, and intuition, and building towards this long-term vision. Also, the growth team optimizes for churn, which is unlike any other company I've ever come across. And once you hear why, this will make a lot of sense.\n\n(00:01:38):\nAlso, they keep long-term holdouts for every experiment they run, and they automatically look at the impact these experiments have had on the business a year later, two years later, and three years later, and then revisit these decisions down the road.\n\n(00:01:52):\nAnd in our conversation, we dig into all of this plus how Shopify organizes their growth team, how they run experiments, how the growth team collaborates with the product team, how they measure impact. Plus, Archie shares a bunch of very specific and interesting examples of changes that have driven growth for the business and so much more. This is such a fascinating conversation, and I know this will give you a lot to think about in terms of how you run and organize your own product and growth teams. If you enjoy this podcast, don't forget to subscribe and follow it in your favorite podcasting app or YouTube. It's the best way to avoid missing feature episodes and it helps the podcast tremendously. With that, I bring you Archie Abrams. \n\n(00:02:34):\nArchie, thank you so much for being here and welcome to the podcast. \n\nArchie Abrams (00:02:38):\nThanks Lenny.\n\nLenny Rachitsky (00:02:38):\nExcited to be here. Okay, so what I want to do with our time together is to basically do kind of a living archeology of how Shopify grows and what you specifically have learned about growing a company like Shopify into this just juggernaut of a business that it's turned into. To give people a little bit of a sense of just how large Shopify has gotten, so maybe surprising them about the scale of this company at this point. Could you share some stats about the scale of the business at this point?\n\nArchie Abrams (00:03:09):\nYeah, absolutely. So overall, we're about 10% of e-commerce in the United States. So basically if you're not buying an Amazon or Walmart, you're probably buying on a Shopify-powered store. And behind the scenes globally, we did about 235 billion in GMV in 2023, which is roughly the size of the economy of Finland. So we've got a big economy and big impact happening from Shopify.\n\nLenny Rachitsky (00:03:37):\nWow. I think interestingly with Shopify, it's kind of this behind the scenes tool, and so I imagine many people have no idea they're using Shopify a lot of time when they're buying stuff online, and I think some of these numbers kind of creep up on people with just how large a company like Shopify has gotten.\n\nArchie Abrams (00:03:53):\n100%.\n\nLenny Rachitsky (00:03:56):\nThis episode is brought to you by Explo, a game changer for customer facing analytics and data reporting. Are your users craving more dashboards, reports, and analytics within your product? Are you tired of trying to build it yourself? As a product leader, you probably have these requests on your roadmap, but the struggle to prioritize them is real. Building analytics from scratch can be time-consuming, expensive, and a really challenging process. Enter Explo. Explo is a fully white labeled embedded analytics solution designed entirely with your user in mind.\n\n(00:04:29):\nGetting started is easy. Explo connects to any relational database or warehouse. And with its low-code functionality, you can build and style dashboards in minutes. Once you're ready, simply embed the dashboard or report into your application with a tiny code snippet. The best part, your end users can use Explo's AI features for their own report and dashboard generation, eliminating customer data requests for your support team. Build and embed a fully white labeled analytics experience in days. Try for free at explo.co/lenny. That's E-X-P-L-O dot C-O slash Lenny. \n\n(00:05:08):\nThis episode is brought to you by Dovetail, the AI first customer insights hub for all teams. Dovetail has always been the go-to tool for teams who want to find insights in customer calls, user interviews, or documents. Now they've stepped it up with the release of Dovetail 3.0. that's three new products and a ton of AI features that make it faster and easier than ever before to truly get at the heart of what your customers want. You can get a real-time pulse on what your customers are thinking with Dovetail's, automated feedback analysis platform, channels, or pull summaries and insights from every customer interaction your team has ever had with their AI chatbot Ask Dovetail. You can even recruit from over 3 million participants directly in Dovetail. All this is just the tip of the Iceberg. Dovetail wants to give everyone in their organization instant access to their customers at any time. From roadmaps, discovery, to strategy sessions and more, it's never been easier to make customer-centric decisions. The good news is Lenny's listeners can try Dovetail's Pro plan along with their newest products and features free for 30 days. Just go to dovetail.com/lenny. \n\n(00:06:18):\nI want to start with something that I think is most unique from what I've heard, and I think there's going to be a lot of really unique approaches to how you all think about growth. One of the most interesting things I've heard is that how you think about churn and retention. To most companies, the most important thing is to increase retention, reduce churn. My sense or my understanding is you guys are kind of the opposite. You one, don't think tons about churn, you almost optimize for churn. Talk about that. How does that work?\n\nArchie Abrams (00:06:48):\nThe way we think about churn is really going back to Shopify as a kind of our mission and what we want to do, which is to increase the amount of entrepreneurship on the internet. And so as a business, we want to make it as easy as possible to get started with your online store, with your business.\n\n(00:07:06):\nBut most businesses do ultimately fail. And so the way we look at it is can we lower the barriers to getting started and get as many people in the door trying their hand at entrepreneurship? If we do that, again, many of those businesses, many of those folks will maybe on their first attempt not be as successful, but we're going to have a set of merchants who go on to become extremely big businesses, the Allbirds of the world, FIGS, etc.\n\n(00:07:36):\nAnd the way the Shopify business model works is we do charge a subscription, but most of our revenue comes from payments, which is tied to directly to a merchant's success. So in a given cohort of merchants, a lot of people will start. Some of those people on their first attempt that's entrepreneurship might not succeed, but the folks who do go on to be successful will make that entire cohort of merchants who started something that makes Shopify as a business extremely successful. And that's why we lower the barriers to get started and help folks grow, and those winners make the whole thing work.\n\nLenny Rachitsky (00:08:12):\nI love that. So what I'm hearing is it's not that you don't want people to stick around, it's not that you don't want people to succeed. It's that you're not optimizing every new shop for sticking around long-term. It's basically make it as easy as possible for people to try it. And all you need is a few big wins for it to all work out.\n\nArchie Abrams (00:08:33):\nCorrect. And that's really a different insight than most SaaS companies that they get a customer, they really never want that person to leave. And we want to lower that barriers to get started and be successful.\n\nLenny Rachitsky (00:08:44):\nOne of the main reasons companies focus so much on churn and retention is because it costs them a lot of money to drive new customers and users. I imagine there's almost an implied it's really cheap for you all to find new customers because of maybe the brand and word of mouth. Is that true?\n\nArchie Abrams (00:08:59):\nI think that definitely has some dynamics. I think the bigger factor is the monetization model. For most SaaS companies, they're making from a subscription, right? 29 bucks a month is the only way that they're going to really monetize. Whereas our business works, you have folks who are paying a subscription. But as folks get bigger, because we're monetizing on that GMV that that merchant is producing or the revenue the merchant is producing in the form of payments and other services, it allows us to grow with the merchant in those really successful merchants, make the whole system work well.\n\nLenny Rachitsky (00:09:34):\nGot it. So basically, your net dollar retention or network revenue retention is just absurd for the winners and it makes up for all the losers slash not losers, people that have tried to build an online-\n\nArchie Abrams (00:09:44):\nYes, tried and haven't been very successful. When you can think of the other parallel is in angel investing, right? Most of angel investments are not going to work out, but the couple that do make that entire investment portfolio successful.\n\nLenny Rachitsky (00:10:00):\nWith retention not being the primary goal and the metric you guys focus on optimizing, how do you know if you're doing well? Is it some number of these winners have to come out every quarter, every year? How do you think about progress and achieving, and success basically for growth?\n\nArchie Abrams (00:10:18):\nThis way is thinking about a cohort of users we acquire in a given time period, say a quarter. And then over the next year, two years, three years, four years, five years, how much GMV have those merchants produced in total? Not about per merchant basis, but in total, did that cohort generate GMV? And if they generate GMV, that will translate into revenue and gross profit and all of those things that we can then use to reinvest in growing the business. So it's really looking at the total value, but on that GMV basis. And GMV is a power law based metric. And so it's really that power law that drives the success of each cohort.\n\n(00:10:56):\nAgain, going back to investing, same thing there. Each vintage from a fund, how much did that return as a fund? And it's really driven by the few really successful outliers.\n\nLenny Rachitsky (00:11:09):\nSo this begs the question, that sounds like a very long feedback loop. And I don't know what I do with that information if five years from now, \"Oh okay, that was a really good idea we did five years ago.\"\n\nArchie Abrams (00:11:18):\nCorrect.\n\nLenny Rachitsky (00:11:19):\nComment on that. It touches on something you said about how metrics aren't actually a driver of how you all think at Shopify, so take that wherever you want to go.\n\nArchie Abrams (00:11:26):\nYeah. So it's interesting. I think with Shopify, we very purposely set up different parts of the org to think on very different time horizons and with very different ways of thinking about how to build product and the like. Very different than a lot of companies that typically, have maybe one kind of unified, there's one north star that the entire company is rallying around. \n\n(00:11:49):\nAnd so there's three major product groups at Shopify. There's core product which is basically building the 100 year, the right things for commerce 100 years from now. There's merchant services which is building things like payments, shipping, the tools that entrepreneurs need to be successful with a more shorter or medium term horizon. And then growth is really thinking about that end-to-end customer journey. How can we bring folks on and make sure they're successful?\n\n(00:12:19):\nAnd then from a metrics standpoint, we do have obviously some leading indicators in growth that we're looking at on a given experiment or what have you. But the key in what we try to instrument in our experimentation is the ability to really look at longterm effects of experiments.\n\n(00:12:37):\nSo we constantly will relook at an experiment a year later, see that the way the GMV curve for the distribution was different than we might've originally thought. And that'll actually change what we do from that previous experiment. And so there's a lot of longterm monitoring of experiments over these very long time horizons to both inform what those input metrics are and more importantly hold ourselves accountable to, did we actually move what we cared about, which is that longterm GMV, in the right way?\n\nLenny Rachitsky (00:13:12):\nWow. Okay. I want to spend more time here. So the way you're describing it is the way the business operates is you think, what is our 100-year plan? How do we think, where does this need to be in 100 years? And with that, it allows you to run these long holdout experiments to see, is something we're doing impacting the business broadly? And because you think so longterm, you can take a year, or two, or three to see if there's an impact and then make adjustments versus I'm having to drive a certain metric every quarter, every year.\n\nArchie Abrams (00:13:47):\nCorrect. And I mean on growth, we're definitely in the... We want to drive metrics on a short-term basis and we can do that obviously, but we have the luxury, and the way Tobi thinks about the world and the way we operate, to really think about these longterm effects and make sure that we're holding ourselves accountable with these longterm holdouts, and then constantly refining the input metrics that we're using and getting a lot smarter about that. But because we take that long horizon, it allows us to be better in the short term and just get a lot smarter.\n\n(00:14:17):\nAnd a lot of counterintuitive things. And I would encourage everyone, if you can, look at some of the experiments that you thought were your biggest winners. Look at the downstream metrics for a year, two years on that experiment. And I'll bet you'd be surprised how many times the metric is different than what you thought it would be after a year.\n\nLenny Rachitsky (00:14:36):\nBecause where people just make a call at a certain point in time, here's the list in it, here's the list experience. I love this, because very few people have experiences running a longterm experiment, and so this is a really interesting insight that you're sharing that, I guess how often do you find this to be true in your long-term holdouts, where things end up being very different downstream?\n\nArchie Abrams (00:14:59):\nI think there's probably two things that have been very common. And I would say in quite a few cases, you get a lift on a metric up front, a more short-term metric. Number of people who become a paying shopper, number of people who make their first sale in Shopify. And then you look a year later, and there's actually no incremental lift on GMV from that cohort.\n\n(00:15:21):\nAnd so I think it actually trains, a lot of us in growth are looking at these short-term metrics. A lot of the time it's actually more pull-forward effect, than you fully realize or an incremental user that's just really not worth that much. So that's one.\n\n(00:15:35):\nAnd then two, so this effect size goes away. There are cases where the experiment has flipped the other way. And then there are cases, and these are the most interesting ones, where you realize that you uncovered a pocket of merchants that are actually extremely valuable entrepreneurs who go on to be successful, that you missed in your normal short-term measurement techniques. And so all across the board we see that. But actually the most common is it actually isn't a long-term lift from a lot of things that you might think of the short-term are.\n\nLenny Rachitsky (00:16:16):\nIs there an example in that second bucket of what you mean when you say there's a pocket of valuable merchants?\n\nArchie Abrams (00:16:22):\nYeah, I think a lot of this has to do with, we call it monetary friction. So one of the hardest things to do with a business is when you're getting started, is you might not have any revenue coming in, and you are kind of bootstrapping, which in Shopify's case might be 39 bucks a month. But still, it's a real expense. \n\n(00:16:43):\nAnd so typically when you can lower the barriers to monetary friction in some form, that could be all sorts of monetary friction early. The common belief is that we'll usually get lower quality folks coming in the door, because usually discounts are associated with lower quality. \n\n(00:17:03):\nIf you think about in a business case, if I give you a little monetary boost and reduce that monetary friction, I can actually causally change your ability to become successful, because I've given you a little bit more time to try that idea a little bit longer. I've given you that opportunity to move your business over to Shopify. And so often in those types of experiments you see that you've basically unlocked a class of people who might've given up without reducing that monetary friction\n\nLenny Rachitsky (00:17:35):\nInteresting. And giving them time to actually make it work.\n\nArchie Abrams (00:17:39):\nTo make it work.\n\nLenny Rachitsky (00:17:40):\nOkay. So just roughly, do you have a sense of how often you find no effect after a year that you saw early impact? Just to ballpark that.\n\nArchie Abrams (00:17:50):\nYeah, it's in the 30 to 40% range.\n\nLenny Rachitsky (00:17:51):\nOkay. I think you're tearing the heart out of so many growth people right now, and nobody wants to hear this that works on growth where you're saying potentially a third of the experiments they're running today that are showing lift probably don't have that same... Don't have any impact down the road.\n\nArchie Abrams (00:18:09):\nYes. Unfortunately, I think that's brutal. Probably more common than we like to believe.\n\nLenny Rachitsky (00:18:15):\nYes, and nobody wants to hear this, except people that you should want to hear this because if you want to build a business that grows and need to grow, it's better to know to learn that now. \n\nArchie Abrams (00:18:28):\nYeah.\n\nLenny Rachitsky (00:18:29):\nOkay. So for people that can't run whole long hold that experiments, I guess is there anything that you find is a good early indicator that might be the case? Most people don't have time to sit around and wait a year or two or three. They're not thinking 100 years.\n\nArchie Abrams (00:18:43):\nI mean I think end of the day that is going to be the most effective and you actually learn the most. I think it is, though even in shorter term horizons, really being as specific as you can be about what are the early signs of success in your product, and making sure you instrument those. And then making sure, particularly up funnel experiments, you are actually looking at the further downstream metrics to make sure you have some understanding of what's moving down. \n\n(00:19:17):\nSo as deep as you can go in the funnel for as long as you can wait. Do that. And if you can't, you know what I would say? Still you should just bet on, if something is showing lift up funnel, still ship it and it's probably not going to hurt you, but don't overestimate the amount of impact that this is having.\n\n(00:19:34):\nSo it's funny, two things here is, my recommendation to folks is don't think, \"Oh my goodness, I have to wait all this time.\" Because if you didn't move the short-term impact, you're not going to have the long-term lift. So still ship if it's short-term lift. Just be reasonable that if you can measure it longer term, you'll get better about identifying what things are that are really impactful.\n\nLenny Rachitsky (00:19:57):\nGot it. And so it may be positive initially, but often neutral. Rarely is it neutral initially and then positive down the road?\n\nArchie Abrams (00:20:09):\nThere are some cases of that, but it's rarely... I've seen neutral be positive, but I haven't seen negative.\n\nLenny Rachitsky (00:20:15):\nGot it. Okay-\n\nArchie Abrams (00:20:16):\nThat resulted positive. \n\nLenny Rachitsky (00:20:17):\nGot it. Okay. So that's reassuring. You're not harming the business, but you're probably getting a lot more credit than you deserve as a growth team shipping things that are-\n\nArchie Abrams (00:20:27):\nLikely.\n\nLenny Rachitsky (00:20:28):\nLikely, right?\n\nArchie Abrams (00:20:29):\nLikely.\n\nLenny Rachitsky (00:20:29):\nAnd there's also just trade-offs to moving on and on balance, you're probably doing good things if you continue to ship things that are showing positive. Right?\n\nArchie Abrams (00:20:39):\n100%.\n\nLenny Rachitsky (00:20:40):\nOkay. This is awesome. For people that want to run long-term holdout experiments, I imagine you've built your own experimentation system internally? Yeah, we have.\n\nArchie Abrams (00:20:50):\nYeah.\n\nLenny Rachitsky (00:20:51):\nAnd is it basically you hold out 10%, say it was some percentage of users from seeing the new change? Is that how you approach it or is there a different way of approach?\n\nArchie Abrams (00:20:59):\nTwo things. We have two layers of holdouts. So one is more the holdouts of every change in a quarter, holdout 5% across the board. Second is for changes that only affect new merchants, what we'll do is we'll take that group of folks, let's call it 50/50 split, and then run that for a few weeks. And then what we're doing, we look at the long-term effects is actually ship the winner to 100%, but we're looking at the cohort of folks who was assigned to the experiment. We're going back and looking at those people who were assigned a year later.\n\n(00:21:36):\nSo it allows us to still ship, get stuff out, but we've kind of held the experiment in a way that allows us to see those long-term effects just for the cohort that was exposed. That only works if you're doing it on new users. For existing, it's a little more complicated. That's okay. And then in our experimentation tools, all experimenters are paying that three months, six months, nine months, 12 months with here are the updated results. So you can't really get hide from, what did this really result in over a longer term horizon?\n\nLenny Rachitsky (00:22:10):\nSo your tool is email everyone that's involved with the experiment of here's what this cohort is doing now.\n\nArchie Abrams (00:22:16):\nCorrect.\n\nLenny Rachitsky (00:22:16):\nI love that. Okay, that's awesome. It's interesting that you use kind of these cohort curves for GMV, and is that the core metric you look at to see?\n\nArchie Abrams (00:22:25):\nThere's a few GMV, obviously gross profit. But GMV is kind of like a key determinant of long-term success.\n\nLenny Rachitsky (00:22:35):\nSo it's interesting. Most people use cohort retention curves. You're using cohort because you don't look at retention. You're looking at for GMV over time. So that's really interesting. \n\nArchie Abrams (00:22:45):\nGMV over time, which correlates better. And there's a retention in profit. And then really the absolute number of merchants who are on the platform and then reaching certain GMV.\n\nLenny Rachitsky (00:22:56):\nOkay, I'm going to not keep falling this path. We can go on and on. While we're in the topic of experiments and what you've done, I'm curious if there's any examples of big wins that your team has shipped that might inspire people as they're thinking about launching experiments. I know there's probably some trade secret stuff you don't want competitors to know, and I know this is particular to Shopify and a platform in eCommerce. But I guess is there anything that would be worth sharing of like, \"Here's a huge win that maybe we didn't expect.\"\n\nArchie Abrams (00:23:25):\nGoing back, there's always a lot of value in thinking through monetary friction as I mentioned. That's always going to be something to export. Trial dynamics, different types of incentives, all of those things are very impactful.\n\n(00:23:39):\nI would say on things that are maybe more practical and for everyone, there's an enormous amount, and we do see these with long-term effects. But just the nuts and bolts of sign up, collecting the right information. And you usually want to collect more information than most people think you do in your sign up flow. If you can then leverage that to personalize the guidance. And this is for SaaS product, the guidance that someone can get when they onboard into Shopify. \n\n(00:24:09):\nSo whether you're coming on, Shopify is a very diverse product, in-person selling, online selling different channels. There's the nuts and bolts of get more information from folks, build trust in there, give them right amount of guidance when they come on in a personalized way.\n\n(00:24:25):\nAnd that may sound like, okay, that's kind of obvious. But the amount of impact by just nailing those flows has never ceased to amaze me and setting up that person for long-term success. So monetary friction. Then just really good onboarding, personalization, a well of opportunities there.\n\nLenny Rachitsky (00:24:49):\nI love that onboarding comes up every time I ask anyone where they've seen ongoing success and opportunities, particularly in actually surprisingly driving retention. It's interesting that that's not what you look at, but it turns out that's one of the biggest levers for increasing retention. Interesting that even for a company that doesn't look at retention, that's a big opportunity.\n\nArchie Abrams (00:25:07):\nYes. Yeah, it's really because it's setting people up, for Shopify's case, I think the big thing about all of our metrics is... What we get very nervous about is the easiest way to increase retention is always to constrict the funnel stage one above the retention metric you're trying to optimize for. \n\n(00:25:27):\nThe simplest way to increase my signup to activated thing is just make it harder to sign up. Nuts and bolts, that will always happen is when you have teams on that local conversion rates, you get all these weird team incentives, because they're optimizing to basically implicitly make it harder to do the step before them.\n\n(00:25:49):\nAnd because we focus on that long-term GMV, number of merchants who are successful, orienting every team to think about the total number of people, not the rate, but the total number of people who got to the end of their part of the journey is a very powerful way to incentivize people to do the right thing in terms of getting people set up versus do the, \"I'm going to constrict the funnel step right before me to make my local conversion rate look better,\" which is the bane of my existence but something I see a lot of teams, implicitly or explicitly do when they get too focused on rates as a way to think about the world.\n\nLenny Rachitsky (00:26:32):\nIncentives. What a power.\n\nArchie Abrams (00:26:34):\nIncentives, what a power, what a lever.\n\nLenny Rachitsky (00:26:36):\nI definitely want to chat a little bit more about metrics. I know you have a really interesting take that's kind of built on what you're just talking about. But first of all, you mentioned this term monetary friction as one of the levers that you've seen success with. Can you just describe what that actually means?\n\nArchie Abrams (00:26:48):\nTotally. So things like trial, trial dynamics, trial length, trial amount. It means incentives. So what is in your product? What do people value and need in order to be successful? So in Shopify's case, that might be app score credits or things like that, but those are the two forms of monetary friction we talk about and then of course actual price point. But that's what the larger bucket of monetary friction is.\n\nLenny Rachitsky (00:27:16):\nSo let's follow this thread of metrics. You're big on absolute numbers and you've been talking about this already, versus percentages and ratios. Talk about that and how you encourage your teams to think about metrics.\n\nArchie Abrams (00:27:29):\nYeah, I think one of the things that I think happens particularly in large, in Shopify's growth order, it's about 600 folks. When you have teams naturally break up the world into different funnel stages or different points in the journey, it gets very seductive to look at my part of the funnel, and what's my conversion rate through that part of the funnel? And then the team starts to optimize for that conversion rate as their north star over a longer time period. I'm going to try to move my conversion rate from 10 to 12% or what have you.\n\n(00:28:04):\nBut in practice, I talked about it's actually almost always easier to just make it harder to do the thing right before your step in the funnel to increase your conversion rate. If I make it harder to sign up, it's going to be very easy to increase sign up to activated rate, because I just have fewer people and the people who made it through our higher intent.\n\n(00:28:23):\nAnd so I see teams get really stuck when they are trying to optimize conversion rate, but they just make it harder to do the previous thing. Versus everyone is thinking about absolute number of people who made it through their \"stage\" of the funnel. So instead of I'm trying to convert a bunch of people, a conversion rate, I just want more people to get activated.\n\n(00:28:48):\nAnd then once you start thinking that way, you realize actually the best way to get more people to get to a step sometimes, and often they just get more people in the door in the first place. So make it easier to sign up or reduce friction. It's the opposite. \n\n(00:29:05):\nBecause that will always hurt your conversion rate, but it may actually give you more people on the outside. And a lot of teams get very nervous, their retention rate went down, their LTV went down. Oh my goodness, is this this going to affect our ability to pay? No, your CAC also went down by probably more. And so now you have the ability to likely spend more and you have more people through the door, getting to each point in the activation or the immersion journeys.\n\nLenny Rachitsky (00:29:33):\nWhat I'm hearing is essentially teams are gold not on increase, lift this conversion step by some percentage. It's drive some absolute number of new merchants, potentially.\n\nArchie Abrams (00:29:45):\nMerchants, yeah. Exactly. \n\nLenny Rachitsky (00:29:47):\nThis is a good segue to I want to hear how you structure your growth team at Shopify. Essentially, what's the raw structure, what are the different teams, and what do they focus on? And then what are the functions within each teams?\n\nArchie Abrams (00:29:59):\nWe have two big groups within growth. So one is what we call growth R&D. So this might be what you traditionally consider product design engineering, data, your traditional product teams. Then we have growth marketing, which in Shopify's case is paid acquisition, media buying, affiliate marketing, email, content, and SEO. So that's growth R&D, growth marketing.\n\n(00:30:23):\nWithin growth R&D, three pillars. One is what we call growth products. And so this is basically everything from landing pages, sign up, onboarding, monetization. So trial, incentives, the like, all the way through to what we call our home feed, our engagement to basically get more merchants. Again, not necessarily to retain, but to keep giving entrepreneurship a try to become bigger and bigger businesses. So that's growth product, the full life cycle there. \n\n(00:30:56):\nSecond is what we call our enable pillar, and this pillar is building tools for both growth and the rest of Shopify. So things like experimentation platform, our communication platform, our business intelligence tooling that powers a lot of what we're doing, our more tech work to support our growth marketing team. \n\n(00:31:14):\nAnd then our third bucket, which is maybe a little different from most growth teams is actually our customer support, groups within growth. We want to think about customer support as part of this merchant journey of coming on, giving entrepreneurship a try, all the way through to here's the support I need as I'm becoming a multi-billion dollar business on Shopify. So those are the three big growth product buckets. And then within growth marketing, it's a more traditional channel setup. Paid, all the different channels online, offline, SEO, email, and affiliates.\n\nLenny Rachitsky (00:31:49):\nSuper cool. Okay. So within growth RD, I just took notes. I'm going to summarize what you just shared, which is awesome. So there's three big buckets. One is growth product, which essentially is onboarding. It feels like it's like the top of funnel, get people in. Well okay, so growth marketing feels like that's super top of funnel bring-\n\nArchie Abrams (00:32:07):\nThat's super top funnel. \n\nLenny Rachitsky (00:32:08):\nYeah. Okay, got it. So growth marketing, drive people to Shopify.com. Then within RD team, growth product takes that user and tries to get them to activate it. Enable helps... It feels like that's like internal tooling and ways to make the teams internally more efficient.\n\nArchie Abrams (00:32:27):\nCorrect. Both growth and outside growth.\n\nLenny Rachitsky (00:32:29):\nAwesome. Okay. And then the customer support team, that's really interesting. So there's a customer support product team that helps new merchants be successful. And does that include actual customer support agents? Is that within that team?\n\nArchie Abrams (00:32:46):\nThat's not. We build a tooling to make those support advisors superheroes. And then on the help center, all of our AI stuff to make a great customer experience for people who are just engaging in a self-serve. So it's the tooling and the experience for merchants.\n\nLenny Rachitsky (00:33:03):\nOkay. So with these teams, is there anything you can share about just how you think about metrics/goals for these different buckets? We don't need to get too deeply, but does everyone basically have an absolute new merchants goal or is it a little different?\n\nArchie Abrams (00:33:18):\nSo yeah. So at the highest level we think about that total cohort value. We bring in a set of merchants in a given year. How much GMV, how much that set of merchants worth over the next three, four years to Shopify? And that's the most important thing that we want to focus on. And then that of course, from an efficiency standpoint, that of course meeting our payback guardrails and all of that. So that's the macro growth perspective. Cohort value over cost and payback. So that's the macro point of view.\n\n(00:33:52):\nAnd then within growth marketing, each channel operates with certain guardrails around their LTV CACs. Same thing for content and SEO. That operates with kind of a guardrail model for each piece of content. How much is that going to come back and down the line?\n\n(00:34:09):\nFor growth products, it's also a combination of total GP incremental cohort value that's produced from those teams. So everything is basically going to be measured on from an experiment, ideally measured over a very long time period. What was the incremental cohort value lift that this generated? And that's how we think about and measure the impact of each of those sub teams along the way.\n\n(00:34:40):\nEach of those have a civic part of the funnel they play with. But because they're measured on absolutes and they really think about that absolute value, we don't get caught into, did your conversion rate over the course of this year go up or down? It's kind of irrelevant. What was the sum of the impact over a long period on that total cohort value that we're trying to produce from before merchants?\n\nLenny Rachitsky (00:35:01):\nAnd the way you come up with this goal I imagine is you have a forecast of where things would go organically, and then here's the lift we want to see from the work this team does this quarter, this year.\n\nArchie Abrams (00:35:12):\nCorrect. And then we're going to measure against for each experiment, did it actually get to where we expect that lift to be?\n\nLenny Rachitsky (00:35:21):\nAnd those experiments again, are those all long-term holdout experiments where you look wait a year or some-\n\nArchie Abrams (00:35:29):\nWe call. We call the experiment after three weeks, but in all cases, the group is held, we watch them. And that's where that ping comes back, every experiment is watched. And that ping comes back three, six months, 12 months to re-look at was this actually successful?\n\nLenny Rachitsky (00:35:42):\nOkay, cool.\n\nArchie Abrams (00:35:44):\nSo that creates the loop of shipping value quickly, but making sure we're holding ourselves accountable to did this actually produce results over a long period, or did it actually just have this neutral effect? It's like, oh, then we can learn from that and get better.\n\nLenny Rachitsky (00:36:01):\nThis episode is brought to you by Dovetail, the AI-first customer insights hub for all teams. Dovetail has always been the go-to tool for teams who want to find insights in customer calls, user interviews, or documents. Now they've stepped it up with the release of Dovetail 3.0. That's three new products and a ton of AI features that make it faster and easier than ever before to truly get at the heart of what your customers want. You can get a real-time pulse on what your customers are thinking with Dovetail's, automated feedback analysis platform, channels, or full summaries and insights from every customer interaction your team has ever had with their AI chatbot ask Dovetail. You can even recruit from over 3 million participants directly in Dovetail.\n\n(00:36:43):\nAll this is just the tip of the iceberg. Dovetail wants to give everyone in their organization instant access to their customers at any time. From roadmaps, discovery, to strategy sessions and more, it's never been easier to make customer-centric decisions.\n\n(00:36:58):\nThe good news is Lenny's listeners can try Dovetail's Pro plan along with their newest products and features free for 30 days. Just go to dovetail.com/Lenny. \n\n(00:37:10):\nSo maybe just to dig into this again, because it's so interesting. Basically, product team ships stuff, they run an experiment, they see impact. Say it's 5% lift on something. Huzzah, you did it. Great work, performance review. Your exceeds, you're doing great. This team's killing it. And then a year later you realize, \"Oh, that didn't last.\" How often do you find a team that is shipping wins looks back and ends up seeing, \"That wasn't actually as successful as it.\" I know you said maybe it's a third of the time.\n\nArchie Abrams (00:37:38):\n30. Yeah.\n\nLenny Rachitsky (00:37:39):\nYeah. Okay, so it's still roughly, yeah.\n\nArchie Abrams (00:37:42):\nAnd it's great learning and that's why we take it. It's like, wow, okay, now we really uncovered something and it's such a successful discovery. Wow, okay, we thought this thing. But now we learned it actually wasn't as true as we thought. Cool. What can we take from that and be smarter next time so we don't just double down on the wrong things?\n\nLenny Rachitsky (00:38:02):\nThat's so interesting. And again, and you mentioned most of the reason this is the case when something doesn't show lift down the road is it's pulling forward success that would've been seen later on its own if you had not even shipped this thing?\n\nArchie Abrams (00:38:14):\nCorrect.\n\nLenny Rachitsky (00:38:14):\nAwesome. Is there an example by any chance that comes to mind of something like that that's just like, \"Wow, that was a big win. And then oh I see we just pulled forward some revenue from the future.\"\n\nArchie Abrams (00:38:25):\nSo I think one good example is something around payment failure notifications. So one of the things that a lot of teams have or see is we call Dunning effects where somebody might have a payment not go through, a credit card that doesn't go through. So we did a bunch of experimentation around, hey, how can we alert people that their credit card is failed, their payment attempt failed?\n\n(00:38:47):\nAnd that's a typical growth win, usually produces a lot of short-term impact. And that's what we saw here. We were doing much better alerting, reminding people, sending them a million emails about it. Cool, we got some pretty major lift.\n\n(00:38:59):\nYou look back six, 12 months. There was really no long-term lift. And why is that? Because there's really a little bit of a selection bias there that people who were letting that payment fail probably weren't actually that dedicated to this entrepreneurship craft. They may have updated their credit card, but they still really weren't in it.\n\n(00:39:22):\nAnd so that was a good example of in a bunch of this stuff around payments, even \"preventing\" churn where you look, it's six, 12, 18 months. On a GMV metric, not a lot of lift over that long-term horizon.\n\nLenny Rachitsky (00:39:37):\nI love this example. I could see so many people having run experiments like this and like, \"Oh, we found such a huge win. This team's killing it. What a great idea. Of course this makes sense,\" and then turns out it's nothing long term.\n\nArchie Abrams (00:39:54):\nWhich is great. We were going to spend a lot of time, okay, what else can we do here? It's like, no actually bigger fish to fry in a lot of other areas. So it helps the team just feel really good that their work is really the things that were good.\n\n(00:40:13):\nAnother one that went the other way, which was really interesting was in our online store, and this might be if you use Shopify, we have sections and blocks that come pre-configured. And so we tested, okay, if we give you a pre-configured block of you should have an image up top, then a text banner, and then a collage with your products. That should help folks understand what to do when they're building the online store. It actually had no lift in people converting to a paying merchant. \n\n(00:40:48):\nHowever, when we looked longer term on that six months later, it had a pretty massive impact on the number of people who were selling and producing GMV. And why is that? Because it didn't likely really influence anyone to buy Shopify or pay for Shopify. But the people who used it created better stores that were higher converting, and so they got early sales. They actually converted one of their visitors and they got momentum, and they stuck with entrepreneurship a little bit longer. And we saw that in that opposite way.\n\n(00:41:21):\nAnd so this is an example where that neutral, and so we tend to ship neutral. It's like it could be positive and so let's let it go if we have good intuition about it and it'll turn. So we've seen a bunch of these things go in very different directions.\n\nLenny Rachitsky (00:41:36):\nThis is so fascinating. I didn't realize that you ship neutral experiments. That's an interesting insight. So it's like if you feel good about it and it's neutral, you ship it?\n\nArchie Abrams (00:41:45):\nIn our culture of the kind of aim heavy, if the intuition is right that this probably is helping merchants, why do we start with that the original control is better if it's neutral? Let's start with, what would we have shipped if we were a blank slate? And if it's neutral, actually neither is better, so let's just pick the one we feel better about and ship that. \n\nLenny Rachitsky (00:42:03):\nMakes so much sense. Oh man. Okay, so let's talk about this a little bit more. So this aim heavy concept, this idea of thinking 100 years out, can you just share more about that insight and that philosophy? I know it sounds like it comes from Tobi of how he likes to think about the business.\n\nArchie Abrams (00:42:18):\nTotally. It is all Tobi of really making sure Shopify is so oriented around, we are here to build 100 year company. And so the decisions we're going to make are really oriented towards the long-term success of merchants, of Shopify. Embedded in all of our principles are make the best product in the world, make money to do more of one. Never reverse principles two and three. In every kind of executive meeting, every town hall, that slide comes up. It's like you've been at Shopify, you've probably seen that slide 10,000 times. But it's an important reminder job is to build the best product for merchants over the long period of time. And then all of the metrics and the make money part of it, secondary to that. So what we care about is that long term piece. It ties a little bit to that original conversation about entrepreneurs and being the core of why we just want more people to start businesses and go.\n\n(00:43:15):\nIt's very seductive I think in most companies, including in Shopify because we can support large enterprise businesses today, right? Big brands who want to get off an outdated solution and come over to Shopify. It's very easy to just say, \"Oh, that's very concrete.\" There's an existing business, we want to have them come join Shopify. \n\n(00:43:40):\nAnd in the short term it feels really good. It brings a lot of revenue right away. But if you're thinking about the long-term 100 years from now, guess what? All of the big brands of today be out of business. And many of them will be out of business in 30, 40, 50 years. The real success of Shopify is getting every business to start with us and go, but making that type of an investment and being so focused on that entrepreneur segment and making it easier is how we build a very, very long-term oriented company. So just even how we do capital investment, how we do product decision-making comes back to, hey, we can't chase the short-term. Even more concrete things.\n\nLenny Rachitsky (00:44:24):\nIs there an example that comes to mind where you did that where something short-term looked like, \"We should definitely do this,\" but we're thinking thinking 100 years out so we're going to approach it this way?\n\nArchie Abrams (00:44:35):\nIt's kind of very much just imbued in the culture. Almost everything kind of feels that way. And I'll give, practically speaking, every six weeks all the R&D group leads we get together and we sit with Tobi and each other and review every single project across the company. Every six weeks, every single R&D pull up the dashboard, and look at it.\n\n(00:44:56):\nAnd in that conversation, so much of the conversation is about both the technical how. How are we building this in a way that allows for Shopify to have optionality in the technical decisions that we are making? And I think for Tobi, one of the things I've learned and so is that how, the technical architecture determines strategy in a technology company even more than the what and who we're building for. If you build the right technical how and set yourself up to have a platform that can be adaptable, flexible, that is incredibly valuable over the long term. It means we will sometimes take longer to ship a feature. It means we'll not chase certain deals or what have you, but we're going to kind of make that investment. And it comes through in all of our reviews and just how we got to do our work together.\n\nLenny Rachitsky (00:45:53):\nWow, that is really unique. I've not heard of that where how... Usually it's the opposite. Let's not worry about how we're going to build this thing. It's why are we building this thing and then when are we building it? And not just the architecture is the most important thing.\n\nArchie Abrams (00:46:09):\nYeah, I mean in the last one, it was great. We had a 30-minute discussion about how to build CSV importers for people coming over from different platforms, and it was all about are we using open source library, doing it internally, are we doing it in the core code base? Are we building a separate first party app to do it? It was incredible detail. \n\n(00:46:29):\nThis is what's amazing about Tobi. The technical detail of how we're going to do this was incredibly important to get right, to kind of set up this type of infrastructure. And most companies it'd be okay what, you're going to make it easier for people to migrate their data over. Cool. Team, go figure out how. And if team does figure out the how do we work on it with Tobi and the details, because the how is so important to how we build for the future.\n\nLenny Rachitsky (00:46:54):\nThat's fascinating. And usually it's how do we do this as quick as possible, because CVS importing is not our core differentiator. It'll just build something good enough, we'll ship it, we'll move on.\n\nArchie Abrams (00:47:02):\nCorrect.\n\nLenny Rachitsky (00:47:02):\nTotally the opposite. That is fascinating. What's also really interesting about this is I think about Brian Chesky at Airbnb where I worked for a while and his... So one, he also had this idea of the 100-year vision and thinking for the future way out in 100 years. But interestingly, since he's a designer, he had a very different focus. So Tobi, he was an engineer. He still codes from what I can see on Twitter, he still-\n\nArchie Abrams (00:47:24):\nAbsolutely.\n\nLenny Rachitsky (00:47:26):\nSo I could see why his brain goes there and why he's really strong in the how. Brian on the other hand is very focused on the experience and making sure the design is amazing, and the app is exactly what he wants it to feel like. It is very experience oriented. So it's interesting that these founders lean into the thing that they're strong at, and understand deeply, and that ideally connects with the way this business specifically wins and grows. And it makes sense a platform, I could see why engineering would be so essential to get right. Travel, hospitality, consumer app. I could see why design is so important. \n\nArchie Abrams (00:48:03):\n100%.\n\nLenny Rachitsky (00:48:04):\nFascinating. One more tidbit that I've heard about how you all think about this is metrics. And you mentioned before we started recording that a lot of the company doesn't actually have metrics that drive what they build, especially within the core business, which I think surprised a lot of people. Most people are like, \"Every team needs a metric and a KPI, and this is how we measure progress and this is how we know if they're doing well.\" Talk about just how that works, how most of the companies doesn't have a metric.\n\nArchie Abrams (00:48:31):\nYeah. It's funny, we ran against KPIs are basically banned as OKRs or banned and all that. And so certainly, in growth you have metrics, but they take a different form. And then in core, it truly is, do we have conviction that this is the right technical foundation to build the future of commerce? And that is built through certainly looking at data. So it's not that teams are not looking at data and using it as a piece of their puzzle, but it's not the overriding. And when we go to ship a feature in core, it's not like a team is held accountable for this metric over this six months. It's much more, did we ship the right thing? And we're going to kind of get at that through a variety of lenses. Could be some of that could be data, qualitative, just our own product sense of what's good or not.\n\n(00:49:24):\nAnd so I think the upside of that is I think we tend to ship things in core and that are incredibly forward-facing and we take more risk. I think to acknowledge some of the downside of it though is sometimes conversations get extremely subjective about what is the right thing to do. And so that requires the right way of having good discussions, openness from all leaders and from teams to debate those things. But it does result in some squishiness, which again has its pros and cons, but taste is what drives a lot of what we're shipping in core.\n\nLenny Rachitsky (00:50:05):\nYeah, I'm glad you touched on that. I was going to say, okay, everyone would love this idea of just build things that we think are awesome. It's going to be great. But then you build a whole org with teams and people building stuff. How does one know if they're building things that are good and helping versus not?\n\n(00:50:21):\nAnd you're pointing out there are pros and cons to that. The pros is we're not optimizing for some short-term wins and driving some poor metric. The con is you might ship stuff that... There's a lot of subjectivity, and people may not agree, and it's a lot of squishy stuff.\n\nArchie Abrams (00:50:39):\nYeah, totally. Glen, who's heads of core product, I mean one of the things that's so impressive about Glen and that core team is they go incredibly deep into every single release that is shipped. And so you do have a central eye on the quality and how it all fits together.\n\n(00:51:00):\nAnd so that I think helps make sure there's a consistent kind of bar for taste. A bunch of folks Tobi obviously that can enforce that. So it's subjective, but it's objective in the sense that it's kind of a small number of people who really hold what that bar is and needs to be. I think if it's just subjective, let's just ship what we want without a couple people really holding that quality and that taste bar, that's where things go really sideways.\n\nLenny Rachitsky (00:51:31):\nAwesome. That's exactly what I was going to ask is, who's the ultimate decider of taste and what is good? And so it sounds like basically Tobi above, and then he's kind of deputized Glen and relies on him to make a lot of these final calls. And then I imagine Glen has some folks that he kind of deputizes to make smaller decisions along the way. Or not, or he's very involved in everything.\n\nArchie Abrams (00:51:55):\nAnd I think this is the fun thing about Shopify. Literally we have our own internal project management system that's been kind of crafted just for Shopify and every shift-\n\nLenny Rachitsky (00:52:03):\nWhat is that called by the way? It's got a cool name, right? \n\nArchie Abrams (00:52:06):\nGSD. \n\nLenny Rachitsky (00:52:07):\nGSD, yeah. [inaudible 00:52:10].\n\nArchie Abrams (00:52:10):\nYeah, get it done.\n\nLenny Rachitsky (00:52:11):\nThat's what I remember.\n\nArchie Abrams (00:52:12):\nSo get shit done. And every project, so you got a core project, you have emergency service, you got growth project. And the expectation is that the group leads. Every single project that goes out has a few minute video with Figmas and everything, and everything that shipped. Needs to be okay-toed, so approved by the group lead. There's nothing that can ship without that okay-to approval. And that okay-to approval has to be Glen, Carl, myself with different groups. And so that is how everything is reviewed. Now of course there's great amazing teams that do amazing work, but it is that that's how the system works.\n\nLenny Rachitsky (00:52:50):\nAnd okay-to specifically means someone above reviews it or all this whole team, everyone looks at it?\n\nArchie Abrams (00:52:56):\nNo. So Glen reviews the core stuff. Carl reviews the MS. Okay-to. It's interesting.\n\nLenny Rachitsky (00:53:05):\nIt's basically Glen is founder mode and not as a founder where he's involved in all the details, has final say. So this is a really cool example of founder mode, but not as a founder.\n\nArchie Abrams (00:53:15):\nCorrect.\n\nLenny Rachitsky (00:53:16):\nIn the way you guys operate. And I imagine sometimes Tobi disagrees with Glen and then they talk about it and things get ironed out.\n\nArchie Abrams (00:53:22):\nTotally. And that's why we come together every six weeks, everyone in person to review every project so we can hash out those disagreements. Go through all the core projects, all the merge service projects, all the growth projects. And it's a great forum to say, \"Hey, here's where we disagree,\" really on the how and the tactics of what's happening. And we can flag those things, have good debates about whether there might be misalignment.\n\nLenny Rachitsky (00:53:43):\nAmazing. What a unique way of working. I'm so fascinated by all this. So what I'm hearing essentially within Core, Glen and his team come up with, \"Here's what we're going to build the next quarter.\" You guys have twice a year releases, is that right? Or is it every season?\n\nArchie Abrams (00:53:58):\nYeah, so big additions. Twice a year. Obviously continually shipping, but we package them twice a year in a big bang.\n\nLenny Rachitsky (00:54:05):\nBig launch. Yep, I've seen those. Okay. So he's like, \"Here's what we're going to do in the next release. We're just going to build this because we think this is right. And we're not driving a specific goal. We're building for 100 years in the future. Let's just build it.\" And basically you build it. He's like, \"This is great, not great, iterate until it's this good,\" and then ship. And great. Okay, this is great. Okay, so then there's that team, and then there's your team, which is drive some freaking numbers, drive growth, hit these goals. How do you collaborate across these two teams? Do you have a model for how you work together? Because these feel like very different ways of working?\n\nArchie Abrams (00:54:41):\nYeah, honestly, it's been one of the things I'm very proud of. We built a really great partnership for the last three and a half years, because it's intentionally meant to be almost at odds, and that's part of the structure of how we want to work.\n\n(00:54:56):\nBut it comes from, I think, a place of respect on both sides. And I'd say for anyone, it's okay, here's what growth is going to do. We're going to do it in a way that is high quality, that is shipping really good stuff for merchants. We're probably going to approach it in a faster way. We might disagree on things, but we're going to have reasonable paths to handle that conflict.\n\n(00:55:17):\nAnd so while there's no magic bullet, it wasn't like these are the surfaces that growth can touch, these are not. It was like you can go anywhere in the product, but let's go figure out how to work together to figure out that quality bar to understand when you're going to be different on it, on the quality bar to get something out to learn, and just building trust along the way that we're actually going to ship high quality things and we ship it to 100% and move. And so a lot of great work on the team to make those relationships really strong.\n\nLenny Rachitsky (00:55:47):\nGot it. So basically, you guys are like, \"Moving this button over here is going to drive so much growth,\" and then Glen's like, \"No, this is not acceptable. We don't want a button here. This looks terrible. Everyone's going to hate it.\" So that's the healthy tension. I'm describing a combative-\n\nArchie Abrams (00:56:01):\n[inaudible 00:56:01] totally. And it's like, okay, so how are we going to work to figure this out? It might be, \"Hey, we're going to move the button. Hey let's run the test,\" but see the short-term lift. You know we're going to monitor it long term. You know when we ship it, it's going to be high quality, high quality polish. And you trust us to make those trade-offs.\n\n(00:56:19):\nI wish I had a better answer of it's very human. It's very that trust that's that's very important in any of these. I think growth with other teams is like, there's no replacement for just the human trust and then following through on commitments of no, we are actually going to make this thing really good. \n\nLenny Rachitsky (00:56:38):\nIs there an example of that, that comes to mind where you had something that was you thought was going to drive meaningful growth? You showed it to Glenn, he is like, \"No, don't know about this.\" And then either you iterated or you just forget it, this isn't right for the platform even though it's going to drive some meaningful growth?\n\nArchie Abrams (00:56:54):\nThe place that we often come back to is, and this is with I think Tobi is great, Tobi and Glen, is on wizards. So wizards-\n\nLenny Rachitsky (00:57:07):\nOnboarding carousels.\n\nArchie Abrams (00:57:08):\nOnboarding carousels. Some way that basically has folks get set up by not using the actual product. And so we've always kind of danced around and we have very specific no wizard principle, but I think that sometimes the tension is wizards can serve a purpose in certain circumstances, but we've avoided doing that. But we've always worked to try to make the principles of what a wizard does really well, which is it simplifies the product into something that allows people to have a lower bar, to try to work with core to bring that into the actual experience itself.\n\n(00:57:52):\nSo the example of that experiment I mentioned to you of giving pre-filled sections in the online store editor, you could have solved that in a wizardy way of, \"Enter a few things, and we're going to generate these sections for you.\" Instead, we actually took those pre-generated things based on what we know about you and put it into the actual project experience itself.\n\n(00:58:15):\nSo it tried to get at some of the principles of what a wizard can do well without avoiding the wizard principle, without creating actual wizard. So that's been some of the, how do we work together to get the intent of what the growth ideas but in a way that's consistent with the way we want to build in core?\n\nLenny Rachitsky (00:58:34):\nGot it. And I get why that you think about this a lot because you talked about one of the biggest levers is onboarding and helping more people get activated, and so I could see why you spent a lot of time thinking about how do we help more people succeed there.\n\nArchie Abrams (00:58:46):\nYes.\n\nLenny Rachitsky (00:58:48):\nI want to ask your insight on this idea that people might be listening to this and feeling like, \"Oh, we need to build a team that just builds great product and is not constrained by metrics and driving growth.\" Short-term thinking, long-term thinking, 100 years. This is inspiring I think to a lot of companies because the sounds great.\n\n(00:59:08):\nWhat do you think it takes to make something like that work? Because in a bad case, this team just sits around and builds whatever they want, and the rest of the company's like, \"God damn, this sucks. I have to show success in metrics and moving a metric in this team, over there just build beautiful things.\" Is it like you need a founder like Tobi, that prioritizes this and values it and has a very good taste and intuition? What do you think are important elements of something like that, of this approach working at a company based on what you've seen?\n\nArchie Abrams (00:59:37):\nYeah, I think it needs to have a very opinionated founder set of people who are driving what good looks like. And I think Shopify a few years ago and before maybe sometimes drifted into the mode of, \"We are just going to build stuff and each kind of team is just going to build stuff not really accountable for it,\" and that is a very, very bad state to end up. So I think you either have to use, my sense is metrics as accountability, which is the most common kind of way to drive accountability and focus. Or extremely strong founder or set of folks who have extremely strong opinions on what good is and what taste is. If you have one of those two, you can make it work, but the worst case is let's just go build a bunch of cool stuff in kind of a haphazard way. That I don't think would work.\n\nLenny Rachitsky (01:00:30):\nYeah, this is great. So either you need metrics to tell you you're doing the right thing or really correct and good taste in your founder.\n\nArchie Abrams (01:00:42):\nCorrect.\n\nLenny Rachitsky (01:00:42):\nCool. I think that's a really good way of... And I imagine every founder is going to think, \"Oh, that's me. I have this, I can do this.\" I think it's rare in real life. It's rare that you're like a Tobi, or Brian Chesky, or Elon.\n\nArchie Abrams (01:00:43):\n100%.\n\nLenny Rachitsky (01:00:57):\nYeah. It's hard to internalize that, but I think that's the reality. So most people will be more successful building things that are driving metrics they can track in an experiment. \n\nArchie Abrams (01:01:07):\nYes. \n\nLenny Rachitsky (01:01:08):\nAwesome. This is very fascinating. I'm so happy we're spending so much time on this. Okay, there's a few other random things I'm going to touch on. One is sales. So historically, Shopify has been very product-like growth, very organic. Go check it out, sign up, shop a store, start a store, grow. And you guys have layered on sales. In a sales motion that's an increasing part of your business. What have you learned about your team, the growth team working with sales and making that a successful relationship?\n\nArchie Abrams (01:01:36):\nYeah, no, it has been great over the last couple of years as built out, the sales order has added a whole new kind of motion to Shopify. As Shopify's product got better, it can serve the biggest companies in the world. It's like the natural evolution. Well what are you going to do that for people to grow up on Shopify and to be the biggest companies, but we're also going to take folks another platform, bring them over.\n\n(01:01:57):\nFor growth in sales, I think the biggest learning from the the R&D side at least has been the scale is very different with sales, and so it's really hard to use as much quantitative data to make growth, to make some of those decisions. \n\n(01:02:18):\nAnd so a lot of it has been building much more qualitative insights working with merchant success, sales about the challenges they're facing and onboarding a large customer. So how do we build import tools that work for them? How do we make sure they have the right guidance in the product for a very different set of use cases? So a lot of it has just been very much empathy building with sales about what that merchant journey looks like, and quite frankly challenging ourselves to think differently. It's been one thing.\n\n(01:02:49):\nAnd then second, we kind of built two very distinct funnels for a little bit. There's a sales funnel. You come in, you contact us, that's it. There's no mention of self-service, there's no this. There's just drive MQLs, boom. Then there's the self-service thing. There's no mention of sales anywhere. \n\n(01:03:05):\nSo one of the last thing the year, last year we've been really doing is how do we create these hyper journeys where there is... We shouldn't force the merchant to choose, do you want to talk to sales? You want to do self-service? Should give them the options, whatever path that they want to go on.\n\n(01:03:19):\nAnd so a lot of that has been building into the self-service journey over to sales and then from sales into self-service. That's broken a lot of metrics in the business. That's broken a lot of ways people have thought about their jobs, and so there's been a lot of cultural resetting and just getting smarter from a metric standpoint about, how do we measure this thing of hybrid journey? They came in via self-service, they went over to sales. How do we value each of those components in the process? And transparently, that's something we're still getting better at, but it's really important to get there.\n\nLenny Rachitsky (01:03:55):\nIs there an example of something that broke that would be illustrative of what you're describing?\n\nArchie Abrams (01:04:01):\nYeah. So I think that breaks is drive someone from an ad over to self-service. We typically look at only the self-service LTV of that person. But what happens if they come in, they sign up via self-service and then they go talk to sales? They get changed to a sales driven merchant, which means that that value of that merchant, which is usually actually quite large, does not get associated back to that ad campaign. Oh, guess what that means? That means you would probably reduce investment on that ad campaign because you weren't valuing that. Our system had two different models for calculating LTV. Sales driven one, and a self-service one. Uh oh, we're going to make suboptimal investment decisions now by kind of moving things around even though it's the right thing to do.\n\n(01:04:55):\nSo a lot of it's in rebuilding all instrumentation, how we do LTV modeling, how we do attribution, how we do incrementality testing across each of those different types of outcomes, because it was not an intuitive thing for us originally because we had built all of these systems with a much more siloed view.\n\nLenny Rachitsky (01:05:16):\nYeah, basically attribution gets a lot more complicated. Are you going in a multi-touch attribution direction or is there something even more clever?\n\nArchie Abrams (01:05:26):\nMy rant is I am... Multi-touch attribution as its place. I think ideally what we want to get through is what we really care about is incrementality. So incrementality is kind of the gold standards, for people who are less like attribution measure is, how do you assign value to a given touch point, right? Click, a view, etc. But it doesn't tell you causally what drove something. That's where incrementality tells you. Incrementality test is basically don't show ads on meta for certain number of people. Show it to the other set, see what the lift is and the outcome.\n\n(01:06:04):\nA lot of what we're doing is trying to get a lot, is continuing to get even more sophisticated in incrementality measurement for not just self-serve outcomes, but for self-service outcomes that then drive to sales for sales specific outcomes. And as soon as we have that kind of incrementality at the channel level, we can get a lot more sophisticated in terms of our bidding, budgeting, and all of that. But that's really the key thing we want to get to.\n\nLenny Rachitsky (01:06:35):\nThere's certain topics that alone can be their own podcast conversation to just dive deep into this stuff. But I'm going to stop myself and I'll go further down that track. Let me touch on a couple more things before I let you go.\n\n(01:06:46):\nOne is marketing. So we talked about sales, marketing. You guys don't have a CMO, there's no Shopify CMO. Instead you embed marketing leads within the org. For folks that are trying to grapple with that, should we hire CMO? Should we do something else? What have you learned about maybe the benefits and also maybe some downsides of approaching it the way you guys have approached it?\n\nArchie Abrams (01:07:07):\nThe benefit is, so there's growth marketing who sits in growth, there's revenue marketing who sits over closer to sales. There's a brand team under Harley who does amazing work. Our president. There's marketing embedded in core and PMM, sit with the product managers there. There's shop marketing on a consumer side. So marketing is truly everywhere in the org.\n\n(01:07:28):\nAnd I think the benefit of it is it's closest to the primary goal that those marketers are trying to do. They sit with growth so we can focus on that self-service motion. Harley is an amazing communicator, so brand sits with him so he can have a lot of influence over that. And so I think it sits with the people its most relevant outcomes are driving, which is great. It allows us move faster with less kind of coordination. \n\n(01:07:58):\nI think it only works because Tobi and Harley has such amazing intuition on what the brand is, needs to be, and all of that. Some of what the CMO does of kind of creating the cohesive story of Shopify it held in their heads and they have the pen on that. \n\n(01:08:19):\nAnd so that allows then, that piece of that CMO's job to not be as important at Shopify. But the other pieces are obviously critical, but they can be now closer to the action and where they're going to drive the most impact. The downside is things are sometimes very messy. So that's...\n\nLenny Rachitsky (01:08:40):\nIt's another example where the founder, their background and interest in skills can impact significantly the way the work is structured and who you hire and don't hire. Okay, one last question. Totally different topic, discounting. So you worked at Udemy for a long time. And from what I understand, discounting was one of the key reasons Udemy succeeded and one of the big differentiators. I'm curious what you learned about discounting, the power of discounting as a growth lever.\n\nArchie Abrams (01:09:09):\nYeah, so Udemy is a very an online marketplace for online courses. So come on course. And I think what was happening in I started, and we were there 2012-ish was people were like, \"What is this online course thing? I don't really understand what it is. I don't understand what the value is and what I'm willing to pay.\"\n\n(01:09:30):\nAnd so what discounting has a really powerful effect on is it can signal value with a high list price, but then bring something down to an affordable price. And that may seem like of course that's obvious, but in online courses what was important is the list price would be high at 100 bucks. So it's associated with a college course. But what people really value this thing as was a book.\n\n(01:09:54):\nAnd so you could signal very high, signal quality through price, which was very murky at that point in online learning. Signal value through price. Discount it to 10 bucks, or that was a typical Udemy deal. And then so 99% off, 90% off. We might see fire sales, but it changed the value in willingness to pay and then it tapped into the fact that, and still is education is very aspirational.\n\n(01:10:23):\nAnd so what a lot of people missed in education is yes, we want people to actually take the course, but that's actually in many cases not the job to be done. That there's an emotional job that's even more important, which is I'm feeling like I'm making progress in my educational journey, and just the act of purchasing a course or the act of buying a book is progress.\n\n(01:10:47):\nAnd so if you can make it very enticing, very high value thing, cheap, urgency, you can let people make that emotional journey by the act of purchasing, which then allowed us to actually have very good retention. Because you could keep coming back to that emotional job over and over again, which just counting with urgency allowed us to do.\n\nLenny Rachitsky (01:11:10):\nAmazing. Well with that, we reached our very exciting lightning round. Archie, are you ready?\n\nArchie Abrams (01:11:15):\nI'm ready. \n\nLenny Rachitsky (01:11:17):\nFirst question, what are two or three books that you recommended most to other people?\n\nArchie Abrams (01:11:21):\nSo one, I love to go back to marketers who wrote in the 1920s. And so one that I love is Scientific Advertising by Claude Hopkins. So it's basically one of the first direct marketers that came out and he innovated on some of the concepts of copywriting and just how you sell a product around can't make this product, can't sell the product, can you tell the product will help the customer achieve their goals? And so it's really fun. I find it really fun to go back in time, because there's a lot of really good first principles thinking that I think we've actually lost in more modern stuff where it's like personalization band, it's optimization, all this stuff. Where it's like how do you actually write and sell things really effectively? Scientific Advertising, it's a great book.\n\nLenny Rachitsky (01:12:09):\nIt's just like the name alone, it sounds really cool. Especially for someone in your shoes that feels like the perfect book for your role. And I think there's so much wisdom in just the thing someone figured out many years ago about what convinces people to buy something is still true and people overcomplicate it. Just going back to the original is often really useful.\n\nArchie Abrams (01:12:28):\nTotally. And The Perfect Mile about the chase for sub four minute mile by Roger Bannister and a few other folks is just a wonderful... As a runner, it's a really fun book to read about perseverance, how these folks really, they all competed to get to that really amazing goal of under four minutes in a mile.\n\nLenny Rachitsky (01:12:52):\nAwesome. Do you have a favorite recent movie or TV show you really enjoyed?\n\nArchie Abrams (01:12:58):\nI went back in time and I watched for the first time actually the entire season or all the episodes of The Sopranos, which was quite fun. Highly recommend. I did that in The Wire in the last six months.\n\nLenny Rachitsky (01:13:13):\nIt's a lot of watching.\n\nArchie Abrams (01:13:14):\nIt's a lot watching. Work out in the morning on my elliptical or bike, so it's a nice-\n\nLenny Rachitsky (01:13:20):\nThat's smart-\n\nArchie Abrams (01:13:21):\nWorkout show.\n\nLenny Rachitsky (01:13:22):\nThat's a good motivator to just work out out something. I got to watch the next episode. The Wire, it's hour long episodes and five seasons times 20. I think it's 22 episodes per season, right? \n\nArchie Abrams (01:13:32):\nYeah.\n\nLenny Rachitsky (01:13:33):\nOh geez. It's a lot of watching and I did that once and I was like, \"I've got a lot of episodes to watch,\" but incredible. Okay. It's funny you should say The Sopranos. I feel like a number of people recently told me they're watching the full Sopranos again. It's like a trend recently for some reason.\n\nArchie Abrams (01:13:50):\nOh, interesting.\n\nLenny Rachitsky (01:13:51):\nAnyway, do you have a favorite product you've recently discovered that you really love?\n\nArchie Abrams (01:13:54):\nSo the AI music creator. My kids and I... I'm the least musical person in the world and it's been amazing. My kids and I will create songs together about our days, about what's going on. So it's just been really fun to be able to have a musical experience for a non-musical person, and have that creative experience for them and it's been really awesome to use. \n\nLenny Rachitsky (01:14:15):\nSuno is Insane. I think it's Suno.ai, folks want to check it out. It's just such a fun party trick too, just to write a song on the spot about something that you're thinking about. Awesome. Two more questions. Do you have a favorite life motto that you often come back to, find helpful and worker life?\n\nArchie Abrams (01:14:31):\nYeah, I often come back to the plan is the plan until it's not. And it's basically like we have a plan. It's the plan, it's our best, let's commit to it. But acknowledge it might change and we'll deal with it then. But if the combination of we have a plan, stay focused on that, with also the acknowledgement that you need to be flexible, and try to combine those two sometimes contradictory things of focus plan with we got to be able to react in an effective way.\n\nLenny Rachitsky (01:15:01):\nReminds me of strong opinions loosely held as a concept.\n\nArchie Abrams (01:15:07):\nTotally.\n\nLenny Rachitsky (01:15:08):\nAwesome. Okay, final question. So I asked your wife what to ask you when you came on this podcast and she suggested that I ask you about your late father who had a lot of impact on your leadership style. So here's my question, what did you learn from your dad that impacts the way you work today?\n\nArchie Abrams (01:15:26):\nYeah. My dad a lot is a father, and he was an entrepreneur in technology. And I think one of the things that I so appreciate about his leadership style was the empathy, and curiosity, and kindness that he showed in everything. And I hope in some of the stories that of him, it's like no matter who anyone was, curious, love to engage and learn from. And I hope that's something that I try to take inspiration from is just be with everyone kind and learn from everyone you're with and around. So something I think about a lot.\n\nLenny Rachitsky (01:16:08):\nThat super resonates. He sounds like a wonderful human as are you. Archie, this was wonderful. We touched on so much. We covered so much. I feel like we could go on for many more hours. Maybe we'll do round two as you learn more things at your time at Shopify. Two final questions. Where can folks find you online if they want to potentially reach out or follow the stuff you're up to, and how can listeners be useful to you? \n\nArchie Abrams (01:16:30):\nSo not super on social media. But on LinkedIn, check me out, send me a message. And then yeah, if folks are hiring a bunch of folks, growth marketers, PMs, engineers, data folks, UXers, you want to work at Shopify and growth or other parts? Fully remote. So we'd love to have great people join.\n\nLenny Rachitsky (01:16:54):\nAwesome. And that last point, I think I'll just highlight one of the few remaining fully remote tech companies that is not returning to work. Returning to the office [inaudible 01:17:05] work. Definitely work.\n\nArchie Abrams (01:17:07):\nYes. Yes. \n\nLenny Rachitsky (01:17:09):\nAmazing. And sounds like basically you're hiring across all functions.\n\nArchie Abrams (01:17:12):\nAll functions.\n\nLenny Rachitsky (01:17:13):\nPerfect. Archie, thank you so much for being here.\n\nArchie Abrams (01:17:17):\nThank you Lenny, it was fun. \n\nLenny Rachitsky (01:17:19):\nBye everyone.\n\n(01:17:21):\nThank you so much for listening. If you found this valuable, you can subscribe to the show on Apple Podcasts, Spotify, or your favorite podcast app. Also, please consider giving us a rating or leaving a review, as that really helps other listeners find the podcast. You can find all past episodes or learn more about the show at lennyspodcast.com. See you in the next episode.\n\n",
  "companies": [
    "Bolt",
    "Twitter",
    "Amazon",
    "Figma",
    "Meta",
    "LinkedIn",
    "Apple",
    "Shopify",
    "Segment",
    "Airbnb"
  ]
}