{
  "episode_name": "Eeke de Milliano",
  "filename": "Eeke de Milliano.txt",
  "segments": [
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:00:00)",
      "timestamp_seconds": 0.0,
      "content": "Process, by definition, is variance reducing. You're introducing it,"
    },
    {
      "speaker": "because you worry that the variance in your org is too high. You want people to sort of meet a certain standard.\nEeke de Milliano",
      "timestamp": "00:00:13)",
      "timestamp_seconds": 0.0,
      "content": "And the cost of that is obviously, while you are reducing the standard and bringing folks up to the average, you're also bringing other folks down to the average. And oftentimes, the folks you're bringing down are your highest performers, your most creative thinkers. The folks who,"
    },
    {
      "speaker": "I think actually don't really need process to do their best work.\nEeke de Milliano",
      "timestamp": "00:00:34)",
      "timestamp_seconds": 0.0,
      "content": "And so, that, I think is always the tension that you have with process. And obviously one of the reasons why companies introduce process much more and more, as companies get bigger,"
    },
    {
      "speaker": "is because it's harder to get all these folks who don't need processing. You actually want to reduce the variance.\nLenny",
      "timestamp": "00:00:52)",
      "timestamp_seconds": 0.0,
      "content": "Welcome to Lenny's podcast, where I interview world-class product leaders and growth experts, to learn from their hard own experiences,"
    },
    {
      "speaker": "building and scaling today's most successful companies.\nLenny",
      "timestamp": "00:01:01)",
      "timestamp_seconds": 0.0,
      "content": "Today, my guest is Eeke de Milliano. Eeke is head of product at Retool. Prior to that, she was a longtime PM at Stripe. She was actually one of their very first PMs, where she helped build some of their foundational products like Stripe Checkout, Stripe Connect, Stripe Radar,"
    },
    {
      "speaker": "and Stripe Chargeback Protection.\nLenny",
      "timestamp": "00:01:18)",
      "timestamp_seconds": 0.0,
      "content": "I had a total blast chatting with Eeke. We covered Stripe's internal culture and what makes it so unique and innovative. How to foster and protect innovation at your own company. What is the right amount of process by stage of company?"
    },
    {
      "speaker": "How to build a talent portfolio. And so much more.\nLenny",
      "timestamp": "00:01:32)",
      "timestamp_seconds": 0.0,
      "content": "I am really excited for you to hear this episode. And with that, I bring you Eeke de Milliano,"
    },
    {
      "speaker": "after a short word from our wonderful sponsors.\nLenny",
      "timestamp": "00:01:41)",
      "timestamp_seconds": 0.0,
      "content": "Today's episode is brought to you by Miro, an online visual whiteboard that's designed specifically for teams like yours and mine. I have a quick request. Head on over to my board at Miro.com/Lenny and let me know which guest you'd love for me to have on in 2023."
    },
    {
      "speaker": "Lenny",
      "timestamp": "00:01:56)",
      "timestamp_seconds": 0.0,
      "content": "And while you're on the Miro board, feel free to play around with the tool. It's a great shared space to work closely with your colleagues, to capture ideas, get feedback,"
    },
    {
      "speaker": "and iterate quickly and easily on anything you're working on.\nLenny",
      "timestamp": "00:02:06)",
      "timestamp_seconds": 0.0,
      "content": "For example, in Miro, you can build out your product strategy by brainstorming with sticky notes, comments, live reactions, a voting tool. Even an estimation app,"
    },
    {
      "speaker": "Your whole distributed team can come together around a wireframe and draw ideas with a pen tool. Or even put mocks right into the Miro board.\nLenny",
      "timestamp": "00:02:24)",
      "timestamp_seconds": 0.0,
      "content": "And, with one of Miro's readymade templates, you can go from discovery and research, to your product roadmap, to customer journey flows,"
    },
    {
      "speaker": "Head on over to Miro.com/Lenny to leave your suggestions. That's M-I-R-O.com/Lenny.\nLenny",
      "timestamp": "00:02:41)",
      "timestamp_seconds": 0.0,
      "content": "This episode is brought to you by Notion. If you haven't heard of Notion, where have you been? I use Notion to coordinate this very podcast, including my content calendar, my sponsors,"
    },
    {
      "speaker": "and prepping guests for the launch of each episode.\nLenny",
      "timestamp": "00:02:55)",
      "timestamp_seconds": 0.0,
      "content": "Notion is an all-in-one team collaboration tool that combines note-taking, document sharing, wikis, project management, and much more, into one space that's simple,"
    },
    {
      "speaker": "powerful and beautifully designed.\nLenny",
      "timestamp": "00:03:06)",
      "timestamp_seconds": 0.0,
      "content": "And not only does it allow you to be more efficient in your work life, but you can easily transition to using it in your personal life, which is another feature that truly sets Notion apart. The other day,"
    },
    {
      "speaker": "I started a home project and immediately opened up Notion to help me organize it all.\nLenny",
      "timestamp": "00:03:21)",
      "timestamp_seconds": 0.0,
      "content": "Learn more and get started for free at Notion.com/LennysPod. Take the first step towards an organized happy team, today. Again,"
    },
    {
      "speaker": "at Notion.com/LennysPod.\nLenny",
      "timestamp": "00:03:36)",
      "timestamp_seconds": 0.0,
      "content": "Eeke,"
    },
    {
      "speaker": "welcome to the podcast.\nEeke de Milliano",
      "timestamp": "00:03:39)",
      "timestamp_seconds": 0.0,
      "content": "Thanks so much for having me,"
    },
    {
      "speaker": "Lenny.\nLenny",
      "timestamp": "00:03:41)",
      "timestamp_seconds": 0.0,
      "content": "It's absolutely my pleasure. A bunch of people have told me that I need to have you on this podcast. And actually, a big thank you to Snir Kodesh, who I believe is a colleague of yours, who gave me a bunch of interesting questions to ask you. So,"
    },
    {
      "speaker": "I hope you're ready.\nEeke de Milliano",
      "timestamp": "00:03:53)",
      "timestamp_seconds": 0.0,
      "content": "Awesome. Very ready. Snir is the best, so yeah,"
    },
    {
      "speaker": "I'm excited.\nLenny",
      "timestamp": "00:03:57)",
      "timestamp_seconds": 0.0,
      "content": "So you're currently head of product at Retool, but before that you spent a lot of time at Stripe. You spent six years at Stripe. And so, before we get to Retool,"
    },
    {
      "speaker": "I actually want to spend a little time on Stripe.\nLenny",
      "timestamp": "00:04:08)",
      "timestamp_seconds": 0.0,
      "content": "To set a little foundation, could you just talk about some of the things you worked on at Stripe? And maybe some of the things you're most proud of, during that time?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:04:15)",
      "timestamp_seconds": 0.0,
      "content": "Yeah. So when I joined Stripe, I joined Stripe in 2013. It was pretty small at the time, it was around 50"
    },
    {
      "speaker": "people. And Stripe didn't have any product managers at that time.\nEeke de Milliano",
      "timestamp": "00:04:23)",
      "timestamp_seconds": 0.0,
      "content": "And I think Stripe was kind of famous for that. And it really wasn't because we were anti-PM in any way. It was mostly just because we were building this product for developers. We had a lot of really talented engineers,"
    },
    {
      "speaker": "who were essentially doing the PM job.\nEeke de Milliano",
      "timestamp": "00:04:36)",
      "timestamp_seconds": 0.0,
      "content": "So I actually joined Stripe as the first account executive, which I think is pretty funny, now that I've seen real account executives do their jobs. Because I really just had no business doing that job. But it also really wasn't your typical sales job, in that most of Stripes volume was inbound. So I was really just spending all of my day talking to customers, helping them figure out how Stripe might work for their particular business flows,"
    },
    {
      "speaker": "and payment models.\nEeke de Milliano",
      "timestamp": "00:05:03)",
      "timestamp_seconds": 0.0,
      "content": "And a lot of it was, I think, what PMs do. It was just talking to customers, understanding their pain points, and really helping them figure out how the product might do that. And to this day, when people ask me, \"Hey, what's your advice for going into product management?\" I'm like, \"Well, you should go get a sales job. I think it's pretty valuable.\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:05:21)",
      "timestamp_seconds": 0.0,
      "content": "But, it's kind of a long story to explain that, at the time there was this one sort of business model, the two-sided marketplace business model, that was just becoming huge. And you can't even really sort of imagine that now, but back then, Airbnb, Lyft, Uber, all those marketplaces,"
    },
    {
      "speaker": "it was quite a new way of doing business.\nEeke de Milliano",
      "timestamp": "00:05:41)",
      "timestamp_seconds": 0.0,
      "content": "And so, I was talking to all these customers and they had pretty complicated payment needs. So it was like, one payer putting in funds and it's getting paid out to a recipient. So an Airbnb guest and an Airbnb host. Or multiple payers putting funds in and it's getting paid out to one recipient, like a GoFundMe campaign. Or one payer putting in money and it going out to multiple recipients, like with ClassPass,"
    },
    {
      "speaker": "where you get a subscription and then it gets paid out to a bunch of studios.\nEeke de Milliano",
      "timestamp": "00:06:10)",
      "timestamp_seconds": 0.0,
      "content": "And then on top of that, all these platforms and marketplaces started having all these pretty complex regulatory and compliance requirements that were pretty different,"
    },
    {
      "speaker": "country to country.\nEeke de Milliano",
      "timestamp": "00:06:18)",
      "timestamp_seconds": 0.0,
      "content": "So it was just this really complicated financial infrastructure problem, and Stripe actually didn't really have the right solution for it. And no one else in the market did,"
    },
    {
      "speaker": "either.\nEeke de Milliano",
      "timestamp": "00:06:28)",
      "timestamp_seconds": 0.0,
      "content": "So at the time, this Stripe engineer, Brian Krausz, started poking around at this problem. Because I was talking to so many of these customers, we started talking about this problem together and poking around. And that actually resulted in us launching this sort of evolution of this product that we had at the time,"
    },
    {
      "speaker": "called Stripe Connect.\nEeke de Milliano",
      "timestamp": "00:06:46)",
      "timestamp_seconds": 0.0,
      "content": "That was easily, I think, one of my favorite products I worked on. Not only, it ended up actually being really quite significant for Stripe's business. But also,"
    },
    {
      "speaker": "because it was the first product and I think that's always pretty special.\nEeke de Milliano",
      "timestamp": "00:06:58)",
      "timestamp_seconds": 0.0,
      "content": "And then, the second product that I think of very fondly during my time at Stripe, was this product, Stripe Radar. So Stripe obviously processes a lot of payments. Wherever there's money,"
    },
    {
      "speaker": "fraudsters will kind of follow.\nEeke de Milliano",
      "timestamp": "00:07:12)",
      "timestamp_seconds": 0.0,
      "content": "And there were certainly some merchants who were just particularly vulnerable to payments fraud. So,"
    },
    {
      "speaker": "someone's using stolen credit card information to essentially purchase a good.\nEeke de Milliano",
      "timestamp": "00:07:21)",
      "timestamp_seconds": 0.0,
      "content": "And if you're not in payments, this is going to sound kind of shocking. But if a merchant processes a payment from a customer and that customer used a stolen credit card, the merchant is ultimately on the hook for those funds. So it can be detrimental. The merchant who's trying to run a real business is just losing all of this money,"
    },
    {
      "speaker": "because there are all of these frauds who are buying stuff from them online.\nEeke de Milliano",
      "timestamp": "00:07:48)",
      "timestamp_seconds": 0.0,
      "content": "So I really liked working on that product. So the product at Stripe was essentially, we built a bunch of machine learning models to try and predict when a payment was fraudulent. And then we built a product on top of that, to help customers understand why we were blocking payments,"
    },
    {
      "speaker": "and help them write their own rules around that too.\nEeke de Milliano",
      "timestamp": "00:08:03)",
      "timestamp_seconds": 0.0,
      "content": "And that was really fun,"
    },
    {
      "speaker": "both from an anthropological perspective. Because we were kind of hanging out in corners of the internet where you wouldn't usually go if you were doing only legal things. So we were trying to understand who these fraudsters were.\nEeke de Milliano",
      "timestamp": "00:08:16)",
      "timestamp_seconds": 0.0,
      "content": "But it was also really cool from a product perspective, because of all the kind of complicated product questions around how humans should interact with AI and models. And I imagine a lot of the folks in the latest movement in AI are thinking a lot about that too. It's like, \"How do you explain a model to humans? How do you let them interact with it?\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:08:33)",
      "timestamp_seconds": 0.0,
      "content": "So, both those things were really,"
    },
    {
      "speaker": "really neat.\nLenny",
      "timestamp": "00:08:37)",
      "timestamp_seconds": 0.0,
      "content": "I actually use Stripe for my newsletter. It's how folks subscribe. And when I log into my Stripe Dashboard,"
    },
    {
      "speaker": "And I feel like I should probably turn it on. That sounds really useful.\nLenny",
      "timestamp": "00:08:57)",
      "timestamp_seconds": 0.0,
      "content": "One thing, that I want to dig in on... So you said when you joined, there were no PMs at Stripe. How many PMs were there when you moved into product at Stripe?"
    },
    {
      "speaker": "Yeah.\nLenny",
      "timestamp": "00:09:13)",
      "timestamp_seconds": 0.0,
      "content": "And you said Stripe is kind of known for being really late to PM and... I don't know if I want to say anti-PM, but there's a lot of sense of, \"Why do we need PMs? We have amazing engineers who can decide what to build.\""
    },
    {
      "speaker": "Lenny",
      "timestamp": "00:09:23)",
      "timestamp_seconds": 0.0,
      "content": "Is there anything you can share around that general philosophy of Stripe? And was it effective? Was it good? Because a lot of companies are anti-PM. And I think they always point to Stripe, and Snap is another example of, \"We don't need PMs. Look how far these companies got with without PMs.\""
    },
    {
      "speaker": "Lenny",
      "timestamp": "00:09:38)",
      "timestamp_seconds": 0.0,
      "content": "Is there something unique to Stripe that allowed them not to have PMs? I think there was like 200 employees probably,"
    },
    {
      "speaker": "by the time they had their first PM.\nEeke de Milliano",
      "timestamp": "00:09:44)",
      "timestamp_seconds": 0.0,
      "content": "I think we actually had our first PM at... I want to say at about 100"
    },
    {
      "speaker": "Okay.\nEeke de Milliano",
      "timestamp": "00:09:48)",
      "timestamp_seconds": 0.0,
      "content": "But yeah, no, it was late in the game. And actually,"
    },
    {
      "speaker": "maybe just to pattern match. Retool also didn't really have PMs for a while.\nEeke de Milliano",
      "timestamp": "00:09:57)",
      "timestamp_seconds": 0.0,
      "content": "And I think actually both in the Stripe case and the Retool case, the thing that both of these companies have in common is, you're building for developers. The people who are building the product are the customers in a lot of ways. So, they get it. There's really no reason why you should have, in some ways, a middle man trying to figure out, \"Hey, who's the customer, and what is it that they need?\" And what are their pain points?\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:10:19)",
      "timestamp_seconds": 0.0,
      "content": "And I think the moment at which it became clear, \"We really do need PMs at Stripe.\" And I think we felt the same way at Retool is, your customer base starts expanding. You start having different kinds of customers. You need to understand the whole market,"
    },
    {
      "speaker": "all of the ICPs that you're going after.\nEeke de Milliano",
      "timestamp": "00:10:35)",
      "timestamp_seconds": 0.0,
      "content": "And the organization gets more complex. I think Stripe... Gosh, in particular, it's just an extremely matrixed organization in business. Because every time you launch a product, you're having to think about, \"Well, how do we do this in other countries? There's different financial infrastructure. How do we think about the legal side, the compliance side, et cetera?\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:10:51)",
      "timestamp_seconds": 0.0,
      "content": "And I think PMs can really kind of bring that whole story together and make the whole machine move. In addition to understanding the customers, and the value prop,"
    },
    {
      "speaker": "and what the overall strategy was.\nLenny",
      "timestamp": "00:11:04)",
      "timestamp_seconds": 0.0,
      "content": "That's a really good reminder of, engineers and designers can do the work of a PM, but often they don't want to. There's a lot of non-fun parts to it. They're like, \"Oh, I wish we could have someone here do these things.\" And PMs enjoy that work. They're good at it. And so, eventually engineers and designers realize, \"Okay, I see why maybe we should hire a PM.\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:11:23)",
      "timestamp_seconds": 0.0,
      "content": "I say this often actually, to folks who are thinking about going into product management. \"That's awesome. Just be really, really sure about what you're signing up for.\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:11:33)",
      "timestamp_seconds": 0.0,
      "content": "It's kind of the same as, I think a lot of people want to become a manager. But just so you know, being a manager is like, \"Hey, you're doing performance reviews a lot. And you're in one-on-ones a lot.\" You have to really love that kind of work. And I think in the product management case, it's also like, you're constantly working across a lot of different teams. You're trying to influence a lot of people who don't report into you directly,"
    },
    {
      "speaker": "to do a bunch of stuff.\nEeke de Milliano",
      "timestamp": "00:11:54)",
      "timestamp_seconds": 0.0,
      "content": "And if you love that,"
    },
    {
      "speaker": "that's great. But you've got to be sure you know you're signing up for it.\nLenny",
      "timestamp": "00:12:00)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, that's a really good comparison. When I first became a manager, I was an engineer, actually. And I was managing engineers. And then, when I moved on to something as an IC engineer, again, I was like, \"I will never manage again. That was no fun at all. Why would I want to do this?\""
    },
    {
      "speaker": "Lenny",
      "timestamp": "00:12:12)",
      "timestamp_seconds": 0.0,
      "content": "And I imagine people get into product thinking they're going to have all this control, power, influence. And then they're like, \"Oh my God, this job is so freaking crazy. What did I sign up for?\""
    },
    {
      "speaker": "It's so hard.\nLenny",
      "timestamp": "00:12:23)",
      "timestamp_seconds": 0.0,
      "content": "Yeah. That reminds me, something that I heard you did at Stripe is, you wrote their internal culture guide. It was like a quick start guide to culture at Stripe,"
    },
    {
      "speaker": "that I think was maybe shared with early employees.\nLenny",
      "timestamp": "00:12:33)",
      "timestamp_seconds": 0.0,
      "content": "And if that's true, I'm curious what it is about Stripe's culture? If you could just briefly share just what makes Stripe so special. Clearly, it's one of the most successful companies in the world,"
    },
    {
      "speaker": "But it feels like Stripe has been incredibly successful and continues to innovate like crazy. Hires incredible people. People that are starting amazing companies.\nLenny",
      "timestamp": "00:12:56)",
      "timestamp_seconds": 0.0,
      "content": "So I guess back to my question, what is it that you think makes Stripe's culture unique and special?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:13:01)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, that quick guide to Stripe's culture. I think we wrote it, maybe when we were around 150"
    },
    {
      "speaker": "people or so. And we actually wrote it to share with candidates.\nEeke de Milliano",
      "timestamp": "00:13:10)",
      "timestamp_seconds": 0.0,
      "content": "Because the idea was like, \"Look, we're kind of opinionated about how we do things here. Most companies struggle to describe what their culture is. Like, how does a fish describe water? But it's worthwhile getting a sense of the things that we feel opinionated about, and that you might like or you might not like.\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:13:29)",
      "timestamp_seconds": 0.0,
      "content": "And actually, when we put out the guide, our metric of success was that, more of the right people would apply to Stripe and fewer of the wrong people. And there was a whole section in there, I was like, \"Hey, look, we work pretty hard here and that is certainly not for everyone. And hopefully you're excited to come and work really hard with colleagues who really care, and that's the reward.\" So,"
    },
    {
      "speaker": "that's maybe one example.\nEeke de Milliano",
      "timestamp": "00:13:56)",
      "timestamp_seconds": 0.0,
      "content": "On Stripe's culture and what's made it so successful. I've really been thinking a lot about, \"Were there one or two pivotal points or decisions for Stripe, that really set it on its path to success?\" And I don't think there are, actually. Every time I'm like, \"Well, if this hadn't happened...\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:14:16)",
      "timestamp_seconds": 0.0,
      "content": "I can always reason my way into, \"If these other things would've happened, Stripe would've kind of ended up in the same place.\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:14:24)",
      "timestamp_seconds": 0.0,
      "content": "So I think what Stripe was actually particularly good at... And by the way, you should take all this with a humongous grain of salt, because I haven't worked there since 2019. But, at least my experience when I was there, what Stripe was really good at was just making, not just one or two good decisions. It was making a lot of really good decisions all the time,"
    },
    {
      "speaker": "big or small.\nEeke de Milliano",
      "timestamp": "00:14:44)",
      "timestamp_seconds": 0.0,
      "content": "And that, I think, was quite cultural. There was this humongous respect and enthusiasm for thinking. It was such a part of the culture. One of the values was, think rigorously. Every meeting was very much like, \"Hey, how do we think about this thing from first principle?\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:15:03)",
      "timestamp_seconds": 0.0,
      "content": "No one would ever say, for example, \"It's a best practice to do X.\" People would be like, \"Well, why?\" You had to go a few levels deeper. So that was, I think,"
    },
    {
      "speaker": "one piece.\nEeke de Milliano",
      "timestamp": "00:15:14)",
      "timestamp_seconds": 0.0,
      "content": "The other piece... And a lot has been written about this already. Stripe had a very strong writing culture. All communication was along from writing business reviews, strategy memos,"
    },
    {
      "speaker": "product reviews. There was a lot of writing that happened.\nEeke de Milliano",
      "timestamp": "00:15:26)",
      "timestamp_seconds": 0.0,
      "content": "And I very strongly believe this. I don't think you can be a good writer, unless you're a clear thinker. And if you couldn't write well, I think it was actually pretty hard to be successful at Stripe, at least in the early days. So I think Stripe just cultivated a lot of really good writers, and by input into that,"
    },
    {
      "speaker": "a lot of really good thinkers.\nEeke de Milliano",
      "timestamp": "00:15:44)",
      "timestamp_seconds": 0.0,
      "content": "And then, I think the last thing that Stripe was really good at, was not overthinking decisions. Because that's kind of the flip side of this really rigorous approach, is that you lock yourself into a room and can't come out for five days. You have to be good at making a lot of decisions, and the right decisions,"
    },
    {
      "speaker": "quickly.\nEeke de Milliano",
      "timestamp": "00:16:01)",
      "timestamp_seconds": 0.0,
      "content": "And one of the things that we would always sort of kick around a lot was just the idea of, \"Is it a trapdoor decision?\""
    },
    {
      "speaker": "Which I think is an Amazon concept.\nLenny",
      "timestamp": "00:16:12)",
      "timestamp_seconds": 0.0,
      "content": "One-way door,"
    },
    {
      "speaker": "or two-way door.\nEeke de Milliano",
      "timestamp": "00:16:13)",
      "timestamp_seconds": 0.0,
      "content": "It's like, \"If you make this decision, is it one door, or is it two doors? Can you come back from this decision?\""
    },
    {
      "speaker": "And I thought Stripe was actually really good at being rigorous... Back to the rigorous point. About what actually was a trapdoor decision.\nEeke de Milliano",
      "timestamp": "00:16:22)",
      "timestamp_seconds": 0.0,
      "content": "So I think a lot of people, for example, think pricing is a trapdoor decision. But actually, it's really easy to grandfather your existing users into some existing pricing model and change pricing for future users. And if you believe that the product's going to be successful,"
    },
    {
      "speaker": "your early users are only going to be a fraction of that pricing model.\nEeke de Milliano",
      "timestamp": "00:16:41)",
      "timestamp_seconds": 0.0,
      "content": "And if the product's not successful, then Who cares if you change the pricing model? So I think that's a really good example of, people think that's a trapdoor decision,"
    },
    {
      "speaker": "but actually you can move much more quickly on that decision than you think.\nEeke de Milliano",
      "timestamp": "00:16:52)",
      "timestamp_seconds": 0.0,
      "content": "And then, a decision that definitely felt to us very much like a trapdoor decision, that I think Stripe took a long time being really rigorous about,"
    },
    {
      "speaker": "was titles. I think Stripe's kind of famous for not really having titles.\nEeke de Milliano",
      "timestamp": "00:17:03)",
      "timestamp_seconds": 0.0,
      "content": "And I think it was right to be rigorous around that decision, because once you've given someone a title,"
    },
    {
      "speaker": "you can't really take it away. So you better be sure about the title you want to give someone.\nLenny",
      "timestamp": "00:17:16)",
      "timestamp_seconds": 0.0,
      "content": "Yeah,"
    },
    {
      "speaker": "the titles are hilarious. I put together a career ladder doc of all company leveling names across all the big companies.\nEeke de Milliano",
      "timestamp": "00:17:26)",
      "timestamp_seconds": 0.0,
      "content": "Is everyone a lead, at Stripe?"
    },
    {
      "speaker": "Lenny",
      "timestamp": "00:17:26)",
      "timestamp_seconds": 0.0,
      "content": "And it's like, product manager, product manager, product manager, product manager... Yeah. And there's a lead here and there. Yeah, VPs are basically a product manager or a product leader,"
    },
    {
      "speaker": "Yep. Yeah.\nLenny",
      "timestamp": "00:17:37)",
      "timestamp_seconds": 0.0,
      "content": "Hilarious. You talked about this idea of first principles. People talk about that often as, \"We want to be first principle thinkers. We're going to think from first principles.\""
    },
    {
      "speaker": "Lenny",
      "timestamp": "00:17:47)",
      "timestamp_seconds": 0.0,
      "content": "How did Stripe actually operationalize that, implement that? Or was that just founder, top-down, continued questioning people, and that trickles down? Or is there anything else that they did to instill that mentality?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:17:57)",
      "timestamp_seconds": 0.0,
      "content": "I definitely think it's founder, top-down. They were really good about hiring people who thought that way, too. So it's just all that stuff. It just really,"
    },
    {
      "speaker": "really trickles.\nEeke de Milliano",
      "timestamp": "00:18:05)",
      "timestamp_seconds": 0.0,
      "content": "And actually, to this day, when I'm preparing a memo, or a board deck, or something. I imagine in my head, I'm like, \"What if I had to present this to Patrick?\" And my ideas just get so much better,"
    },
    {
      "speaker": "because I can sort of think about the questions they would ask.\nEeke de Milliano",
      "timestamp": "00:18:23)",
      "timestamp_seconds": 0.0,
      "content": "So, I think that was one. I think the other one was just sort of this writing culture piece. Once you start writing things down, you realize, \"Hey, that actually doesn't make a lot of sense.\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:18:33)",
      "timestamp_seconds": 0.0,
      "content": "And then, I think the third thing actually was, there was just always a lot of questioning about the status quo. So if something had been done in an industry for a long time, people would always be like, \"Well, why was it done that way?\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:18:46)",
      "timestamp_seconds": 0.0,
      "content": "And I think this is actually how Stripe got its start. I think when Stripe started, if you wanted to set up a merchant account, it could take weeks. And everyone just assumed that's what it took. And of course John and Patrick were like, \"Well, it doesn't actually make that much sense why it should take that long.\""
    },
    {
      "speaker": "Lenny",
      "timestamp": "00:19:00)",
      "timestamp_seconds": 0.0,
      "content": "You shared some of the values... I don't know if they're just called values, core values, at Stripe. But, is there other ones you can share? You said one is think rigorous, or don't overthink. What are the other values at Stripe?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:19:10)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, think rigorously was one. And I think they might have actually updated these on the website recently,"
    },
    {
      "speaker": "so my recollection is very likely out of date.\nEeke de Milliano",
      "timestamp": "00:19:19)",
      "timestamp_seconds": 0.0,
      "content": "And Stripe would call them operating principles, actually. Which, I think is actually better. Because values, you can't really tell people what to value. Everyone has their own value set. But you can tell people like, \"Hey, here's how we operate.\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:19:32)",
      "timestamp_seconds": 0.0,
      "content": "Another one that I loved was, move with urgency and focus. It was just really this idea that you're biggest compatriot and your biggest enemy as a startup, is time. So you have to move really, really,"
    },
    {
      "speaker": "really fast on it.\nEeke de Milliano",
      "timestamp": "00:19:48)",
      "timestamp_seconds": 0.0,
      "content": "Customers first, was the other one. Or, users first,"
    },
    {
      "speaker": "as Stripe would refer to customers as users. So those are some of my favorites.\nLenny",
      "timestamp": "00:19:56)",
      "timestamp_seconds": 0.0,
      "content": "When I think back to what made Airbnb special in a similar way, the values... We call them core values. I think were actually really, really important,"
    },
    {
      "speaker": "and turned the company into what it ended up being. And I was actually there around the time they created these values.\nEeke de Milliano",
      "timestamp": "00:20:08)",
      "timestamp_seconds": 0.0,
      "content": "Oh,"
    },
    {
      "speaker": "awesome.\nLenny",
      "timestamp": "00:20:09)",
      "timestamp_seconds": 0.0,
      "content": "I'm curious, at Stripe, do you have any recollection of how they came to these operating principles? Because, as I mentioned, founders are listening. \"How do I come up with these for our company?\""
    },
    {
      "speaker": "I'm pretty sure Patrick wrote them. Yeah. I think they came from... Patrick and John wrote them.\nEeke de Milliano",
      "timestamp": "00:20:26)",
      "timestamp_seconds": 0.0,
      "content": "Actually, the other value that I love... I don't think they have it anymore, but it was good, the operating principles. Micro pessimists,"
    },
    {
      "speaker": "Wow.\nEeke de Milliano",
      "timestamp": "00:20:34)",
      "timestamp_seconds": 0.0,
      "content": "Yeah. It was just this idea that, \"In the long term, we expect the curve to go up. We very much believe in the upward trajectory of just about everything. But on the day-to-day decisions, on the minutiae, we're quite critical. How do we make sure this thing works?\""
    },
    {
      "speaker": "And we'd think about all the ways in which it doesn't work.\nLenny",
      "timestamp": "00:20:53)",
      "timestamp_seconds": 0.0,
      "content": "So zooming out a little bit. We've been talking about Stripe. Retool also is a very first principles,"
    },
    {
      "speaker": "innovative company.\nLenny",
      "timestamp": "00:20:59)",
      "timestamp_seconds": 0.0,
      "content": "Something that I think of when I think of Retool is, during the wild market days of long ago, last year. I know Retool was very conservative in how they raised money, and the valuations they raised at. Which, looking back, ended up being a really good idea. While everyone's raising at $100 billion, I think their last round is a few billion. And it's a very reasonable,"
    },
    {
      "speaker": "conservative way to think about fundraising.\nLenny",
      "timestamp": "00:21:23)",
      "timestamp_seconds": 0.0,
      "content": "And so, I guess just thinking about innovation in general. Why do you think some teams are able to run innovation machines, continue to put out new products, disrupt industries, while other companies kind of plod along and stay conservative?"
    },
    {
      "speaker": "Lenny",
      "timestamp": "00:21:37)",
      "timestamp_seconds": 0.0,
      "content": "Is there anything you've seen, something you bring to teams you work on, to help foster innovation and big thinking?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:21:43)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, I actually think about the extremes of that question. So not, \"Why are some teams innovative?\" But, \"Why isn't every team innovative?\" I feel like no one wakes up in the morning and thinks, \"Yeah, today I want to work on boring, incremental stuff.\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:21:57)",
      "timestamp_seconds": 0.0,
      "content": "But, most teams do end up working on pretty incremental stuff. I always wonder, \"What is it that's stopping folks from being creative and thinking bigger?\" And I think it comes down to a couple of things that companies do sort of unwillingly,"
    },
    {
      "speaker": "or not even realizing it.\nEeke de Milliano",
      "timestamp": "00:22:14)",
      "timestamp_seconds": 0.0,
      "content": "And one is this fear of failure. I think leaders want the upside of innovation, but they're not really willing to deal with the cost of innovation. Which is like, \"Look, if you're going to swing big, you will invariably stumble sometimes.\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:22:29)",
      "timestamp_seconds": 0.0,
      "content": "So I think if you want to mitigate that, you have to start shining light on failure. That's really the only way. You have to start normalizing it a little bit. And obviously, if an individual, or if a team is consistently failing and not learning. That,"
    },
    {
      "speaker": "you need to deal with.\nEeke de Milliano",
      "timestamp": "00:22:46)",
      "timestamp_seconds": 0.0,
      "content": "But I think sometimes it's good to fail. And when you do fail,"
    },
    {
      "speaker": "use it as an opportunity. Don't squander that moment to not learn.\nEeke de Milliano",
      "timestamp": "00:22:57)",
      "timestamp_seconds": 0.0,
      "content": "But yeah, one example is, instead of calling something a postmortem, call it a retrospective, so that it's a positive thing. Like, \"Hey, we're learning from this thing.\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:23:07)",
      "timestamp_seconds": 0.0,
      "content": "And then, I think the other way to kind of mitigate the feeling of failure is, you have to figure out how to give folks more at BATS. Because obviously, anything that takes one year to ship, and you haven't gotten any customer feedback, the stakes of that are just going to feel so, so high. If you get it wrong,"
    },
    {
      "speaker": "it's going to be devastating. So you have to figure out how to lower the stakes.\nEeke de Milliano",
      "timestamp": "00:23:27)",
      "timestamp_seconds": 0.0,
      "content": "And honestly, I think in some ways it's kind of easy. It's like, \"Look, don't put too many resources against these bigger swings. Have them be small teams.\" And then also, just get customer feedback as quickly as possible. Don't wait until the thing is perfect. And that way,"
    },
    {
      "speaker": "you can limit the risk.\nEeke de Milliano",
      "timestamp": "00:23:44)",
      "timestamp_seconds": 0.0,
      "content": "So yeah, I think fear of failure,"
    },
    {
      "speaker": "that's definitely one thing that stops teams from being innovative.\nEeke de Milliano",
      "timestamp": "00:23:49)",
      "timestamp_seconds": 0.0,
      "content": "There's a very practical one. Sometimes teams are just getting bogged down by really urgent work. There's too much tech debt. There's too much product debt. Bugs, instability. It's a massive hierarchy of needs. There's just no way that they're going to be able to focus on the enlightened, bigger, creative stuff if they're just heads-down dealing with incidents all day. So if that's the case, yeah,"
    },
    {
      "speaker": "diagnose it and get your team out of that.\nEeke de Milliano",
      "timestamp": "00:24:18)",
      "timestamp_seconds": 0.0,
      "content": "And then, I think the last reason why teams aren't always that innovative is because, I think thinking big is really hard. And to some people it comes pretty naturally. But for most of us mortal souls, it's just really, really hard. And it takes time. And when you're at a startup and you're just grinding day-in, day-out,"
    },
    {
      "speaker": "you're treading water just trying to make it through the day.\nEeke de Milliano",
      "timestamp": "00:24:45)",
      "timestamp_seconds": 0.0,
      "content": "Taking the time to really think about the strategy, and where things should go, and get creative. It's pretty hard. So I call this... You have to give teams permission to think. So create these moments in your company culture, in your overall business processes, where you're asking people, you're literally saying, \"Hey, this is part of your job to think bigger.\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:25:09)",
      "timestamp_seconds": 0.0,
      "content": "So at Retool, we have these team charters and we do team planning. And at the bottom of every team charter we have a section called, Think Bigger. \"With 20% more time, what would you do that isn't on this list already?\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:25:21)",
      "timestamp_seconds": 0.0,
      "content": "And then another really neat tradition that we had at Stripe, and we have a Retool now, too. Is this thing called, Crazy Ideas. So at the beginning of every year,"
    },
    {
      "speaker": "David will send out a blank doc to the org and it's titled Crazy Ideas.\nEeke de Milliano",
      "timestamp": "00:25:39)",
      "timestamp_seconds": 0.0,
      "content": "And the Prompt is, \"Crazy ideas are ideas that we shouldn't, obviously, do. There's a 90% chance that they make no sense. But in the 10% chance that they do, they will make a 10x to 100x difference for the retail business.\" And then,"
    },
    {
      "speaker": "it's literally just a request for crazy ideas.\nEeke de Milliano",
      "timestamp": "00:25:57)",
      "timestamp_seconds": 0.0,
      "content": "And the org loves it. It's amazing. The energy around it is so cool. And it's not just product ideas, it's different ways of how we should run our organization. Or,"
    },
    {
      "speaker": "it's really cool marketing ideas in there.\nEeke de Milliano",
      "timestamp": "00:26:12)",
      "timestamp_seconds": 0.0,
      "content": "So, that doc is awesome. And whenever I have a down day,"
    },
    {
      "speaker": "I just scroll through that doc.\nLenny",
      "timestamp": "00:26:17)",
      "timestamp_seconds": 0.0,
      "content": "I know that you've launched three different products this year which I want to talk about,"
    },
    {
      "speaker": "which maybe came out of this big thinking. But a couple more questions just to dig into some of the stuff you just shared.\nLenny",
      "timestamp": "00:26:26)",
      "timestamp_seconds": 0.0,
      "content": "One is this big doc of awesome ideas. What's come out of that? Because I think of hackathons, and people have all this energy,"
    },
    {
      "speaker": "and it's exciting. And then they do all these cool things and they don't go anywhere.\nLenny",
      "timestamp": "00:26:35)",
      "timestamp_seconds": 0.0,
      "content": "Do things come out of this? Does it lead to actual ideas that people follow up on?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:26:38)",
      "timestamp_seconds": 0.0,
      "content": "Yeah. Yeah, yeah. So every year that we send out the doc, we look at the doc from the past year, and we're like, \"Okay, did we do anything on this list?\" And consistently,"
    },
    {
      "speaker": "Yeah.\nLenny",
      "timestamp": "00:26:51)",
      "timestamp_seconds": 0.0,
      "content": "Is there an example of a product that launched, that came from that list, that comes to mind?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:26:54)",
      "timestamp_seconds": 0.0,
      "content": "Actually, at least one, if not two of the three products that we launched this last year were on the crazy ideas list at one point. Like, a year ago, if you'd asked me, \"What is Retool's product?\" I would've told you, \"Retool helps you build internal frontends really, really fast.\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:27:09)",
      "timestamp_seconds": 0.0,
      "content": "But if you were trying to schedule a query to run at a later point in time, or have something trigger, or run an ETL task, you couldn't do that in Retool. So that was actually one of the crazy ideas. And that ended up becoming Retool Workflows, which we launched just last year,"
    },
    {
      "speaker": "in November.\nLenny",
      "timestamp": "00:27:28)",
      "timestamp_seconds": 0.0,
      "content": "Okay. We're definitely going to chat a bit about that. I want to go back to the two other suggestions you had. One is embrace failure, make it okay to fail. And then two is, don't let people get sucked into urgent stuff,"
    },
    {
      "speaker": "and have time to focus on important stuff.\nLenny",
      "timestamp": "00:27:42)",
      "timestamp_seconds": 0.0,
      "content": "Is there an example of just how to help people embrace failure? You talked about retrospectives. Is there anything else that you've found works, either as a tactic, as a process, as a framework, just to help people get out of that?"
    },
    {
      "speaker": "Lenny",
      "timestamp": "00:27:55)",
      "timestamp_seconds": 0.0,
      "content": "Because I hear that a lot, \"Embrace failure.\" And then people are like, \"Oh, but I failed and I suck.\" So yeah, is there anything else along those lines that you found effective to create that feeling?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:28:04)",
      "timestamp_seconds": 0.0,
      "content": "To me, it's always in the follow-ups. So have people talk about the failure in these sort of public forums, where usually you talk about the successes. So have someone actually write a note that's like, \"Hey, here are all my learnings from this thing that we did.\""
    },
    {
      "speaker": "And send it to the org.\nEeke de Milliano",
      "timestamp": "00:28:18)",
      "timestamp_seconds": 0.0,
      "content": "At Retool we have a shipped email list. If you ship something,"
    },
    {
      "speaker": "you'll always send to that.\nEeke de Milliano",
      "timestamp": "00:28:24)",
      "timestamp_seconds": 0.0,
      "content": "Have them send that email to the org. It's just an awesome way to celebrate. Or have them present it all-hands and share what they learned. And it almost always results in, I think,"
    },
    {
      "speaker": "a really positive twist.\nLenny",
      "timestamp": "00:28:38)",
      "timestamp_seconds": 0.0,
      "content": "At Airbnb, I think for a period,"
    },
    {
      "speaker": "there was an award for the biggest failure project and feature.\nEeke de Milliano",
      "timestamp": "00:28:42)",
      "timestamp_seconds": 0.0,
      "content": "Really?"
    },
    {
      "speaker": "That's so cool.\nLenny",
      "timestamp": "00:28:43)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, like a trophy or something. It was a short-lived idea,"
    },
    {
      "speaker": "but it was funny.\nEeke de Milliano",
      "timestamp": "00:28:47)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, yeah,"
    },
    {
      "speaker": "yeah.\nLenny",
      "timestamp": "00:28:48)",
      "timestamp_seconds": 0.0,
      "content": "And then, on the second bullet point of urgency, giving people a chance to think longer term. Is there anything there, that you found to be actually effective, to create that culture, and give PMs and product teams a chance to think longer term, and not just be stuck in the fires that they're dealing with?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:29:02)",
      "timestamp_seconds": 0.0,
      "content": "There's a couple of top-down things,"
    },
    {
      "speaker": "and a couple of bottom-up things.\nEeke de Milliano",
      "timestamp": "00:29:06)",
      "timestamp_seconds": 0.0,
      "content": "On the top-down, sometimes you just have to be willing to fund someone with something. Like, they come to you with an idea and you're like, \"Look, yeah, take an engineer and go do it.\""
    },
    {
      "speaker": "And you just have to give folks that sort of organizational buy-in.\nEeke de Milliano",
      "timestamp": "00:29:21)",
      "timestamp_seconds": 0.0,
      "content": "Actually, I was thinking back to that engineer, Brian Krausz at Stripe, who started poking around on this marketplace model. And I was thinking, I can't remember a moment when someone formally said to him, \"This is now your job.\" I think he just went and looked, and went and dug into it. And at some point, I think a manager was like, \"All right, this is now your job.\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:29:43)",
      "timestamp_seconds": 0.0,
      "content": "But yeah, no, I think you have to be able to fund folks' time and give that. Hackathons, I think,"
    },
    {
      "speaker": "are pretty good for that stuff. It is kind of a moment for folks to take a step back.\nEeke de Milliano",
      "timestamp": "00:29:55)",
      "timestamp_seconds": 0.0,
      "content": "And then, I think more than anything, in people's planning processes, I really like asking folks the 20% more time question. Or the other question was, \"Look, if you doubled the team today, what would you do?\""
    },
    {
      "speaker": "That shows up in our planning processes as well.\nEeke de Milliano",
      "timestamp": "00:30:08)",
      "timestamp_seconds": 0.0,
      "content": "And I think it really helps people kind of break out of this... I think you end up planning towards the team that you have and not the team that you should have. So,"
    },
    {
      "speaker": "that's how folks can break out of that process.\nLenny",
      "timestamp": "00:30:20)",
      "timestamp_seconds": 0.0,
      "content": "Awesome. I really like the think bigger bucket in your planning docs. Just like, \"What would you do if you had more resources?\" Maybe a quick question there. Is there a bunch of detail that you ask them to put into that, or is it just a bullet point of big ideas?"
    },
    {
      "speaker": "Folks can just go crazy on it. It's however they want to take it. I've seen folks actually create entire demos.\nEeke de Milliano",
      "timestamp": "00:30:40)",
      "timestamp_seconds": 0.0,
      "content": "But I actually think the trick is less structure, in those cases. Because you don't really want to sort of pigeonhole... Or make it even that intimidating for folks. If someone just wants to write down a few bullets,"
    },
    {
      "speaker": "that's great.\nLenny",
      "timestamp": "00:30:53)",
      "timestamp_seconds": 0.0,
      "content": "This episode is brought to you by Eppo. Eppo is a next-generation A/B testing platform, built by Airbnb alums for modern growth teams. Companies like Netlify,"
    },
    {
      "speaker": "Contentful and Cameo rely on Eppo to power their experiments.\nLenny",
      "timestamp": "00:31:07)",
      "timestamp_seconds": 0.0,
      "content": "Wherever you work, running experiments is increasingly essential, but there are no commercial tools that integrate with a modern growth team stack. This leads to a waste of time building internal tools,"
    },
    {
      "speaker": "or trying to run your experiments through a clunky marketing tool.\nLenny",
      "timestamp": "00:31:21)",
      "timestamp_seconds": 0.0,
      "content": "When I was at Airbnb, one of the things that I loved about our experimentation platform, was being able to easily slice results by device, by country, and by user stage. Eppo does all that and more. Delivering results quickly, avoiding annoying prolonged analytics cycles,"
    },
    {
      "speaker": "and helping you easily get to the root cause of any issue you discover.\nLenny",
      "timestamp": "00:31:41)",
      "timestamp_seconds": 0.0,
      "content": "Eppo lets you go beyond basic click-through metrics and instead, use their North Star metrics like activation, retention, subscriptions and payments. And Eppo supports tests on the frontend, the backend, email marketing,"
    },
    {
      "speaker": "and even machine learning clients.\nLenny",
      "timestamp": "00:31:55)",
      "timestamp_seconds": 0.0,
      "content": "Check out Eppo at GetEppo.com. Get E-P-P-O.com and 10"
    },
    {
      "speaker": "x your experiment velocity.\nLenny",
      "timestamp": "00:32:03)",
      "timestamp_seconds": 0.0,
      "content": "Okay, so you launched three new products this year. Usually,"
    },
    {
      "speaker": "companies are lucky to launch one product a year. A few questions.\nLenny",
      "timestamp": "00:32:11)",
      "timestamp_seconds": 0.0,
      "content": "One, just tell us what those three were, in case people are interested and want to check them out. Two is, was that a good idea? Is it good to launch three new products in a year?"
    },
    {
      "speaker": "Lenny",
      "timestamp": "00:32:19)",
      "timestamp_seconds": 0.0,
      "content": "And then three, what did you do organizationally, to allow for this to happen? Because that feels really ambitious and rare,"
    },
    {
      "speaker": "and I'm curious what you learned from that.\nEeke de Milliano",
      "timestamp": "00:32:28)",
      "timestamp_seconds": 0.0,
      "content": "So the three products we launched, one was Retool Workflows that I talked to you a little bit about. It's like, if you want to be able to, essentially create a workflow. Like schedule an alert, run a task, you can kind of do it in the Retool way. Where it's this visual, sort of easier builder of creating these different sort of workflows. But you can write your own code on top of it,"
    },
    {
      "speaker": "as well.\nEeke de Milliano",
      "timestamp": "00:32:50)",
      "timestamp_seconds": 0.0,
      "content": "The second product is Retool Mobile. So you could pretty easily build incredible web apps with Retool. But there are plenty of folks who don't sit behind their laptop at a desk all day. And for those folks... We had a lot of companies who were like, \"I want a mobile native app.\" And so,"
    },
    {
      "speaker": "we launched that product.\nEeke de Milliano",
      "timestamp": "00:33:09)",
      "timestamp_seconds": 0.0,
      "content": "And then the third product was Retool Database. So until very recently, if you came to Retool, you could connect your data via your APIs, your database,"
    },
    {
      "speaker": "directly into Retool.\nEeke de Milliano",
      "timestamp": "00:33:20)",
      "timestamp_seconds": 0.0,
      "content": "But what we found is that actually, a lot of folks either don't have access to their database,"
    },
    {
      "speaker": "or they're just trying to build an internal tool and they don't necessarily want to store that data in their production database.\nEeke de Milliano",
      "timestamp": "00:33:29)",
      "timestamp_seconds": 0.0,
      "content": "So we built... Essentially, we spin up a post [inaudible 00:33:32]"
    },
    {
      "speaker": "database for you. And you can just access it via a really nice UI and manage it directly in Retool.\nLenny",
      "timestamp": "00:33:38)",
      "timestamp_seconds": 0.0,
      "content": "Amazing. Okay,"
    },
    {
      "speaker": "back to the other two questions.\nEeke de Milliano",
      "timestamp": "00:33:42)",
      "timestamp_seconds": 0.0,
      "content": "Yes. Okay. So I think your second question was, \"Was this a good idea?\""
    },
    {
      "speaker": "Right.\nEeke de Milliano",
      "timestamp": "00:33:46)",
      "timestamp_seconds": 0.0,
      "content": "Yeah. You know what? I think in hindsight, if I were to do it again, I think sequencing it would've been slightly better. Just because, I think what we ended up doing is, we ended up launching the idea behind all three of these products at around the same time. And they all ended up maturing at around the same time, and that was just a lot of headspace from the org. Even though actually,"
    },
    {
      "speaker": "the teams themselves were not that big.\nEeke de Milliano",
      "timestamp": "00:34:18)",
      "timestamp_seconds": 0.0,
      "content": "It was just like, we had all these products and we were just waiting for them to launch and waiting for them to launch. Whereas, maybe if we'd sequenced it,"
    },
    {
      "speaker": "I think that would've felt more satisfying to the whole organization.\nEeke de Milliano",
      "timestamp": "00:34:28)",
      "timestamp_seconds": 0.0,
      "content": "But, I mean, it ended up working out. I think that's kind of the crazy thing. It's like,"
    },
    {
      "speaker": "we were able to pull off launching these three products.\nEeke de Milliano",
      "timestamp": "00:34:36)",
      "timestamp_seconds": 0.0,
      "content": "And by the way, I should caveat that, the further I get along my career, the more I realize I'm just kind of building on the shoulders of giants. And a lot of these ideas, et cetera,"
    },
    {
      "speaker": "were very much in the works and were happening before I came along.\nEeke de Milliano",
      "timestamp": "00:34:50)",
      "timestamp_seconds": 0.0,
      "content": "But yeah,"
    },
    {
      "speaker": "it was really neat to see how we got that all over the finish line in a year.\nLenny",
      "timestamp": "00:34:55)",
      "timestamp_seconds": 0.0,
      "content": "And then, the last question there is just, what do you think you did to allow for this? Because it's pretty rare you can build so much. And I know the team's not huge. How many people work at Retool, roughly?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:35:05)",
      "timestamp_seconds": 0.0,
      "content": "Today, we're around 300"
    },
    {
      "speaker": "people.\nLenny",
      "timestamp": "00:35:07)",
      "timestamp_seconds": 0.0,
      "content": "Yeah. So how do you structure an org to build three and launch... I didn't realize they launched around the same time. It's like, I'm picturing Elon Musk launching three rockets at once. How do you allow for that to happen?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:35:20)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, I'm sure our product marketing team felt that way. Yeah,"
    },
    {
      "speaker": "a couple of things. We started really small with all of these initiatives.\nEeke de Milliano",
      "timestamp": "00:35:30)",
      "timestamp_seconds": 0.0,
      "content": "So I think I mentioned, we really had one or two people working on each of these products for the first six months. So it was one engineer and one designer,"
    },
    {
      "speaker": "or one engineer and one PM. And they really didn't get funding until it was clear that there was something there.\nEeke de Milliano",
      "timestamp": "00:35:46)",
      "timestamp_seconds": 0.0,
      "content": "So those teams, they spent a ton of time with customers. They spent a ton of time building, a ton of time prototyping. And it was kind of the moment where it was like, \"Okay, they are there.\""
    },
    {
      "speaker": "That we started bringing more people onto the team.\nEeke de Milliano",
      "timestamp": "00:35:59)",
      "timestamp_seconds": 0.0,
      "content": "So, that was the first piece. The second piece is that, we really treated them like startups. We're like, Retool's the VC, and Retool funds with resources and Retool's existing customer base. Which is obviously quite valuable,"
    },
    {
      "speaker": "because you have all these customers you can market to and promote to.\nEeke de Milliano",
      "timestamp": "00:36:15)",
      "timestamp_seconds": 0.0,
      "content": "But then, the teams really had to prove that ROI. Either in engagement, or eventually revenue,"
    },
    {
      "speaker": "in order to be able to move forward.\nEeke de Milliano",
      "timestamp": "00:36:25)",
      "timestamp_seconds": 0.0,
      "content": "And then the third thing... And this one, actually I think it can be quite controversial. Is, we were really deliberate about keeping these teams separate from the rest of the org, especially early on. Now, a lot of them,"
    },
    {
      "speaker": "they're very much a part of the overall organizational processes.\nEeke de Milliano",
      "timestamp": "00:36:42)",
      "timestamp_seconds": 0.0,
      "content": "But very early on, they were running on their own. They were meeting quite independently with one, or two,"
    },
    {
      "speaker": "or three folks from the leadership team. And they were also just quite separate from the product itself.\nEeke de Milliano",
      "timestamp": "00:36:56)",
      "timestamp_seconds": 0.0,
      "content": "I think Retool Mobile's actually a really good example,"
    },
    {
      "speaker": "where we had a lot of debate about whether or not we should build Retool Mobile out of the core web app builder. Because a lot of the primitives are the same.\nEeke de Milliano",
      "timestamp": "00:37:09)",
      "timestamp_seconds": 0.0,
      "content": "And we eventually decided that we were going to run it as a separate team, because we wanted the team to be able to move really, really quickly. And we didn't want it to get bogged down in, what are just the realities of running a product that has product market fit, like bugs, yada, yada,"
    },
    {
      "speaker": "et cetera.\nEeke de Milliano",
      "timestamp": "00:37:24)",
      "timestamp_seconds": 0.0,
      "content": "And I think that was absolutely the right call, because Retool Mobile actually has quite a different target customer. Which, we only really realized maybe like halfway through the project. And I don't think we would've been able to really understand that, or even get broader in that kind of thinking,"
    },
    {
      "speaker": "had we sort of been stuck in the core retail product.\nEeke de Milliano",
      "timestamp": "00:37:43)",
      "timestamp_seconds": 0.0,
      "content": "But yeah, there was a cost to that, too. Which is like, \"Okay, now we have these two products, and we have to...\" I think obviously the strength will be, \"How do all these products interact with each other, and how do they build on top of each other?\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:37:52)",
      "timestamp_seconds": 0.0,
      "content": "So, we have to go and invest in that now. But I think it's totally worth it, because your team can just move more quickly, be more independent, and think more independently,"
    },
    {
      "speaker": "too.\nLenny",
      "timestamp": "00:38:00)",
      "timestamp_seconds": 0.0,
      "content": "In the time that you worked at Stripe and Retool... I know we chatted before we started recording. You think a lot about, \"What is the right level of process for companies at different stages?\""
    },
    {
      "speaker": "Lenny",
      "timestamp": "00:38:12)",
      "timestamp_seconds": 0.0,
      "content": "And I'd love to just hear your thoughts, because I know that's a challenge a lot of companies face. \"How much do we put in now? Do we get inspiration from big companies? Do we try to stay lean?\""
    },
    {
      "speaker": "Lenny",
      "timestamp": "00:38:22)",
      "timestamp_seconds": 0.0,
      "content": "Something here, that we actually run into. I'll just mention briefly that, there was a huge resistance to process for a long time. And so the product team was just kind of a little crazy for a bit. And then we were like, \"Okay, we need product development process. We need deadlines and specs.\""
    },
    {
      "speaker": "And that helped a lot.\nLenny",
      "timestamp": "00:38:40)",
      "timestamp_seconds": 0.0,
      "content": "So let me ask again, just how do you think about the right level of process for a stage of company, and what have you learned there?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:38:45)",
      "timestamp_seconds": 0.0,
      "content": "Yeah. What I would really love from companies is just sort of like this time capsule, where you can see what their processes were when they were like 20 people, and 50 people, and 100 people, and 500"
    },
    {
      "speaker": "people.\nEeke de Milliano",
      "timestamp": "00:38:55)",
      "timestamp_seconds": 0.0,
      "content": "Because when we were at Stripe and we were trying to figure out our planning process, we actually talked to Amazon, and Atlassian, and Apple, and all these companies that we really,"
    },
    {
      "speaker": "really respect and look up to.\nEeke de Milliano",
      "timestamp": "00:39:07)",
      "timestamp_seconds": 0.0,
      "content": "And I remember taking down notes from these companies and being like, \"Yeah, this is awesome, but there's no way that this will work for Stripe.\""
    },
    {
      "speaker": "Stripe was so much smaller than any of these companies.\nEeke de Milliano",
      "timestamp": "00:39:17)",
      "timestamp_seconds": 0.0,
      "content": "So yeah, they were showing us where we had to go, but no idea how to get there. And so, yeah, Lenny,"
    },
    {
      "speaker": "maybe you can help us figure out time capsules for companies and what processes make sense.\nLenny",
      "timestamp": "00:39:27)",
      "timestamp_seconds": 0.0,
      "content": "Yeah. I am working on that,"
    },
    {
      "speaker": "roughly.\nEeke de Milliano",
      "timestamp": "00:39:28)",
      "timestamp_seconds": 0.0,
      "content": "Oh,"
    },
    {
      "speaker": "nice.\nLenny",
      "timestamp": "00:39:30)",
      "timestamp_seconds": 0.0,
      "content": "I'm going company by company,"
    },
    {
      "speaker": "about how they think process and about process. And then maybe I'll check in every couple of years.\nEeke de Milliano",
      "timestamp": "00:39:36)",
      "timestamp_seconds": 0.0,
      "content": "Cool. I love that. But yeah, to answer your question directly. Process... Yeah, it really gives people a bitter taste in their mouth,"
    },
    {
      "speaker": "I think.\nEeke de Milliano",
      "timestamp": "00:39:47)",
      "timestamp_seconds": 0.0,
      "content": "Process, by definition, is variance reducing. You're introducing it,"
    },
    {
      "speaker": "because you worry that the variance in your org is too high. You want people to sort of meet a certain standard.\nEeke de Milliano",
      "timestamp": "00:40:00)",
      "timestamp_seconds": 0.0,
      "content": "And the cost of that is obviously, while you are reducing the standard and bringing folks up to the average, you're also bringing other folks down to the average. And oftentimes, the folks you're bringing down are your highest performers, your most creative thinkers. The folks who,"
    },
    {
      "speaker": "I think actually don't really need process to do their best work.\nEeke de Milliano",
      "timestamp": "00:40:21)",
      "timestamp_seconds": 0.0,
      "content": "And so, that, I think is always the tension that you have with process. And obviously one of the reasons why companies introduce process much more and more, as companies get bigger,"
    },
    {
      "speaker": "is because it's harder to get all these folks who don't need processing. You actually want to reduce the variance.\nEeke de Milliano",
      "timestamp": "00:40:38)",
      "timestamp_seconds": 0.0,
      "content": "This is actually a little bit of an aside, but it's kind of relevant,"
    },
    {
      "speaker": "Let's get into it.\nEeke de Milliano",
      "timestamp": "00:40:47)",
      "timestamp_seconds": 0.0,
      "content": "But, I was just listening to this awesome podcast with Russ Roberts,"
    },
    {
      "speaker": "who's a professor. He hosts EconTalk. I don't know if you listen to it.\nEeke de Milliano",
      "timestamp": "00:40:56)",
      "timestamp_seconds": 0.0,
      "content": "And he was in interviewing this guy, Ian Leslie, who's this great writer and has just written this article that's... Basically,"
    },
    {
      "speaker": "something along the lines of what it means to be human in the age of AI.\nEeke de Milliano",
      "timestamp": "00:41:07)",
      "timestamp_seconds": 0.0,
      "content": "And I thought he just articulated this idea well. Which is, we're all really so impressed when we see ChatGPT-3"
    },
    {
      "speaker": "spit out this piece of writing that feels very human-like.\nEeke de Milliano",
      "timestamp": "00:41:20)",
      "timestamp_seconds": 0.0,
      "content": "But what we're kind of forgetting is that, over the last 10, 20, 30 years, we're actually asking humans to be a lot more robot-like. In that, we're really asking everyone to standardize in a lot of ways. And we're making people a lot more formulaic. If you think about how we teach people to write, it's like, \"Well, there's five paragraphs. And there's your opening paragraph. And you state your topic.\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:41:43)",
      "timestamp_seconds": 0.0,
      "content": "So anyway, I think the point is, the more formulaic, the more sort of mass produced you're trying to make something. The more you kind of quench people's creativity, and the further away you get from the really, really high highs. And that, to me, is the cost of process, and rules,"
    },
    {
      "speaker": "and templates.\nEeke de Milliano",
      "timestamp": "00:42:05)",
      "timestamp_seconds": 0.0,
      "content": "So if you're going to introduce it, be really,"
    },
    {
      "speaker": "really sure that you're okay with that cost. And give folks escape hatches.\nEeke de Milliano",
      "timestamp": "00:42:13)",
      "timestamp_seconds": 0.0,
      "content": "So I've started referring to this as the MVP, the minimum viable process. So if I give folks a template, I'm like, \"Look, use the template. But if you want to break out of it, please absolutely do.\""
    },
    {
      "speaker": "And I've started writing this at the top of templates now.\nEeke de Milliano",
      "timestamp": "00:42:26)",
      "timestamp_seconds": 0.0,
      "content": "It's like, \"If this doesn't work for what you're trying to explain, don't use it. But just know that this is the minimum viable thing. We're setting the bar here, but go higher if you can, please.\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:42:38)",
      "timestamp_seconds": 0.0,
      "content": "So anyway, that's my sort of long drive on process. With all that said, I do think that companies, there's just a set of documents that are really,"
    },
    {
      "speaker": "really viable. That every sort of level of the organization should have throughout its lifecycle.\nEeke de Milliano",
      "timestamp": "00:42:54)",
      "timestamp_seconds": 0.0,
      "content": "And then, I think how sort of involved it is,"
    },
    {
      "speaker": "or how long term it is really depends on how big you are.\nEeke de Milliano",
      "timestamp": "00:43:00)",
      "timestamp_seconds": 0.0,
      "content": "But those documents, to me, are the charter. So, \"What is your mission, your vision and your strategy?\" The goals, \"What are you aiming to do and how are you going to measure success?\" And then the roadmap, \"What is the thing that you're shipping?\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:43:15)",
      "timestamp_seconds": 0.0,
      "content": "And I think the whole company needs these, the whole function. So in product, you need all three of these. And then,"
    },
    {
      "speaker": "within each team you need all three of these.\nEeke de Milliano",
      "timestamp": "00:43:26)",
      "timestamp_seconds": 0.0,
      "content": "And I've kind of noticed two things about this framework for myself. One, I've actually noticed that teams often work their way from the bottom-up, versus top-down. They start with a roadmap. They're like, \"What are all the things we're going to ship?\" Especially early on. And then they kind of work their way into a charter. But I think it's really,"
    },
    {
      "speaker": "really worth it to start from the top-down.\nEeke de Milliano",
      "timestamp": "00:43:47)",
      "timestamp_seconds": 0.0,
      "content": "And then, the second thing that I've noticed is that your time horizon really shifts as you get more mature. So if you're very early on, you don't have PMF, you should have a charter,"
    },
    {
      "speaker": "but your charter should be like three months in the future. Because you can't look that much further.\nEeke de Milliano",
      "timestamp": "00:44:01)",
      "timestamp_seconds": 0.0,
      "content": "And if you're a company that's humming and going,"
    },
    {
      "speaker": "your charter is probably... The horizon's maybe a decade.\nLenny",
      "timestamp": "00:44:11)",
      "timestamp_seconds": 0.0,
      "content": "Wow. There is so much there. I could go into so many different directions. One thing I wanted to follow up on a little bit,"
    },
    {
      "speaker": "is this idea... Such a great point. That process brings the best people down and kind of averages them out to create consistency.\nLenny",
      "timestamp": "00:44:28)",
      "timestamp_seconds": 0.0,
      "content": "And I'm curious if there's anything else you've seen succeed in allowing the best and most innovative brains to just do their thing. I know part of it is probably hiring amazing people. But yeah, is there anything else that's an escape hatch of just like, \"Oh yeah, this person, just go. Go figure this out.\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:44:45)",
      "timestamp_seconds": 0.0,
      "content": "To me, the unlock for organizations is managers, for this. Because you need managers to both detect the high performers and be like, \"This person doesn't need the process.\" And then you need managers to give that person air cover to be like, \"We're honestly...\" Because what you're doing is,"
    },
    {
      "speaker": "you're giving them some special treatment and you need to be kind of okay with that.\nEeke de Milliano",
      "timestamp": "00:45:02)",
      "timestamp_seconds": 0.0,
      "content": "And you also need to be okay with the organizational cost for that. Claire, who used to be the COO of Stripe, would always say, \"Are you willing to break the org for this person?\" And I always thought that was a really nice framing. And you kind of need to decide who you want to do it for,"
    },
    {
      "speaker": "too.\nEeke de Milliano",
      "timestamp": "00:45:17)",
      "timestamp_seconds": 0.0,
      "content": "But yeah, some people are just that good that like, \"Yeah, of course you'll break the org for them.\""
    },
    {
      "speaker": "They're going to break the org in the best way possible.\nLenny",
      "timestamp": "00:45:27)",
      "timestamp_seconds": 0.0,
      "content": "Yeah. I love that term. I think Claire's coming on this podcast. She just wrote a book, right? Is that the same person?"
    },
    {
      "speaker": "Yeah.\nLenny",
      "timestamp": "00:45:30)",
      "timestamp_seconds": 0.0,
      "content": "Okay,"
    },
    {
      "speaker": "great.\nEeke de Milliano",
      "timestamp": "00:45:30)",
      "timestamp_seconds": 0.0,
      "content": "Yeah,"
    },
    {
      "speaker": "she just wrote a book. Yep.\nLenny",
      "timestamp": "00:45:33)",
      "timestamp_seconds": 0.0,
      "content": "All right, we just booked her. Come,"
    },
    {
      "speaker": "That's awesome.\nLenny",
      "timestamp": "00:45:37)",
      "timestamp_seconds": 0.0,
      "content": "Do you have any other product building philosophies that you found especially useful in your time at Stripe, and Retool, and anywhere else?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:45:45)",
      "timestamp_seconds": 0.0,
      "content": "I have a couple of, I guess, specific mental models that I use. The first is, build for your best user,"
    },
    {
      "speaker": "not your worst user.\nEeke de Milliano",
      "timestamp": "00:45:53)",
      "timestamp_seconds": 0.0,
      "content": "And what I mean by that is, I think it's actually really easy to get stuck, or to focus on, \"What if there's abuse of this product?\""
    },
    {
      "speaker": "Or think about all the ways in which the product won't be used well. And then you end up sort of shaping the product in these really weird funky ways to make up for that.\nEeke de Milliano",
      "timestamp": "00:46:11)",
      "timestamp_seconds": 0.0,
      "content": "Whereas in reality, the worst users,"
    },
    {
      "speaker": "they should be a fraction of your users anyway. So you shouldn't really be building for them.\nEeke de Milliano",
      "timestamp": "00:46:19)",
      "timestamp_seconds": 0.0,
      "content": "I think a really good example of this is onboarding processes. Where, you're probably going to be building an onboarding process, where you're trying to collect a lot of data. Or trying to figure out, \"Hey, how do I help this user who maybe isn't well suited for my product to be successful?\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:46:37)",
      "timestamp_seconds": 0.0,
      "content": "Really,"
    },
    {
      "speaker": "you should just be building an onboarding process for the user who's going to jump into your product and get it immediately.\nEeke de Milliano",
      "timestamp": "00:46:42)",
      "timestamp_seconds": 0.0,
      "content": "I was thinking about this actually just the other day. Because we were in this product review,"
    },
    {
      "speaker": "and we were talking about this other new product that we're thinking of exploring.\nLenny",
      "timestamp": "00:46:48)",
      "timestamp_seconds": 0.0,
      "content": "More products?"
    },
    {
      "speaker": "It never ends.\nEeke de Milliano",
      "timestamp": "00:46:52)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, exactly. And we're kind of going down this path of like, \"Oh, well if this gets really big, there's going to be all this abuse of the product.\" And Anthony, our founder was like, \"Wouldn't that be an amazing problem to have?\" And we're like, \"Yeah, that's a really good point.\""
    },
    {
      "speaker": "So we kind of put that on the back burner.\nLenny",
      "timestamp": "00:47:07)",
      "timestamp_seconds": 0.0,
      "content": "That's an interesting approach, because usually you're trying to optimize a flow, get more people through it,"
    },
    {
      "speaker": "which are the least good users.You're saying you found more success just focusing...\nLenny",
      "timestamp": "00:47:16)",
      "timestamp_seconds": 0.0,
      "content": "Is this more initially, focus on the users that will understand this, and be excited about it, and make that work really well. And then, over time, build on that?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:47:23)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, totally. Yeah, sure. If you're going to look at the end, and you're trying to optimize, et cetera, absolutely. But in that sort of early product development stage,"
    },
    {
      "speaker": "Got it. Sweet.\nEeke de Milliano",
      "timestamp": "00:47:34)",
      "timestamp_seconds": 0.0,
      "content": "So, that's one. The other one, our head of design, Ryan, always kind of reminds us of is, build the scooter,"
    },
    {
      "speaker": "not the axle.\nEeke de Milliano",
      "timestamp": "00:47:44)",
      "timestamp_seconds": 0.0,
      "content": "So if you're trying to build the minimum viable product for a car, don't build just the wheels and the axle, build the scooter first. And then from there, you build the bicycle, and the motorcycle,"
    },
    {
      "speaker": "And it's always just such a good reminder. You always want to start building the whole thing. But really try and think about the slice that gets the customer to complete value on a smaller thing first.\nEeke de Milliano",
      "timestamp": "00:48:06)",
      "timestamp_seconds": 0.0,
      "content": "So with Retool Mobile for example, there's just so much you could be building there. And we decided very specifically, \"Hey, we're only going to build this for companies that have field workers and they would need to do inventory management.\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:48:18)",
      "timestamp_seconds": 0.0,
      "content": "And it's a very specific slice, but it helps get through from something that was actually viable,"
    },
    {
      "speaker": "beginning to end.\nLenny",
      "timestamp": "00:48:25)",
      "timestamp_seconds": 0.0,
      "content": "Got it. So it's an approach for MVPs, basically. Make something simple and functional, not just something barely... Not actually working,"
    },
    {
      "speaker": "but getting you to some dream product eventually.\nEeke de Milliano",
      "timestamp": "00:48:37)",
      "timestamp_seconds": 0.0,
      "content": "Yeah. And then the last one is this idea of 70/20/10"
    },
    {
      "speaker": "split investments. I really think that a lot of product management can sometimes be reduced to funnels and portfolios.\nEeke de Milliano",
      "timestamp": "00:48:51)",
      "timestamp_seconds": 0.0,
      "content": "So the 70/20/10 investments model in my head is just like, 70% of your building time should really be going to your core product, that has product market fit. 20% of your time should be going to strategic initiatives that aren't core, but they're strategic to the company, that you know have to do them. And then, 10%"
    },
    {
      "speaker": "of your time should be going towards bets.\nLenny",
      "timestamp": "00:49:11)",
      "timestamp_seconds": 0.0,
      "content": "That's actually exactly the same heuristic I've always used. One question there is, how do you think about maintenance and bugs within that?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:49:19)",
      "timestamp_seconds": 0.0,
      "content": "Yeah. To me, that falls squarely in the 70%. So yeah, core product, tech debt, sort of the maintenance mode type stuff. And core product,"
    },
    {
      "speaker": "obviously you're also doing a bunch of new stuff there too.\nEeke de Milliano",
      "timestamp": "00:49:31)",
      "timestamp_seconds": 0.0,
      "content": "But yeah, no more than 70%"
    },
    {
      "speaker": "of your resources should be going there.\nLenny",
      "timestamp": "00:49:35)",
      "timestamp_seconds": 0.0,
      "content": "What did you say the 20% was?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:49:37)",
      "timestamp_seconds": 0.0,
      "content": "Strategic initiatives that aren't your core, but you just know, based on your strategy,"
    },
    {
      "speaker": "you have to do these things.\nLenny",
      "timestamp": "00:49:45)",
      "timestamp_seconds": 0.0,
      "content": "Got it. So the way I break it up is, 20% is where I put bugs and maintenance. And then 10% was big, ambitious bets. So it was similar ratios,"
    },
    {
      "speaker": "Cool.\nLenny",
      "timestamp": "00:49:57)",
      "timestamp_seconds": 0.0,
      "content": "But, let me ask a similar question. How do you, at Retool, and maybe even at Stripe, think about finding time to do maintenance and bugs? Do you build it into roadmaps? Do you set off time to just fix all the bugs? I know it's probably an evolution, and it goes back and forth. But, any thoughts?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:50:11)",
      "timestamp_seconds": 0.0,
      "content": "Yeah. This, I think, is really one of the trickiest parts of product management,"
    },
    {
      "speaker": "in my mind.\nEeke de Milliano",
      "timestamp": "00:50:18)",
      "timestamp_seconds": 0.0,
      "content": "We don't have a company-wide sort of process on this. It's pretty team specific. Some teams do Friday bug bashes. Other teams are just, as products roll out,"
    },
    {
      "speaker": "will work on them as they go.\nEeke de Milliano",
      "timestamp": "00:50:33)",
      "timestamp_seconds": 0.0,
      "content": "I was actually speaking to a product manager at a different company, who mentioned that they just spent the last 18 months doing just product polish and bugs. And I think they landed in a place where they had to do it, because they just had so much debt. But luckily,"
    },
    {
      "speaker": "we're not there yet.\nEeke de Milliano",
      "timestamp": "00:50:54)",
      "timestamp_seconds": 0.0,
      "content": "Right now,"
    },
    {
      "speaker": "we let most of the teams just kind of do it themselves and figure out what makes sense for them.\nLenny",
      "timestamp": "00:50:59)",
      "timestamp_seconds": 0.0,
      "content": "Okay. Awesome. I wanted to go back to something that I've heard about Retool, that you all are really good at. Which is PM's being really close to customers. And I'm curious what you've done there, or what the team has done there, that it's been really effective?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:51:13)",
      "timestamp_seconds": 0.0,
      "content": "Well, I do think every good product team figures out how to get close to customers. But just based off of my observations from Retool, and what I've seen at other companies,"
    },
    {
      "speaker": "there are a couple things that are more pronounced at Retool than I've seen in a lot of other places.\nEeke de Milliano",
      "timestamp": "00:51:28)",
      "timestamp_seconds": 0.0,
      "content": "The first is, we have a lot of PMs who used to be in customer-facing roles, at Retool. I obviously am a big fan of that. I think there's just nothing like really understanding the value of your product, at the moment where a customer actually has to put money down. And so, I really like that about PMs,"
    },
    {
      "speaker": "who have had those conversations with customers and they really get it.\nEeke de Milliano",
      "timestamp": "00:51:53)",
      "timestamp_seconds": 0.0,
      "content": "Second is, because the retail product is so technical... And I do think this just depends on what product you have. Our PMs are really, very technical. Everyone has either a CS degree,"
    },
    {
      "speaker": "or has done some sort of engineering in the past.\nEeke de Milliano",
      "timestamp": "00:52:06)",
      "timestamp_seconds": 0.0,
      "content": "Third is, we use Slack very heavily to talk to our customers and interact with them. So at this point, I think we have hundreds of Slack channels with customers. Every time we're testing a new product, or a new customer who's somewhat large, comes online. We will work with them in Slack, to get there off-the-cuff feedback, just back and forth. It's really nice. We just have this direct line to them,"
    },
    {
      "speaker": "which is awesome.\nEeke de Milliano",
      "timestamp": "00:52:34)",
      "timestamp_seconds": 0.0,
      "content": "And then, the fourth thing we do is, we use Retool to build Retool. So our product roadmap lives in a Retool app. And the app that we use to have feature flags for particular features, is a Retool app. So PMs are just in the product all day long, every day. They're their own customers in a lot of ways,"
    },
    {
      "speaker": "and that really helps as well.\nLenny",
      "timestamp": "00:52:57)",
      "timestamp_seconds": 0.0,
      "content": "Wow, I didn't know that. That is very cool. So you build a task management product using Retool?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:53:03)",
      "timestamp_seconds": 0.0,
      "content": "Oh, yeah. Well, we built many... Basically, all of our internal tooling happens in Retool. Like, our PMs, all their team dashboards are in Retool. All of their task tracking is in Retool. Submitting linear requests or bug requests happens in Retool, and then goes to Linear. So yeah,"
    },
    {
      "speaker": "it's how we run the company.\nLenny",
      "timestamp": "00:53:23)",
      "timestamp_seconds": 0.0,
      "content": "You haven't been able to replace Linear yet?"
    },
    {
      "speaker": "That's cool. I'm a big fan of Linear.\nLenny",
      "timestamp": "00:53:29)",
      "timestamp_seconds": 0.0,
      "content": "Okay, two more questions and then I'll let you go. One is around product growth. Which,"
    },
    {
      "speaker": "I don't want to get too into. We've talked about it a bunch on this podcast.\nLenny",
      "timestamp": "00:53:37)",
      "timestamp_seconds": 0.0,
      "content": "But, it's interesting that Stripe was very product-led growth. It was just self-serve PMs, engineers, whoever,"
    },
    {
      "speaker": "just started using it. It grew and became enterprisey down the road.\nLenny",
      "timestamp": "00:53:49)",
      "timestamp_seconds": 0.0,
      "content": "Retool, on the other hand, I think people think it's product-led growth. I imagine it's actually sales-led,"
    },
    {
      "speaker": "mostly.\nLenny",
      "timestamp": "00:53:54)",
      "timestamp_seconds": 0.0,
      "content": "And so, I'm just curious what you've learned about the difference between building product and leading product teams within a sales-led org,"
    },
    {
      "speaker": "versus a product-led org.\nEeke de Milliano",
      "timestamp": "00:54:04)",
      "timestamp_seconds": 0.0,
      "content": "I have a couple of insights on that. One interesting insight is that,"
    },
    {
      "speaker": "That's so true.\nEeke de Milliano",
      "timestamp": "00:54:12)",
      "timestamp_seconds": 0.0,
      "content": "Whenever I talk to candidates, I feel like you can always tell what their company has, because they'll be asking a lot of questions about the opposite. If they're probably a growth company they'll be like, \"Well, how are you guys thinking about Enterprise?\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:54:24)",
      "timestamp_seconds": 0.0,
      "content": "And then, if they are more of a sales-led growth company, they're like, \"Well, how are you guys thinking about your self-serve motion, or your product-led growth?\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:54:31)",
      "timestamp_seconds": 0.0,
      "content": "And my main takeaway, just in... And I don't know if I would even use the dichotomy of product-led growth, or sales-led growth, with Retool. I think we do have a lot of product-led growth. But we work with a lot of enterprise customers, and a lot of our revenue comes from enterprise customers,"
    },
    {
      "speaker": "and we have a fantastic sales team.\nEeke de Milliano",
      "timestamp": "00:54:49)",
      "timestamp_seconds": 0.0,
      "content": "And I think the main thing is that, you just have to really figure out your interaction mechanisms with sales. And that just has to be so,"
    },
    {
      "speaker": "so tight.\nEeke de Milliano",
      "timestamp": "00:55:00)",
      "timestamp_seconds": 0.0,
      "content": "And it goes in both directions. There's obviously, how you get feedback from them, because they are so often on the front lines talking to customers. Moreso than product managers,"
    },
    {
      "speaker": "even.\nEeke de Milliano",
      "timestamp": "00:55:08)",
      "timestamp_seconds": 0.0,
      "content": "But it also goes the other way. If you are going to ship something, or if you are going to put out a roadmap, like, \"How do you make sure that the sales team has everything that they need...\" The sales, and in Retool's case, the success team and the support team, \"Has everything they need to accurately talk to customers about that?\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:55:26)",
      "timestamp_seconds": 0.0,
      "content": "And I've always actually found that really hard, because it's really hard to figure out the right altitude. If you're giving a presentation on the roadmap, people are either going to feel like it's too high level. Or,"
    },
    {
      "speaker": "it's too low level for folks who maybe are new.\nEeke de Milliano",
      "timestamp": "00:55:40)",
      "timestamp_seconds": 0.0,
      "content": "So this year, we're actually trying something different. We are doing a science fair. Where, each product team has a little booth. And they get to stand there, and anyone who has questions about the product can come... You know, from the go-to-market side, can come and ask questions, and get demos,"
    },
    {
      "speaker": "and go as deep as they need to.\nEeke de Milliano",
      "timestamp": "00:55:57)",
      "timestamp_seconds": 0.0,
      "content": "So,"
    },
    {
      "speaker": "I'll let you know how that goes. But I'm excited to experiment with it.\nLenny",
      "timestamp": "00:56:04)",
      "timestamp_seconds": 0.0,
      "content": "Okay. Are there going to be foam core boards, and will there be ribbons?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:56:08)",
      "timestamp_seconds": 0.0,
      "content": "There may be prizes. Who knows?"
    },
    {
      "speaker": "Lenny",
      "timestamp": "00:56:10)",
      "timestamp_seconds": 0.0,
      "content": "Oh my God. I can't wait to see a picture of this. Final topic. You have this concept that you call the product talent portfolio. What does that mean, and how have you found that useful in your product leadership life?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:56:25)",
      "timestamp_seconds": 0.0,
      "content": "Yeah. Yeah, it's back to like,"
    },
    {
      "speaker": "all of product management is portfolios and funnels.\nEeke de Milliano",
      "timestamp": "00:56:29)",
      "timestamp_seconds": 0.0,
      "content": "I think it's really tempting as a manager, to build a team in your image,"
    },
    {
      "speaker": "because you understand their skillsets and you value those skillsets. And you're going to be able to detect and assess those skillsets better.\nEeke de Milliano",
      "timestamp": "00:56:43)",
      "timestamp_seconds": 0.0,
      "content": "But the best product teams, in my mind, have really figured out how to balance the talent portfolio. So instead of having a bunch of PMs who all spike in one particular area, figure out how you can create complimentary skillsets for the whole PM team,"
    },
    {
      "speaker": "so the whole is much stronger.\nEeke de Milliano",
      "timestamp": "00:57:04)",
      "timestamp_seconds": 0.0,
      "content": "And one way in which I like to do that is, I really like to balance product teams with homegrown product managers, who really get the product. They've probably been in it. They're amazing culture carriers, often. They really set the tone. But they may not have seen product management at other companies,"
    },
    {
      "speaker": "and they may not have some of the more conventional and traditional product management skillsets.\nEeke de Milliano",
      "timestamp": "00:57:25)",
      "timestamp_seconds": 0.0,
      "content": "So I want to balance that with product managers who've come from other companies, and have done it, and can bring a little bit more of that product manager rigor. Even though they don't have, in the Retool case,"
    },
    {
      "speaker": "the core Retool product management vibe.\nEeke de Milliano",
      "timestamp": "00:57:41)",
      "timestamp_seconds": 0.0,
      "content": "So,"
    },
    {
      "speaker": "that's one example. I think there's others as well. Some PMs are just incredible execution machines. Other PMs are amazing visionaries. You kind of want a little bit of all of them.\nEeke de Milliano",
      "timestamp": "00:57:51)",
      "timestamp_seconds": 0.0,
      "content": "And you want to also balance within all of your different pillars. So we have three different sort of product pillars at Retool, and there's leads for all those pillars. And I always push the leads to hire people who don't look like them,"
    },
    {
      "speaker": "so that we have balance everywhere.\nLenny",
      "timestamp": "00:58:08)",
      "timestamp_seconds": 0.0,
      "content": "I love that. Do you, actively, as you're hiring, \"Hey, well you're strong in these areas. Here's the person we need, here. We want this specific, super strategy minded person.\" Is that actually how you think about this?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:58:20)",
      "timestamp_seconds": 0.0,
      "content": "Yeah. I do a little personal exercise for myself every six months, where I chart out the team that we have today, and write down all of the strengths that we have, all of the weaknesses that we have,"
    },
    {
      "speaker": "as a team. And then I try to hire specifically for those weaknesses.\nLenny",
      "timestamp": "00:58:35)",
      "timestamp_seconds": 0.0,
      "content": "Amazing. Any last pieces of wisdom or thoughts, before we get to our very exciting lightning round?"
    },
    {
      "speaker": "Okay. We got through everything I was hoping to get through.\nLenny",
      "timestamp": "00:58:46)",
      "timestamp_seconds": 0.0,
      "content": "So with that, we've reached our very exciting lightning round. I've got six questions for you. Are you ready?"
    },
    {
      "speaker": "I'm ready.\nLenny",
      "timestamp": "00:58:53)",
      "timestamp_seconds": 0.0,
      "content": "What are two or three books that you recommend most, to other people?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:58:57)",
      "timestamp_seconds": 0.0,
      "content": "Bird by Bird: Instructions on Writing and Life by Anne Lamott. It's incredible. So touching. Really, really great. Also, I think product managers should be great writers. So,"
    },
    {
      "speaker": "I love that.\nEeke de Milliano",
      "timestamp": "00:59:08)",
      "timestamp_seconds": 0.0,
      "content": "And then the other book that I was going to say, but I'm glad you mentioned Claire, is Claire's book, Scaling People, which is coming out. I had a very small hand in ghost writing for her a little bit, in the first draft. So I use a lot of the early chapters from that book still, in management. And I still recommend the tactics in there,"
    },
    {
      "speaker": "so I'm excited for her to get it out.\nLenny",
      "timestamp": "00:59:29)",
      "timestamp_seconds": 0.0,
      "content": "Wow. I've been hearing about ghost writing as a career recently,"
    },
    {
      "speaker": "and it feels like it could be an option for you down the road.\nLenny",
      "timestamp": "00:59:36)",
      "timestamp_seconds": 0.0,
      "content": "I'm excited to read the book. I haven't gotten a copy yet. I think you could pre-order it now,"
    },
    {
      "speaker": "Nice.\nLenny",
      "timestamp": "00:59:42)",
      "timestamp_seconds": 0.0,
      "content": "What's a favorite other podcast that you like to listen to, other than maybe the one you're on right now?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "00:59:46)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, this one's great. I can't choose between these two, though. One is Lex Fridman. And then the other is EconTalk by Russ Roberts. I really like that both of them are... Their agenda is curiosity,"
    },
    {
      "speaker": "which I love.\nLenny",
      "timestamp": "00:59:59)",
      "timestamp_seconds": 0.0,
      "content": "Totally resonate there. What is a favorite recent movie or TV show that you've enjoyed?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "01:00:04)",
      "timestamp_seconds": 0.0,
      "content": "Is it too basic to say White Lotus?"
    },
    {
      "speaker": "Lenny",
      "timestamp": "01:00:07)",
      "timestamp_seconds": 0.0,
      "content": "Cool. That's the most mentioned one, which says a lot, right? That just says how good that is, because I love it too. But, that works. Season one or season two?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "01:00:17)",
      "timestamp_seconds": 0.0,
      "content": "Oh, season two,"
    },
    {
      "speaker": "all the way.\nLenny",
      "timestamp": "01:00:19)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, same. I'm excited for season three. No spoilers. Favorite interview question that you like to ask candidates?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "01:00:27)",
      "timestamp_seconds": 0.0,
      "content": "To what do you attribute your success?"
    },
    {
      "speaker": "And you can't say luck.\nLenny",
      "timestamp": "01:00:32)",
      "timestamp_seconds": 0.0,
      "content": "Interesting. Because most people look for, do they believe it's luck, versus their innate skill? So you don't even allow them to say luck?"
    },
    {
      "speaker": "Interesting.\nEeke de Milliano",
      "timestamp": "01:00:41)",
      "timestamp_seconds": 0.0,
      "content": "Yeah. Because I think humble people will always say luck in some way. And I always kind of wanted to know, \"How self aware are you, and how curious are you?\""
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "01:00:51)",
      "timestamp_seconds": 0.0,
      "content": "And I think people who have really gone back and reflected on why are they where they are today,"
    },
    {
      "speaker": "really says a lot about how they think about the world.\nLenny",
      "timestamp": "01:01:03)",
      "timestamp_seconds": 0.0,
      "content": "I love that. What are some SaaS tools that you love, or use often, at your current company, or anywhere else?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "01:01:08)",
      "timestamp_seconds": 0.0,
      "content": "Yeah. Well, first and foremost, it's Retool. And then, the other SaaS tools that we use a lot, Slack, Gong,"
    },
    {
      "speaker": "Linear and FullStory.\nLenny",
      "timestamp": "01:01:18)",
      "timestamp_seconds": 0.0,
      "content": "Awesome. Favorite new product that you found, maybe in life, maybe at work?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "01:01:24)",
      "timestamp_seconds": 0.0,
      "content": "Yeah. Have you heard of Rewind?"
    },
    {
      "speaker": "Lenny",
      "timestamp": "01:01:27)",
      "timestamp_seconds": 0.0,
      "content": "Yes,"
    },
    {
      "speaker": "I have it running right now.\nEeke de Milliano",
      "timestamp": "01:01:31)",
      "timestamp_seconds": 0.0,
      "content": "Nice. Yeah. I mean,"
    },
    {
      "speaker": "I think it's really incredible what they've done.\nLenny",
      "timestamp": "01:01:35)",
      "timestamp_seconds": 0.0,
      "content": "Maybe describe it briefly,"
    },
    {
      "speaker": "just so folks know what that is.\nEeke de Milliano",
      "timestamp": "01:01:38)",
      "timestamp_seconds": 0.0,
      "content": "It basically records everything that you're doing on your computer and then makes it really easy for you to search it. Which, it's just incredible. I don't know if you work this way, Lenny. But I feel like nowadays, I don't really go to tabs anymore. I kind of directly search for the thing that I'm searching for. And I think Rewind just fits that user behavior so,"
    },
    {
      "speaker": "so well.\nLenny",
      "timestamp": "01:02:06)",
      "timestamp_seconds": 0.0,
      "content": "Amazing. Eeke, this was so much fun. We got through everything I was hoping for,"
    },
    {
      "speaker": "and more.\nLenny",
      "timestamp": "01:02:09)",
      "timestamp_seconds": 0.0,
      "content": "Two final questions. Where can folks find you online if they want to reach out, learn more, see what you're up to? And, how can listeners be useful to you?"
    },
    {
      "speaker": "Eeke de Milliano",
      "timestamp": "01:02:16)",
      "timestamp_seconds": 0.0,
      "content": "Definitely find me online on Twitter. It's @EekeDM. And, how can they help us?"
    },
    {
      "speaker": "Try out the Retool product and give us some feedback.\nLenny",
      "timestamp": "01:02:25)",
      "timestamp_seconds": 0.0,
      "content": "Amazing. Retool.com, right?"
    },
    {
      "speaker": "Yes.\nLenny",
      "timestamp": "01:02:26)",
      "timestamp_seconds": 0.0,
      "content": "Awesome. Thank you again,"
    },
    {
      "speaker": "for being here.\nEeke de Milliano",
      "timestamp": "01:02:28)",
      "timestamp_seconds": 0.0,
      "content": "Thanks,"
    },
    {
      "speaker": "Lenny.\nLenny",
      "timestamp": "01:02:31)",
      "timestamp_seconds": 0.0,
      "content": "Thank you so much for listening. If you found this valuable, you can subscribe to the show on Apple Podcasts, Spotify,"
    },
    {
      "speaker": "or your favorite podcast app.\nLenny",
      "timestamp": "01:02:39)",
      "timestamp_seconds": 0.0,
      "content": "Also, please consider giving us a rating or leaving a review, as that really helps other listeners find the podcast. You can find all the past episodes or learn more about the show, at LennysPodcast.com. See you in the next episode."
    }
  ],
  "num_segments": 317,
  "full_text": "Eeke de Milliano (00:00:00):\nProcess, by definition, is variance reducing. You're introducing it, because you worry that the variance in your org is too high. You want people to sort of meet a certain standard.\nEeke de Milliano (00:00:13):\nAnd the cost of that is obviously, while you are reducing the standard and bringing folks up to the average, you're also bringing other folks down to the average. And oftentimes, the folks you're bringing down are your highest performers, your most creative thinkers. The folks who, I think actually don't really need process to do their best work.\nEeke de Milliano (00:00:34):\nAnd so, that, I think is always the tension that you have with process. And obviously one of the reasons why companies introduce process much more and more, as companies get bigger, is because it's harder to get all these folks who don't need processing. You actually want to reduce the variance.\nLenny (00:00:52):\nWelcome to Lenny's podcast, where I interview world-class product leaders and growth experts, to learn from their hard own experiences, building and scaling today's most successful companies.\nLenny (00:01:01):\nToday, my guest is Eeke de Milliano. Eeke is head of product at Retool. Prior to that, she was a longtime PM at Stripe. She was actually one of their very first PMs, where she helped build some of their foundational products like Stripe Checkout, Stripe Connect, Stripe Radar, and Stripe Chargeback Protection.\nLenny (00:01:18):\nI had a total blast chatting with Eeke. We covered Stripe's internal culture and what makes it so unique and innovative. How to foster and protect innovation at your own company. What is the right amount of process by stage of company? How to build a talent portfolio. And so much more.\nLenny (00:01:32):\nI am really excited for you to hear this episode. And with that, I bring you Eeke de Milliano, after a short word from our wonderful sponsors.\nLenny (00:01:41):\nToday's episode is brought to you by Miro, an online visual whiteboard that's designed specifically for teams like yours and mine. I have a quick request. Head on over to my board at Miro.com/Lenny and let me know which guest you'd love for me to have on in 2023.\nLenny (00:01:56):\nAnd while you're on the Miro board, feel free to play around with the tool. It's a great shared space to work closely with your colleagues, to capture ideas, get feedback, and iterate quickly and easily on anything you're working on.\nLenny (00:02:06):\nFor example, in Miro, you can build out your product strategy by brainstorming with sticky notes, comments, live reactions, a voting tool. Even an estimation app, to scope out your team sprints.\nLenny (00:02:16):\nYour whole distributed team can come together around a wireframe and draw ideas with a pen tool. Or even put mocks right into the Miro board.\nLenny (00:02:24):\nAnd, with one of Miro's readymade templates, you can go from discovery and research, to your product roadmap, to customer journey flows, to final mocks. You get the picture.\nLenny (00:02:33):\nHead on over to Miro.com/Lenny to leave your suggestions. That's M-I-R-O.com/Lenny.\nLenny (00:02:41):\nThis episode is brought to you by Notion. If you haven't heard of Notion, where have you been? I use Notion to coordinate this very podcast, including my content calendar, my sponsors, and prepping guests for the launch of each episode.\nLenny (00:02:55):\nNotion is an all-in-one team collaboration tool that combines note-taking, document sharing, wikis, project management, and much more, into one space that's simple, powerful and beautifully designed.\nLenny (00:03:06):\nAnd not only does it allow you to be more efficient in your work life, but you can easily transition to using it in your personal life, which is another feature that truly sets Notion apart. The other day, I started a home project and immediately opened up Notion to help me organize it all.\nLenny (00:03:21):\nLearn more and get started for free at Notion.com/LennysPod. Take the first step towards an organized happy team, today. Again, at Notion.com/LennysPod.\nLenny (00:03:36):\nEeke, welcome to the podcast.\nEeke de Milliano (00:03:39):\nThanks so much for having me, Lenny.\nLenny (00:03:41):\nIt's absolutely my pleasure. A bunch of people have told me that I need to have you on this podcast. And actually, a big thank you to Snir Kodesh, who I believe is a colleague of yours, who gave me a bunch of interesting questions to ask you. So, I hope you're ready.\nEeke de Milliano (00:03:53):\nAwesome. Very ready. Snir is the best, so yeah, I'm excited.\nLenny (00:03:57):\nSo you're currently head of product at Retool, but before that you spent a lot of time at Stripe. You spent six years at Stripe. And so, before we get to Retool, I actually want to spend a little time on Stripe.\nLenny (00:04:08):\nTo set a little foundation, could you just talk about some of the things you worked on at Stripe? And maybe some of the things you're most proud of, during that time?\nEeke de Milliano (00:04:15):\nYeah. So when I joined Stripe, I joined Stripe in 2013. It was pretty small at the time, it was around 50 people. And Stripe didn't have any product managers at that time.\nEeke de Milliano (00:04:23):\nAnd I think Stripe was kind of famous for that. And it really wasn't because we were anti-PM in any way. It was mostly just because we were building this product for developers. We had a lot of really talented engineers, who were essentially doing the PM job.\nEeke de Milliano (00:04:36):\nSo I actually joined Stripe as the first account executive, which I think is pretty funny, now that I've seen real account executives do their jobs. Because I really just had no business doing that job. But it also really wasn't your typical sales job, in that most of Stripes volume was inbound. So I was really just spending all of my day talking to customers, helping them figure out how Stripe might work for their particular business flows, and payment models.\nEeke de Milliano (00:05:03):\nAnd a lot of it was, I think, what PMs do. It was just talking to customers, understanding their pain points, and really helping them figure out how the product might do that. And to this day, when people ask me, \"Hey, what's your advice for going into product management?\" I'm like, \"Well, you should go get a sales job. I think it's pretty valuable.\"\nEeke de Milliano (00:05:21):\nBut, it's kind of a long story to explain that, at the time there was this one sort of business model, the two-sided marketplace business model, that was just becoming huge. And you can't even really sort of imagine that now, but back then, Airbnb, Lyft, Uber, all those marketplaces, it was quite a new way of doing business.\nEeke de Milliano (00:05:41):\nAnd so, I was talking to all these customers and they had pretty complicated payment needs. So it was like, one payer putting in funds and it's getting paid out to a recipient. So an Airbnb guest and an Airbnb host. Or multiple payers putting funds in and it's getting paid out to one recipient, like a GoFundMe campaign. Or one payer putting in money and it going out to multiple recipients, like with ClassPass, where you get a subscription and then it gets paid out to a bunch of studios.\nEeke de Milliano (00:06:10):\nAnd then on top of that, all these platforms and marketplaces started having all these pretty complex regulatory and compliance requirements that were pretty different, country to country.\nEeke de Milliano (00:06:18):\nSo it was just this really complicated financial infrastructure problem, and Stripe actually didn't really have the right solution for it. And no one else in the market did, either.\nEeke de Milliano (00:06:28):\nSo at the time, this Stripe engineer, Brian Krausz, started poking around at this problem. Because I was talking to so many of these customers, we started talking about this problem together and poking around. And that actually resulted in us launching this sort of evolution of this product that we had at the time, called Stripe Connect.\nEeke de Milliano (00:06:46):\nThat was easily, I think, one of my favorite products I worked on. Not only, it ended up actually being really quite significant for Stripe's business. But also, because it was the first product and I think that's always pretty special.\nEeke de Milliano (00:06:58):\nAnd then, the second product that I think of very fondly during my time at Stripe, was this product, Stripe Radar. So Stripe obviously processes a lot of payments. Wherever there's money, fraudsters will kind of follow.\nEeke de Milliano (00:07:12):\nAnd there were certainly some merchants who were just particularly vulnerable to payments fraud. So, someone's using stolen credit card information to essentially purchase a good.\nEeke de Milliano (00:07:21):\nAnd if you're not in payments, this is going to sound kind of shocking. But if a merchant processes a payment from a customer and that customer used a stolen credit card, the merchant is ultimately on the hook for those funds. So it can be detrimental. The merchant who's trying to run a real business is just losing all of this money, because there are all of these frauds who are buying stuff from them online.\nEeke de Milliano (00:07:48):\nSo I really liked working on that product. So the product at Stripe was essentially, we built a bunch of machine learning models to try and predict when a payment was fraudulent. And then we built a product on top of that, to help customers understand why we were blocking payments, and help them write their own rules around that too.\nEeke de Milliano (00:08:03):\nAnd that was really fun, both from an anthropological perspective. Because we were kind of hanging out in corners of the internet where you wouldn't usually go if you were doing only legal things. So we were trying to understand who these fraudsters were.\nEeke de Milliano (00:08:16):\nBut it was also really cool from a product perspective, because of all the kind of complicated product questions around how humans should interact with AI and models. And I imagine a lot of the folks in the latest movement in AI are thinking a lot about that too. It's like, \"How do you explain a model to humans? How do you let them interact with it?\"\nEeke de Milliano (00:08:33):\nSo, both those things were really, really neat.\nLenny (00:08:37):\nI actually use Stripe for my newsletter. It's how folks subscribe. And when I log into my Stripe Dashboard, there's so many products. I don't even know what many of them do. But I've often seen Radar being pitched to me as something I should pay for.\nEeke de Milliano (00:08:53):\nNice.\nLenny (00:08:53):\nAnd I feel like I should probably turn it on. That sounds really useful.\nLenny (00:08:57):\nOne thing, that I want to dig in on... So you said when you joined, there were no PMs at Stripe. How many PMs were there when you moved into product at Stripe?\nEeke de Milliano (00:09:06):\nThat's a great question. I want to say maybe three or four.\nLenny (00:09:10):\nWow. Incredible.\nEeke de Milliano (00:09:12):\nYeah.\nLenny (00:09:13):\nAnd you said Stripe is kind of known for being really late to PM and... I don't know if I want to say anti-PM, but there's a lot of sense of, \"Why do we need PMs? We have amazing engineers who can decide what to build.\"\nLenny (00:09:23):\nIs there anything you can share around that general philosophy of Stripe? And was it effective? Was it good? Because a lot of companies are anti-PM. And I think they always point to Stripe, and Snap is another example of, \"We don't need PMs. Look how far these companies got with without PMs.\"\nLenny (00:09:38):\nIs there something unique to Stripe that allowed them not to have PMs? I think there was like 200 employees probably, by the time they had their first PM.\nEeke de Milliano (00:09:44):\nI think we actually had our first PM at... I want to say at about 100 employees.\nLenny (00:09:47):\nOkay.\nEeke de Milliano (00:09:48):\nBut yeah, no, it was late in the game. And actually, maybe just to pattern match. Retool also didn't really have PMs for a while.\nEeke de Milliano (00:09:57):\nAnd I think actually both in the Stripe case and the Retool case, the thing that both of these companies have in common is, you're building for developers. The people who are building the product are the customers in a lot of ways. So, they get it. There's really no reason why you should have, in some ways, a middle man trying to figure out, \"Hey, who's the customer, and what is it that they need?\" And what are their pain points?\"\nEeke de Milliano (00:10:19):\nAnd I think the moment at which it became clear, \"We really do need PMs at Stripe.\" And I think we felt the same way at Retool is, your customer base starts expanding. You start having different kinds of customers. You need to understand the whole market, all of the ICPs that you're going after.\nEeke de Milliano (00:10:35):\nAnd the organization gets more complex. I think Stripe... Gosh, in particular, it's just an extremely matrixed organization in business. Because every time you launch a product, you're having to think about, \"Well, how do we do this in other countries? There's different financial infrastructure. How do we think about the legal side, the compliance side, et cetera?\"\nEeke de Milliano (00:10:51):\nAnd I think PMs can really kind of bring that whole story together and make the whole machine move. In addition to understanding the customers, and the value prop, and what the overall strategy was.\nLenny (00:11:04):\nThat's a really good reminder of, engineers and designers can do the work of a PM, but often they don't want to. There's a lot of non-fun parts to it. They're like, \"Oh, I wish we could have someone here do these things.\" And PMs enjoy that work. They're good at it. And so, eventually engineers and designers realize, \"Okay, I see why maybe we should hire a PM.\"\nEeke de Milliano (00:11:23):\nI say this often actually, to folks who are thinking about going into product management. \"That's awesome. Just be really, really sure about what you're signing up for.\"\nEeke de Milliano (00:11:33):\nIt's kind of the same as, I think a lot of people want to become a manager. But just so you know, being a manager is like, \"Hey, you're doing performance reviews a lot. And you're in one-on-ones a lot.\" You have to really love that kind of work. And I think in the product management case, it's also like, you're constantly working across a lot of different teams. You're trying to influence a lot of people who don't report into you directly, to do a bunch of stuff.\nEeke de Milliano (00:11:54):\nAnd if you love that, that's great. But you've got to be sure you know you're signing up for it.\nLenny (00:12:00):\nYeah, that's a really good comparison. When I first became a manager, I was an engineer, actually. And I was managing engineers. And then, when I moved on to something as an IC engineer, again, I was like, \"I will never manage again. That was no fun at all. Why would I want to do this?\"\nLenny (00:12:12):\nAnd I imagine people get into product thinking they're going to have all this control, power, influence. And then they're like, \"Oh my God, this job is so freaking crazy. What did I sign up for?\"\nEeke de Milliano (00:12:20):\nIt's so hard.\nLenny (00:12:23):\nYeah. That reminds me, something that I heard you did at Stripe is, you wrote their internal culture guide. It was like a quick start guide to culture at Stripe, that I think was maybe shared with early employees.\nLenny (00:12:33):\nAnd if that's true, I'm curious what it is about Stripe's culture? If you could just briefly share just what makes Stripe so special. Clearly, it's one of the most successful companies in the world, in history. I know there's been a a slowdown with the market. Everyone's slowed down a bit.\nLenny (00:12:48):\nBut it feels like Stripe has been incredibly successful and continues to innovate like crazy. Hires incredible people. People that are starting amazing companies.\nLenny (00:12:56):\nSo I guess back to my question, what is it that you think makes Stripe's culture unique and special?\nEeke de Milliano (00:13:01):\nYeah, that quick guide to Stripe's culture. I think we wrote it, maybe when we were around 150 people or so. And we actually wrote it to share with candidates.\nEeke de Milliano (00:13:10):\nBecause the idea was like, \"Look, we're kind of opinionated about how we do things here. Most companies struggle to describe what their culture is. Like, how does a fish describe water? But it's worthwhile getting a sense of the things that we feel opinionated about, and that you might like or you might not like.\"\nEeke de Milliano (00:13:29):\nAnd actually, when we put out the guide, our metric of success was that, more of the right people would apply to Stripe and fewer of the wrong people. And there was a whole section in there, I was like, \"Hey, look, we work pretty hard here and that is certainly not for everyone. And hopefully you're excited to come and work really hard with colleagues who really care, and that's the reward.\" So, that's maybe one example.\nEeke de Milliano (00:13:56):\nOn Stripe's culture and what's made it so successful. I've really been thinking a lot about, \"Were there one or two pivotal points or decisions for Stripe, that really set it on its path to success?\" And I don't think there are, actually. Every time I'm like, \"Well, if this hadn't happened...\"\nEeke de Milliano (00:14:16):\nI can always reason my way into, \"If these other things would've happened, Stripe would've kind of ended up in the same place.\"\nEeke de Milliano (00:14:24):\nSo I think what Stripe was actually particularly good at... And by the way, you should take all this with a humongous grain of salt, because I haven't worked there since 2019. But, at least my experience when I was there, what Stripe was really good at was just making, not just one or two good decisions. It was making a lot of really good decisions all the time, big or small.\nEeke de Milliano (00:14:44):\nAnd that, I think, was quite cultural. There was this humongous respect and enthusiasm for thinking. It was such a part of the culture. One of the values was, think rigorously. Every meeting was very much like, \"Hey, how do we think about this thing from first principle?\"\nEeke de Milliano (00:15:03):\nNo one would ever say, for example, \"It's a best practice to do X.\" People would be like, \"Well, why?\" You had to go a few levels deeper. So that was, I think, one piece.\nEeke de Milliano (00:15:14):\nThe other piece... And a lot has been written about this already. Stripe had a very strong writing culture. All communication was along from writing business reviews, strategy memos, product reviews. There was a lot of writing that happened.\nEeke de Milliano (00:15:26):\nAnd I very strongly believe this. I don't think you can be a good writer, unless you're a clear thinker. And if you couldn't write well, I think it was actually pretty hard to be successful at Stripe, at least in the early days. So I think Stripe just cultivated a lot of really good writers, and by input into that, a lot of really good thinkers.\nEeke de Milliano (00:15:44):\nAnd then, I think the last thing that Stripe was really good at, was not overthinking decisions. Because that's kind of the flip side of this really rigorous approach, is that you lock yourself into a room and can't come out for five days. You have to be good at making a lot of decisions, and the right decisions, quickly.\nEeke de Milliano (00:16:01):\nAnd one of the things that we would always sort of kick around a lot was just the idea of, \"Is it a trapdoor decision?\" Which I think is an Amazon concept.\nLenny (00:16:12):\nOne-way door, or two-way door.\nEeke de Milliano (00:16:13):\nIt's like, \"If you make this decision, is it one door, or is it two doors? Can you come back from this decision?\"\nEeke de Milliano (00:16:16):\nAnd I thought Stripe was actually really good at being rigorous... Back to the rigorous point. About what actually was a trapdoor decision.\nEeke de Milliano (00:16:22):\nSo I think a lot of people, for example, think pricing is a trapdoor decision. But actually, it's really easy to grandfather your existing users into some existing pricing model and change pricing for future users. And if you believe that the product's going to be successful, your early users are only going to be a fraction of that pricing model.\nEeke de Milliano (00:16:41):\nAnd if the product's not successful, then Who cares if you change the pricing model? So I think that's a really good example of, people think that's a trapdoor decision, but actually you can move much more quickly on that decision than you think.\nEeke de Milliano (00:16:52):\nAnd then, a decision that definitely felt to us very much like a trapdoor decision, that I think Stripe took a long time being really rigorous about, was titles. I think Stripe's kind of famous for not really having titles.\nEeke de Milliano (00:17:03):\nAnd I think it was right to be rigorous around that decision, because once you've given someone a title, you can't really take it away. So you better be sure about the title you want to give someone.\nLenny (00:17:16):\nYeah, the titles are hilarious. I put together a career ladder doc of all company leveling names across all the big companies.\nEeke de Milliano (00:17:26):\nIs everyone a lead, at Stripe?\nLenny (00:17:26):\nAnd it's like, product manager, product manager, product manager, product manager... Yeah. And there's a lead here and there. Yeah, VPs are basically a product manager or a product leader, something like that.\nEeke de Milliano (00:17:36):\nYep. Yeah.\nLenny (00:17:37):\nHilarious. You talked about this idea of first principles. People talk about that often as, \"We want to be first principle thinkers. We're going to think from first principles.\"\nLenny (00:17:47):\nHow did Stripe actually operationalize that, implement that? Or was that just founder, top-down, continued questioning people, and that trickles down? Or is there anything else that they did to instill that mentality?\nEeke de Milliano (00:17:57):\nI definitely think it's founder, top-down. They were really good about hiring people who thought that way, too. So it's just all that stuff. It just really, really trickles.\nEeke de Milliano (00:18:05):\nAnd actually, to this day, when I'm preparing a memo, or a board deck, or something. I imagine in my head, I'm like, \"What if I had to present this to Patrick?\" And my ideas just get so much better, because I can sort of think about the questions they would ask.\nEeke de Milliano (00:18:23):\nSo, I think that was one. I think the other one was just sort of this writing culture piece. Once you start writing things down, you realize, \"Hey, that actually doesn't make a lot of sense.\"\nEeke de Milliano (00:18:33):\nAnd then, I think the third thing actually was, there was just always a lot of questioning about the status quo. So if something had been done in an industry for a long time, people would always be like, \"Well, why was it done that way?\"\nEeke de Milliano (00:18:46):\nAnd I think this is actually how Stripe got its start. I think when Stripe started, if you wanted to set up a merchant account, it could take weeks. And everyone just assumed that's what it took. And of course John and Patrick were like, \"Well, it doesn't actually make that much sense why it should take that long.\"\nLenny (00:19:00):\nYou shared some of the values... I don't know if they're just called values, core values, at Stripe. But, is there other ones you can share? You said one is think rigorous, or don't overthink. What are the other values at Stripe?\nEeke de Milliano (00:19:10):\nYeah, think rigorously was one. And I think they might have actually updated these on the website recently, so my recollection is very likely out of date.\nEeke de Milliano (00:19:19):\nAnd Stripe would call them operating principles, actually. Which, I think is actually better. Because values, you can't really tell people what to value. Everyone has their own value set. But you can tell people like, \"Hey, here's how we operate.\"\nEeke de Milliano (00:19:32):\nAnother one that I loved was, move with urgency and focus. It was just really this idea that you're biggest compatriot and your biggest enemy as a startup, is time. So you have to move really, really, really fast on it.\nEeke de Milliano (00:19:48):\nCustomers first, was the other one. Or, users first, as Stripe would refer to customers as users. So those are some of my favorites.\nLenny (00:19:56):\nWhen I think back to what made Airbnb special in a similar way, the values... We call them core values. I think were actually really, really important, and turned the company into what it ended up being. And I was actually there around the time they created these values.\nEeke de Milliano (00:20:08):\nOh, awesome.\nLenny (00:20:09):\nI'm curious, at Stripe, do you have any recollection of how they came to these operating principles? Because, as I mentioned, founders are listening. \"How do I come up with these for our company?\"\nEeke de Milliano (00:20:19):\nI'm pretty sure Patrick wrote them. Yeah. I think they came from... Patrick and John wrote them.\nEeke de Milliano (00:20:26):\nActually, the other value that I love... I don't think they have it anymore, but it was good, the operating principles. Micro pessimists, macro optimists.\nLenny (00:20:33):\nWow.\nEeke de Milliano (00:20:34):\nYeah. It was just this idea that, \"In the long term, we expect the curve to go up. We very much believe in the upward trajectory of just about everything. But on the day-to-day decisions, on the minutiae, we're quite critical. How do we make sure this thing works?\" And we'd think about all the ways in which it doesn't work.\nLenny (00:20:53):\nSo zooming out a little bit. We've been talking about Stripe. Retool also is a very first principles, innovative company.\nLenny (00:20:59):\nSomething that I think of when I think of Retool is, during the wild market days of long ago, last year. I know Retool was very conservative in how they raised money, and the valuations they raised at. Which, looking back, ended up being a really good idea. While everyone's raising at $100 billion, I think their last round is a few billion. And it's a very reasonable, conservative way to think about fundraising.\nLenny (00:21:23):\nAnd so, I guess just thinking about innovation in general. Why do you think some teams are able to run innovation machines, continue to put out new products, disrupt industries, while other companies kind of plod along and stay conservative?\nLenny (00:21:37):\nIs there anything you've seen, something you bring to teams you work on, to help foster innovation and big thinking?\nEeke de Milliano (00:21:43):\nYeah, I actually think about the extremes of that question. So not, \"Why are some teams innovative?\" But, \"Why isn't every team innovative?\" I feel like no one wakes up in the morning and thinks, \"Yeah, today I want to work on boring, incremental stuff.\"\nEeke de Milliano (00:21:57):\nBut, most teams do end up working on pretty incremental stuff. I always wonder, \"What is it that's stopping folks from being creative and thinking bigger?\" And I think it comes down to a couple of things that companies do sort of unwillingly, or not even realizing it.\nEeke de Milliano (00:22:14):\nAnd one is this fear of failure. I think leaders want the upside of innovation, but they're not really willing to deal with the cost of innovation. Which is like, \"Look, if you're going to swing big, you will invariably stumble sometimes.\"\nEeke de Milliano (00:22:29):\nSo I think if you want to mitigate that, you have to start shining light on failure. That's really the only way. You have to start normalizing it a little bit. And obviously, if an individual, or if a team is consistently failing and not learning. That, you need to deal with.\nEeke de Milliano (00:22:46):\nBut I think sometimes it's good to fail. And when you do fail, use it as an opportunity. Don't squander that moment to not learn.\nEeke de Milliano (00:22:57):\nBut yeah, one example is, instead of calling something a postmortem, call it a retrospective, so that it's a positive thing. Like, \"Hey, we're learning from this thing.\"\nEeke de Milliano (00:23:07):\nAnd then, I think the other way to kind of mitigate the feeling of failure is, you have to figure out how to give folks more at BATS. Because obviously, anything that takes one year to ship, and you haven't gotten any customer feedback, the stakes of that are just going to feel so, so high. If you get it wrong, it's going to be devastating. So you have to figure out how to lower the stakes.\nEeke de Milliano (00:23:27):\nAnd honestly, I think in some ways it's kind of easy. It's like, \"Look, don't put too many resources against these bigger swings. Have them be small teams.\" And then also, just get customer feedback as quickly as possible. Don't wait until the thing is perfect. And that way, you can limit the risk.\nEeke de Milliano (00:23:44):\nSo yeah, I think fear of failure, that's definitely one thing that stops teams from being innovative.\nEeke de Milliano (00:23:49):\nThere's a very practical one. Sometimes teams are just getting bogged down by really urgent work. There's too much tech debt. There's too much product debt. Bugs, instability. It's a massive hierarchy of needs. There's just no way that they're going to be able to focus on the enlightened, bigger, creative stuff if they're just heads-down dealing with incidents all day. So if that's the case, yeah, diagnose it and get your team out of that.\nEeke de Milliano (00:24:18):\nAnd then, I think the last reason why teams aren't always that innovative is because, I think thinking big is really hard. And to some people it comes pretty naturally. But for most of us mortal souls, it's just really, really hard. And it takes time. And when you're at a startup and you're just grinding day-in, day-out, you're treading water just trying to make it through the day.\nEeke de Milliano (00:24:45):\nTaking the time to really think about the strategy, and where things should go, and get creative. It's pretty hard. So I call this... You have to give teams permission to think. So create these moments in your company culture, in your overall business processes, where you're asking people, you're literally saying, \"Hey, this is part of your job to think bigger.\"\nEeke de Milliano (00:25:09):\nSo at Retool, we have these team charters and we do team planning. And at the bottom of every team charter we have a section called, Think Bigger. \"With 20% more time, what would you do that isn't on this list already?\"\nEeke de Milliano (00:25:21):\nAnd then another really neat tradition that we had at Stripe, and we have a Retool now, too. Is this thing called, Crazy Ideas. So at the beginning of every year, David will send out a blank doc to the org and it's titled Crazy Ideas.\nEeke de Milliano (00:25:39):\nAnd the Prompt is, \"Crazy ideas are ideas that we shouldn't, obviously, do. There's a 90% chance that they make no sense. But in the 10% chance that they do, they will make a 10x to 100x difference for the retail business.\" And then, it's literally just a request for crazy ideas.\nEeke de Milliano (00:25:57):\nAnd the org loves it. It's amazing. The energy around it is so cool. And it's not just product ideas, it's different ways of how we should run our organization. Or, it's really cool marketing ideas in there.\nEeke de Milliano (00:26:12):\nSo, that doc is awesome. And whenever I have a down day, I just scroll through that doc.\nLenny (00:26:17):\nI know that you've launched three different products this year which I want to talk about, which maybe came out of this big thinking. But a couple more questions just to dig into some of the stuff you just shared.\nLenny (00:26:26):\nOne is this big doc of awesome ideas. What's come out of that? Because I think of hackathons, and people have all this energy, and it's exciting. And then they do all these cool things and they don't go anywhere.\nLenny (00:26:35):\nDo things come out of this? Does it lead to actual ideas that people follow up on?\nEeke de Milliano (00:26:38):\nYeah. Yeah, yeah. So every year that we send out the doc, we look at the doc from the past year, and we're like, \"Okay, did we do anything on this list?\" And consistently, we do anywhere between three to eight things on the list.\nLenny (00:26:49):\nWow.\nEeke de Milliano (00:26:50):\nYeah.\nLenny (00:26:51):\nIs there an example of a product that launched, that came from that list, that comes to mind?\nEeke de Milliano (00:26:54):\nActually, at least one, if not two of the three products that we launched this last year were on the crazy ideas list at one point. Like, a year ago, if you'd asked me, \"What is Retool's product?\" I would've told you, \"Retool helps you build internal frontends really, really fast.\"\nEeke de Milliano (00:27:09):\nBut if you were trying to schedule a query to run at a later point in time, or have something trigger, or run an ETL task, you couldn't do that in Retool. So that was actually one of the crazy ideas. And that ended up becoming Retool Workflows, which we launched just last year, in November.\nLenny (00:27:28):\nOkay. We're definitely going to chat a bit about that. I want to go back to the two other suggestions you had. One is embrace failure, make it okay to fail. And then two is, don't let people get sucked into urgent stuff, and have time to focus on important stuff.\nLenny (00:27:42):\nIs there an example of just how to help people embrace failure? You talked about retrospectives. Is there anything else that you've found works, either as a tactic, as a process, as a framework, just to help people get out of that?\nLenny (00:27:55):\nBecause I hear that a lot, \"Embrace failure.\" And then people are like, \"Oh, but I failed and I suck.\" So yeah, is there anything else along those lines that you found effective to create that feeling?\nEeke de Milliano (00:28:04):\nTo me, it's always in the follow-ups. So have people talk about the failure in these sort of public forums, where usually you talk about the successes. So have someone actually write a note that's like, \"Hey, here are all my learnings from this thing that we did.\" And send it to the org.\nEeke de Milliano (00:28:18):\nAt Retool we have a shipped email list. If you ship something, you'll always send to that.\nEeke de Milliano (00:28:24):\nHave them send that email to the org. It's just an awesome way to celebrate. Or have them present it all-hands and share what they learned. And it almost always results in, I think, a really positive twist.\nLenny (00:28:38):\nAt Airbnb, I think for a period, there was an award for the biggest failure project and feature.\nEeke de Milliano (00:28:42):\nReally? That's so cool.\nLenny (00:28:43):\nYeah, like a trophy or something. It was a short-lived idea, but it was funny.\nEeke de Milliano (00:28:47):\nYeah, yeah, yeah.\nLenny (00:28:48):\nAnd then, on the second bullet point of urgency, giving people a chance to think longer term. Is there anything there, that you found to be actually effective, to create that culture, and give PMs and product teams a chance to think longer term, and not just be stuck in the fires that they're dealing with?\nEeke de Milliano (00:29:02):\nThere's a couple of top-down things, and a couple of bottom-up things.\nEeke de Milliano (00:29:06):\nOn the top-down, sometimes you just have to be willing to fund someone with something. Like, they come to you with an idea and you're like, \"Look, yeah, take an engineer and go do it.\" And you just have to give folks that sort of organizational buy-in.\nEeke de Milliano (00:29:21):\nActually, I was thinking back to that engineer, Brian Krausz at Stripe, who started poking around on this marketplace model. And I was thinking, I can't remember a moment when someone formally said to him, \"This is now your job.\" I think he just went and looked, and went and dug into it. And at some point, I think a manager was like, \"All right, this is now your job.\"\nEeke de Milliano (00:29:43):\nBut yeah, no, I think you have to be able to fund folks' time and give that. Hackathons, I think, are pretty good for that stuff. It is kind of a moment for folks to take a step back.\nEeke de Milliano (00:29:55):\nAnd then, I think more than anything, in people's planning processes, I really like asking folks the 20% more time question. Or the other question was, \"Look, if you doubled the team today, what would you do?\" That shows up in our planning processes as well.\nEeke de Milliano (00:30:08):\nAnd I think it really helps people kind of break out of this... I think you end up planning towards the team that you have and not the team that you should have. So, that's how folks can break out of that process.\nLenny (00:30:20):\nAwesome. I really like the think bigger bucket in your planning docs. Just like, \"What would you do if you had more resources?\" Maybe a quick question there. Is there a bunch of detail that you ask them to put into that, or is it just a bullet point of big ideas?\nEeke de Milliano (00:30:32):\nFolks can just go crazy on it. It's however they want to take it. I've seen folks actually create entire demos.\nEeke de Milliano (00:30:40):\nBut I actually think the trick is less structure, in those cases. Because you don't really want to sort of pigeonhole... Or make it even that intimidating for folks. If someone just wants to write down a few bullets, that's great.\nLenny (00:30:53):\nThis episode is brought to you by Eppo. Eppo is a next-generation A/B testing platform, built by Airbnb alums for modern growth teams. Companies like Netlify, Contentful and Cameo rely on Eppo to power their experiments.\nLenny (00:31:07):\nWherever you work, running experiments is increasingly essential, but there are no commercial tools that integrate with a modern growth team stack. This leads to a waste of time building internal tools, or trying to run your experiments through a clunky marketing tool.\nLenny (00:31:21):\nWhen I was at Airbnb, one of the things that I loved about our experimentation platform, was being able to easily slice results by device, by country, and by user stage. Eppo does all that and more. Delivering results quickly, avoiding annoying prolonged analytics cycles, and helping you easily get to the root cause of any issue you discover.\nLenny (00:31:41):\nEppo lets you go beyond basic click-through metrics and instead, use their North Star metrics like activation, retention, subscriptions and payments. And Eppo supports tests on the frontend, the backend, email marketing, and even machine learning clients.\nLenny (00:31:55):\nCheck out Eppo at GetEppo.com. Get E-P-P-O.com and 10x your experiment velocity.\nLenny (00:32:03):\nOkay, so you launched three new products this year. Usually, companies are lucky to launch one product a year. A few questions.\nLenny (00:32:11):\nOne, just tell us what those three were, in case people are interested and want to check them out. Two is, was that a good idea? Is it good to launch three new products in a year?\nLenny (00:32:19):\nAnd then three, what did you do organizationally, to allow for this to happen? Because that feels really ambitious and rare, and I'm curious what you learned from that.\nEeke de Milliano (00:32:28):\nSo the three products we launched, one was Retool Workflows that I talked to you a little bit about. It's like, if you want to be able to, essentially create a workflow. Like schedule an alert, run a task, you can kind of do it in the Retool way. Where it's this visual, sort of easier builder of creating these different sort of workflows. But you can write your own code on top of it, as well.\nEeke de Milliano (00:32:50):\nThe second product is Retool Mobile. So you could pretty easily build incredible web apps with Retool. But there are plenty of folks who don't sit behind their laptop at a desk all day. And for those folks... We had a lot of companies who were like, \"I want a mobile native app.\" And so, we launched that product.\nEeke de Milliano (00:33:09):\nAnd then the third product was Retool Database. So until very recently, if you came to Retool, you could connect your data via your APIs, your database, directly into Retool.\nEeke de Milliano (00:33:20):\nBut what we found is that actually, a lot of folks either don't have access to their database, or they're just trying to build an internal tool and they don't necessarily want to store that data in their production database.\nEeke de Milliano (00:33:29):\nSo we built... Essentially, we spin up a post [inaudible 00:33:32] database for you. And you can just access it via a really nice UI and manage it directly in Retool.\nLenny (00:33:38):\nAmazing. Okay, back to the other two questions.\nEeke de Milliano (00:33:42):\nYes. Okay. So I think your second question was, \"Was this a good idea?\"\nLenny (00:33:44):\nRight.\nEeke de Milliano (00:33:46):\nYeah. You know what? I think in hindsight, if I were to do it again, I think sequencing it would've been slightly better. Just because, I think what we ended up doing is, we ended up launching the idea behind all three of these products at around the same time. And they all ended up maturing at around the same time, and that was just a lot of headspace from the org. Even though actually, the teams themselves were not that big.\nEeke de Milliano (00:34:18):\nIt was just like, we had all these products and we were just waiting for them to launch and waiting for them to launch. Whereas, maybe if we'd sequenced it, I think that would've felt more satisfying to the whole organization.\nEeke de Milliano (00:34:28):\nBut, I mean, it ended up working out. I think that's kind of the crazy thing. It's like, we were able to pull off launching these three products.\nEeke de Milliano (00:34:36):\nAnd by the way, I should caveat that, the further I get along my career, the more I realize I'm just kind of building on the shoulders of giants. And a lot of these ideas, et cetera, were very much in the works and were happening before I came along.\nEeke de Milliano (00:34:50):\nBut yeah, it was really neat to see how we got that all over the finish line in a year.\nLenny (00:34:55):\nAnd then, the last question there is just, what do you think you did to allow for this? Because it's pretty rare you can build so much. And I know the team's not huge. How many people work at Retool, roughly?\nEeke de Milliano (00:35:05):\nToday, we're around 300 people.\nLenny (00:35:07):\nYeah. So how do you structure an org to build three and launch... I didn't realize they launched around the same time. It's like, I'm picturing Elon Musk launching three rockets at once. How do you allow for that to happen?\nEeke de Milliano (00:35:20):\nYeah, I'm sure our product marketing team felt that way. Yeah, a couple of things. We started really small with all of these initiatives.\nEeke de Milliano (00:35:30):\nSo I think I mentioned, we really had one or two people working on each of these products for the first six months. So it was one engineer and one designer, or one engineer and one PM. And they really didn't get funding until it was clear that there was something there.\nEeke de Milliano (00:35:46):\nSo those teams, they spent a ton of time with customers. They spent a ton of time building, a ton of time prototyping. And it was kind of the moment where it was like, \"Okay, they are there.\" That we started bringing more people onto the team.\nEeke de Milliano (00:35:59):\nSo, that was the first piece. The second piece is that, we really treated them like startups. We're like, Retool's the VC, and Retool funds with resources and Retool's existing customer base. Which is obviously quite valuable, because you have all these customers you can market to and promote to.\nEeke de Milliano (00:36:15):\nBut then, the teams really had to prove that ROI. Either in engagement, or eventually revenue, in order to be able to move forward.\nEeke de Milliano (00:36:25):\nAnd then the third thing... And this one, actually I think it can be quite controversial. Is, we were really deliberate about keeping these teams separate from the rest of the org, especially early on. Now, a lot of them, they're very much a part of the overall organizational processes.\nEeke de Milliano (00:36:42):\nBut very early on, they were running on their own. They were meeting quite independently with one, or two, or three folks from the leadership team. And they were also just quite separate from the product itself.\nEeke de Milliano (00:36:56):\nI think Retool Mobile's actually a really good example, where we had a lot of debate about whether or not we should build Retool Mobile out of the core web app builder. Because a lot of the primitives are the same.\nEeke de Milliano (00:37:09):\nAnd we eventually decided that we were going to run it as a separate team, because we wanted the team to be able to move really, really quickly. And we didn't want it to get bogged down in, what are just the realities of running a product that has product market fit, like bugs, yada, yada, et cetera.\nEeke de Milliano (00:37:24):\nAnd I think that was absolutely the right call, because Retool Mobile actually has quite a different target customer. Which, we only really realized maybe like halfway through the project. And I don't think we would've been able to really understand that, or even get broader in that kind of thinking, had we sort of been stuck in the core retail product.\nEeke de Milliano (00:37:43):\nBut yeah, there was a cost to that, too. Which is like, \"Okay, now we have these two products, and we have to...\" I think obviously the strength will be, \"How do all these products interact with each other, and how do they build on top of each other?\"\nEeke de Milliano (00:37:52):\nSo, we have to go and invest in that now. But I think it's totally worth it, because your team can just move more quickly, be more independent, and think more independently, too.\nLenny (00:38:00):\nIn the time that you worked at Stripe and Retool... I know we chatted before we started recording. You think a lot about, \"What is the right level of process for companies at different stages?\"\nLenny (00:38:12):\nAnd I'd love to just hear your thoughts, because I know that's a challenge a lot of companies face. \"How much do we put in now? Do we get inspiration from big companies? Do we try to stay lean?\"\nLenny (00:38:22):\nSomething here, that we actually run into. I'll just mention briefly that, there was a huge resistance to process for a long time. And so the product team was just kind of a little crazy for a bit. And then we were like, \"Okay, we need product development process. We need deadlines and specs.\" And that helped a lot.\nLenny (00:38:40):\nSo let me ask again, just how do you think about the right level of process for a stage of company, and what have you learned there?\nEeke de Milliano (00:38:45):\nYeah. What I would really love from companies is just sort of like this time capsule, where you can see what their processes were when they were like 20 people, and 50 people, and 100 people, and 500 people.\nEeke de Milliano (00:38:55):\nBecause when we were at Stripe and we were trying to figure out our planning process, we actually talked to Amazon, and Atlassian, and Apple, and all these companies that we really, really respect and look up to.\nEeke de Milliano (00:39:07):\nAnd I remember taking down notes from these companies and being like, \"Yeah, this is awesome, but there's no way that this will work for Stripe.\" Stripe was so much smaller than any of these companies.\nEeke de Milliano (00:39:17):\nSo yeah, they were showing us where we had to go, but no idea how to get there. And so, yeah, Lenny, maybe you can help us figure out time capsules for companies and what processes make sense.\nLenny (00:39:27):\nYeah. I am working on that, roughly.\nEeke de Milliano (00:39:28):\nOh, nice.\nLenny (00:39:30):\nI'm going company by company, about how they think process and about process. And then maybe I'll check in every couple of years.\nEeke de Milliano (00:39:36):\nCool. I love that. But yeah, to answer your question directly. Process... Yeah, it really gives people a bitter taste in their mouth, I think.\nEeke de Milliano (00:39:47):\nProcess, by definition, is variance reducing. You're introducing it, because you worry that the variance in your org is too high. You want people to sort of meet a certain standard.\nEeke de Milliano (00:40:00):\nAnd the cost of that is obviously, while you are reducing the standard and bringing folks up to the average, you're also bringing other folks down to the average. And oftentimes, the folks you're bringing down are your highest performers, your most creative thinkers. The folks who, I think actually don't really need process to do their best work.\nEeke de Milliano (00:40:21):\nAnd so, that, I think is always the tension that you have with process. And obviously one of the reasons why companies introduce process much more and more, as companies get bigger, is because it's harder to get all these folks who don't need processing. You actually want to reduce the variance.\nEeke de Milliano (00:40:38):\nThis is actually a little bit of an aside, but it's kind of relevant, so I'm just going to mention it. And you can feel free to let me know if it's too much of an aside.\nLenny (00:40:44):\nLet's get into it.\nEeke de Milliano (00:40:47):\nBut, I was just listening to this awesome podcast with Russ Roberts, who's a professor. He hosts EconTalk. I don't know if you listen to it.\nEeke de Milliano (00:40:56):\nAnd he was in interviewing this guy, Ian Leslie, who's this great writer and has just written this article that's... Basically, something along the lines of what it means to be human in the age of AI.\nEeke de Milliano (00:41:07):\nAnd I thought he just articulated this idea well. Which is, we're all really so impressed when we see ChatGPT-3 spit out this piece of writing that feels very human-like.\nEeke de Milliano (00:41:20):\nBut what we're kind of forgetting is that, over the last 10, 20, 30 years, we're actually asking humans to be a lot more robot-like. In that, we're really asking everyone to standardize in a lot of ways. And we're making people a lot more formulaic. If you think about how we teach people to write, it's like, \"Well, there's five paragraphs. And there's your opening paragraph. And you state your topic.\"\nEeke de Milliano (00:41:43):\nSo anyway, I think the point is, the more formulaic, the more sort of mass produced you're trying to make something. The more you kind of quench people's creativity, and the further away you get from the really, really high highs. And that, to me, is the cost of process, and rules, and templates.\nEeke de Milliano (00:42:05):\nSo if you're going to introduce it, be really, really sure that you're okay with that cost. And give folks escape hatches.\nEeke de Milliano (00:42:13):\nSo I've started referring to this as the MVP, the minimum viable process. So if I give folks a template, I'm like, \"Look, use the template. But if you want to break out of it, please absolutely do.\" And I've started writing this at the top of templates now.\nEeke de Milliano (00:42:26):\nIt's like, \"If this doesn't work for what you're trying to explain, don't use it. But just know that this is the minimum viable thing. We're setting the bar here, but go higher if you can, please.\"\nEeke de Milliano (00:42:38):\nSo anyway, that's my sort of long drive on process. With all that said, I do think that companies, there's just a set of documents that are really, really viable. That every sort of level of the organization should have throughout its lifecycle.\nEeke de Milliano (00:42:54):\nAnd then, I think how sort of involved it is, or how long term it is really depends on how big you are.\nEeke de Milliano (00:43:00):\nBut those documents, to me, are the charter. So, \"What is your mission, your vision and your strategy?\" The goals, \"What are you aiming to do and how are you going to measure success?\" And then the roadmap, \"What is the thing that you're shipping?\"\nEeke de Milliano (00:43:15):\nAnd I think the whole company needs these, the whole function. So in product, you need all three of these. And then, within each team you need all three of these.\nEeke de Milliano (00:43:26):\nAnd I've kind of noticed two things about this framework for myself. One, I've actually noticed that teams often work their way from the bottom-up, versus top-down. They start with a roadmap. They're like, \"What are all the things we're going to ship?\" Especially early on. And then they kind of work their way into a charter. But I think it's really, really worth it to start from the top-down.\nEeke de Milliano (00:43:47):\nAnd then, the second thing that I've noticed is that your time horizon really shifts as you get more mature. So if you're very early on, you don't have PMF, you should have a charter, but your charter should be like three months in the future. Because you can't look that much further.\nEeke de Milliano (00:44:01):\nAnd if you're a company that's humming and going, your charter is probably... The horizon's maybe a decade.\nLenny (00:44:11):\nWow. There is so much there. I could go into so many different directions. One thing I wanted to follow up on a little bit, is this idea... Such a great point. That process brings the best people down and kind of averages them out to create consistency.\nLenny (00:44:28):\nAnd I'm curious if there's anything else you've seen succeed in allowing the best and most innovative brains to just do their thing. I know part of it is probably hiring amazing people. But yeah, is there anything else that's an escape hatch of just like, \"Oh yeah, this person, just go. Go figure this out.\"\nEeke de Milliano (00:44:45):\nTo me, the unlock for organizations is managers, for this. Because you need managers to both detect the high performers and be like, \"This person doesn't need the process.\" And then you need managers to give that person air cover to be like, \"We're honestly...\" Because what you're doing is, you're giving them some special treatment and you need to be kind of okay with that.\nEeke de Milliano (00:45:02):\nAnd you also need to be okay with the organizational cost for that. Claire, who used to be the COO of Stripe, would always say, \"Are you willing to break the org for this person?\" And I always thought that was a really nice framing. And you kind of need to decide who you want to do it for, too.\nEeke de Milliano (00:45:17):\nBut yeah, some people are just that good that like, \"Yeah, of course you'll break the org for them.\" They're going to break the org in the best way possible.\nLenny (00:45:27):\nYeah. I love that term. I think Claire's coming on this podcast. She just wrote a book, right? Is that the same person?\nEeke de Milliano (00:45:29):\nYeah.\nLenny (00:45:30):\nOkay, great.\nEeke de Milliano (00:45:30):\nYeah, she just wrote a book. Yep.\nLenny (00:45:33):\nAll right, we just booked her. Come, and maybe we'll spend some time together.\nEeke de Milliano (00:45:36):\nThat's awesome.\nLenny (00:45:37):\nDo you have any other product building philosophies that you found especially useful in your time at Stripe, and Retool, and anywhere else?\nEeke de Milliano (00:45:45):\nI have a couple of, I guess, specific mental models that I use. The first is, build for your best user, not your worst user.\nEeke de Milliano (00:45:53):\nAnd what I mean by that is, I think it's actually really easy to get stuck, or to focus on, \"What if there's abuse of this product?\" Or think about all the ways in which the product won't be used well. And then you end up sort of shaping the product in these really weird funky ways to make up for that.\nEeke de Milliano (00:46:11):\nWhereas in reality, the worst users, they should be a fraction of your users anyway. So you shouldn't really be building for them.\nEeke de Milliano (00:46:19):\nI think a really good example of this is onboarding processes. Where, you're probably going to be building an onboarding process, where you're trying to collect a lot of data. Or trying to figure out, \"Hey, how do I help this user who maybe isn't well suited for my product to be successful?\"\nEeke de Milliano (00:46:37):\nReally, you should just be building an onboarding process for the user who's going to jump into your product and get it immediately.\nEeke de Milliano (00:46:42):\nI was thinking about this actually just the other day. Because we were in this product review, and we were talking about this other new product that we're thinking of exploring.\nLenny (00:46:48):\nMore products? It never ends.\nEeke de Milliano (00:46:52):\nYeah, exactly. And we're kind of going down this path of like, \"Oh, well if this gets really big, there's going to be all this abuse of the product.\" And Anthony, our founder was like, \"Wouldn't that be an amazing problem to have?\" And we're like, \"Yeah, that's a really good point.\"\nEeke de Milliano (00:47:03):\nSo we kind of put that on the back burner.\nLenny (00:47:07):\nThat's an interesting approach, because usually you're trying to optimize a flow, get more people through it, which are the least good users.You're saying you found more success just focusing...\nLenny (00:47:16):\nIs this more initially, focus on the users that will understand this, and be excited about it, and make that work really well. And then, over time, build on that?\nEeke de Milliano (00:47:23):\nYeah, totally. Yeah, sure. If you're going to look at the end, and you're trying to optimize, et cetera, absolutely. But in that sort of early product development stage, it's just not worth it to be too focused on that.\nLenny (00:47:33):\nGot it. Sweet.\nEeke de Milliano (00:47:34):\nSo, that's one. The other one, our head of design, Ryan, always kind of reminds us of is, build the scooter, not the axle.\nEeke de Milliano (00:47:44):\nSo if you're trying to build the minimum viable product for a car, don't build just the wheels and the axle, build the scooter first. And then from there, you build the bicycle, and the motorcycle, and then the car.\nEeke de Milliano (00:47:54):\nAnd it's always just such a good reminder. You always want to start building the whole thing. But really try and think about the slice that gets the customer to complete value on a smaller thing first.\nEeke de Milliano (00:48:06):\nSo with Retool Mobile for example, there's just so much you could be building there. And we decided very specifically, \"Hey, we're only going to build this for companies that have field workers and they would need to do inventory management.\"\nEeke de Milliano (00:48:18):\nAnd it's a very specific slice, but it helps get through from something that was actually viable, beginning to end.\nLenny (00:48:25):\nGot it. So it's an approach for MVPs, basically. Make something simple and functional, not just something barely... Not actually working, but getting you to some dream product eventually.\nEeke de Milliano (00:48:37):\nYeah. And then the last one is this idea of 70/20/10 split investments. I really think that a lot of product management can sometimes be reduced to funnels and portfolios.\nEeke de Milliano (00:48:51):\nSo the 70/20/10 investments model in my head is just like, 70% of your building time should really be going to your core product, that has product market fit. 20% of your time should be going to strategic initiatives that aren't core, but they're strategic to the company, that you know have to do them. And then, 10% of your time should be going towards bets.\nLenny (00:49:11):\nThat's actually exactly the same heuristic I've always used. One question there is, how do you think about maintenance and bugs within that?\nEeke de Milliano (00:49:19):\nYeah. To me, that falls squarely in the 70%. So yeah, core product, tech debt, sort of the maintenance mode type stuff. And core product, obviously you're also doing a bunch of new stuff there too.\nEeke de Milliano (00:49:31):\nBut yeah, no more than 70% of your resources should be going there.\nLenny (00:49:35):\nWhat did you say the 20% was?\nEeke de Milliano (00:49:37):\nStrategic initiatives that aren't your core, but you just know, based on your strategy, you have to do these things.\nLenny (00:49:45):\nGot it. So the way I break it up is, 20% is where I put bugs and maintenance. And then 10% was big, ambitious bets. So it was similar ratios, but different things go into the buckets.\nEeke de Milliano (00:49:56):\nCool.\nLenny (00:49:57):\nBut, let me ask a similar question. How do you, at Retool, and maybe even at Stripe, think about finding time to do maintenance and bugs? Do you build it into roadmaps? Do you set off time to just fix all the bugs? I know it's probably an evolution, and it goes back and forth. But, any thoughts?\nEeke de Milliano (00:50:11):\nYeah. This, I think, is really one of the trickiest parts of product management, in my mind.\nEeke de Milliano (00:50:18):\nWe don't have a company-wide sort of process on this. It's pretty team specific. Some teams do Friday bug bashes. Other teams are just, as products roll out, will work on them as they go.\nEeke de Milliano (00:50:33):\nI was actually speaking to a product manager at a different company, who mentioned that they just spent the last 18 months doing just product polish and bugs. And I think they landed in a place where they had to do it, because they just had so much debt. But luckily, we're not there yet.\nEeke de Milliano (00:50:54):\nRight now, we let most of the teams just kind of do it themselves and figure out what makes sense for them.\nLenny (00:50:59):\nOkay. Awesome. I wanted to go back to something that I've heard about Retool, that you all are really good at. Which is PM's being really close to customers. And I'm curious what you've done there, or what the team has done there, that it's been really effective?\nEeke de Milliano (00:51:13):\nWell, I do think every good product team figures out how to get close to customers. But just based off of my observations from Retool, and what I've seen at other companies, there are a couple things that are more pronounced at Retool than I've seen in a lot of other places.\nEeke de Milliano (00:51:28):\nThe first is, we have a lot of PMs who used to be in customer-facing roles, at Retool. I obviously am a big fan of that. I think there's just nothing like really understanding the value of your product, at the moment where a customer actually has to put money down. And so, I really like that about PMs, who have had those conversations with customers and they really get it.\nEeke de Milliano (00:51:53):\nSecond is, because the retail product is so technical... And I do think this just depends on what product you have. Our PMs are really, very technical. Everyone has either a CS degree, or has done some sort of engineering in the past.\nEeke de Milliano (00:52:06):\nThird is, we use Slack very heavily to talk to our customers and interact with them. So at this point, I think we have hundreds of Slack channels with customers. Every time we're testing a new product, or a new customer who's somewhat large, comes online. We will work with them in Slack, to get there off-the-cuff feedback, just back and forth. It's really nice. We just have this direct line to them, which is awesome.\nEeke de Milliano (00:52:34):\nAnd then, the fourth thing we do is, we use Retool to build Retool. So our product roadmap lives in a Retool app. And the app that we use to have feature flags for particular features, is a Retool app. So PMs are just in the product all day long, every day. They're their own customers in a lot of ways, and that really helps as well.\nLenny (00:52:57):\nWow, I didn't know that. That is very cool. So you build a task management product using Retool?\nEeke de Milliano (00:53:03):\nOh, yeah. Well, we built many... Basically, all of our internal tooling happens in Retool. Like, our PMs, all their team dashboards are in Retool. All of their task tracking is in Retool. Submitting linear requests or bug requests happens in Retool, and then goes to Linear. So yeah, it's how we run the company.\nLenny (00:53:23):\nYou haven't been able to replace Linear yet? That's cool. I'm a big fan of Linear.\nLenny (00:53:29):\nOkay, two more questions and then I'll let you go. One is around product growth. Which, I don't want to get too into. We've talked about it a bunch on this podcast.\nLenny (00:53:37):\nBut, it's interesting that Stripe was very product-led growth. It was just self-serve PMs, engineers, whoever, just started using it. It grew and became enterprisey down the road.\nLenny (00:53:49):\nRetool, on the other hand, I think people think it's product-led growth. I imagine it's actually sales-led, mostly.\nLenny (00:53:54):\nAnd so, I'm just curious what you've learned about the difference between building product and leading product teams within a sales-led org, versus a product-led org.\nEeke de Milliano (00:54:04):\nI have a couple of insights on that. One interesting insight is that, teams that have one always want the other.\nLenny (00:54:10):\nThat's so true.\nEeke de Milliano (00:54:12):\nWhenever I talk to candidates, I feel like you can always tell what their company has, because they'll be asking a lot of questions about the opposite. If they're probably a growth company they'll be like, \"Well, how are you guys thinking about Enterprise?\"\nEeke de Milliano (00:54:24):\nAnd then, if they are more of a sales-led growth company, they're like, \"Well, how are you guys thinking about your self-serve motion, or your product-led growth?\"\nEeke de Milliano (00:54:31):\nAnd my main takeaway, just in... And I don't know if I would even use the dichotomy of product-led growth, or sales-led growth, with Retool. I think we do have a lot of product-led growth. But we work with a lot of enterprise customers, and a lot of our revenue comes from enterprise customers, and we have a fantastic sales team.\nEeke de Milliano (00:54:49):\nAnd I think the main thing is that, you just have to really figure out your interaction mechanisms with sales. And that just has to be so, so tight.\nEeke de Milliano (00:55:00):\nAnd it goes in both directions. There's obviously, how you get feedback from them, because they are so often on the front lines talking to customers. Moreso than product managers, even.\nEeke de Milliano (00:55:08):\nBut it also goes the other way. If you are going to ship something, or if you are going to put out a roadmap, like, \"How do you make sure that the sales team has everything that they need...\" The sales, and in Retool's case, the success team and the support team, \"Has everything they need to accurately talk to customers about that?\"\nEeke de Milliano (00:55:26):\nAnd I've always actually found that really hard, because it's really hard to figure out the right altitude. If you're giving a presentation on the roadmap, people are either going to feel like it's too high level. Or, it's too low level for folks who maybe are new.\nEeke de Milliano (00:55:40):\nSo this year, we're actually trying something different. We are doing a science fair. Where, each product team has a little booth. And they get to stand there, and anyone who has questions about the product can come... You know, from the go-to-market side, can come and ask questions, and get demos, and go as deep as they need to.\nEeke de Milliano (00:55:57):\nSo, I'll let you know how that goes. But I'm excited to experiment with it.\nLenny (00:56:04):\nOkay. Are there going to be foam core boards, and will there be ribbons?\nEeke de Milliano (00:56:08):\nThere may be prizes. Who knows?\nLenny (00:56:10):\nOh my God. I can't wait to see a picture of this. Final topic. You have this concept that you call the product talent portfolio. What does that mean, and how have you found that useful in your product leadership life?\nEeke de Milliano (00:56:25):\nYeah. Yeah, it's back to like, all of product management is portfolios and funnels.\nEeke de Milliano (00:56:29):\nI think it's really tempting as a manager, to build a team in your image, because you understand their skillsets and you value those skillsets. And you're going to be able to detect and assess those skillsets better.\nEeke de Milliano (00:56:43):\nBut the best product teams, in my mind, have really figured out how to balance the talent portfolio. So instead of having a bunch of PMs who all spike in one particular area, figure out how you can create complimentary skillsets for the whole PM team, so the whole is much stronger.\nEeke de Milliano (00:57:04):\nAnd one way in which I like to do that is, I really like to balance product teams with homegrown product managers, who really get the product. They've probably been in it. They're amazing culture carriers, often. They really set the tone. But they may not have seen product management at other companies, and they may not have some of the more conventional and traditional product management skillsets.\nEeke de Milliano (00:57:25):\nSo I want to balance that with product managers who've come from other companies, and have done it, and can bring a little bit more of that product manager rigor. Even though they don't have, in the Retool case, the core Retool product management vibe.\nEeke de Milliano (00:57:41):\nSo, that's one example. I think there's others as well. Some PMs are just incredible execution machines. Other PMs are amazing visionaries. You kind of want a little bit of all of them.\nEeke de Milliano (00:57:51):\nAnd you want to also balance within all of your different pillars. So we have three different sort of product pillars at Retool, and there's leads for all those pillars. And I always push the leads to hire people who don't look like them, so that we have balance everywhere.\nLenny (00:58:08):\nI love that. Do you, actively, as you're hiring, \"Hey, well you're strong in these areas. Here's the person we need, here. We want this specific, super strategy minded person.\" Is that actually how you think about this?\nEeke de Milliano (00:58:20):\nYeah. I do a little personal exercise for myself every six months, where I chart out the team that we have today, and write down all of the strengths that we have, all of the weaknesses that we have, as a team. And then I try to hire specifically for those weaknesses.\nLenny (00:58:35):\nAmazing. Any last pieces of wisdom or thoughts, before we get to our very exciting lightning round?\nEeke de Milliano (00:58:42):\nI think that's it on my end.\nLenny (00:58:43):\nOkay. We got through everything I was hoping to get through.\nLenny (00:58:46):\nSo with that, we've reached our very exciting lightning round. I've got six questions for you. Are you ready?\nEeke de Milliano (00:58:52):\nI'm ready.\nLenny (00:58:53):\nWhat are two or three books that you recommend most, to other people?\nEeke de Milliano (00:58:57):\nBird by Bird: Instructions on Writing and Life by Anne Lamott. It's incredible. So touching. Really, really great. Also, I think product managers should be great writers. So, I love that.\nEeke de Milliano (00:59:08):\nAnd then the other book that I was going to say, but I'm glad you mentioned Claire, is Claire's book, Scaling People, which is coming out. I had a very small hand in ghost writing for her a little bit, in the first draft. So I use a lot of the early chapters from that book still, in management. And I still recommend the tactics in there, so I'm excited for her to get it out.\nLenny (00:59:29):\nWow. I've been hearing about ghost writing as a career recently, and it feels like it could be an option for you down the road.\nLenny (00:59:36):\nI'm excited to read the book. I haven't gotten a copy yet. I think you could pre-order it now, and we'll link to it in the show notes.\nEeke de Milliano (00:59:41):\nNice.\nLenny (00:59:42):\nWhat's a favorite other podcast that you like to listen to, other than maybe the one you're on right now?\nEeke de Milliano (00:59:46):\nYeah, this one's great. I can't choose between these two, though. One is Lex Fridman. And then the other is EconTalk by Russ Roberts. I really like that both of them are... Their agenda is curiosity, which I love.\nLenny (00:59:59):\nTotally resonate there. What is a favorite recent movie or TV show that you've enjoyed?\nEeke de Milliano (01:00:04):\nIs it too basic to say White Lotus?\nLenny (01:00:07):\nCool. That's the most mentioned one, which says a lot, right? That just says how good that is, because I love it too. But, that works. Season one or season two?\nEeke de Milliano (01:00:17):\nOh, season two, all the way.\nLenny (01:00:19):\nYeah, same. I'm excited for season three. No spoilers. Favorite interview question that you like to ask candidates?\nEeke de Milliano (01:00:27):\nTo what do you attribute your success? And you can't say luck.\nLenny (01:00:32):\nInteresting. Because most people look for, do they believe it's luck, versus their innate skill? So you don't even allow them to say luck? Interesting.\nEeke de Milliano (01:00:41):\nYeah. Because I think humble people will always say luck in some way. And I always kind of wanted to know, \"How self aware are you, and how curious are you?\"\nEeke de Milliano (01:00:51):\nAnd I think people who have really gone back and reflected on why are they where they are today, really says a lot about how they think about the world.\nLenny (01:01:03):\nI love that. What are some SaaS tools that you love, or use often, at your current company, or anywhere else?\nEeke de Milliano (01:01:08):\nYeah. Well, first and foremost, it's Retool. And then, the other SaaS tools that we use a lot, Slack, Gong, Linear and FullStory.\nLenny (01:01:18):\nAwesome. Favorite new product that you found, maybe in life, maybe at work?\nEeke de Milliano (01:01:24):\nYeah. Have you heard of Rewind?\nLenny (01:01:27):\nYes, I have it running right now.\nEeke de Milliano (01:01:31):\nNice. Yeah. I mean, I think it's really incredible what they've done.\nLenny (01:01:35):\nMaybe describe it briefly, just so folks know what that is.\nEeke de Milliano (01:01:38):\nIt basically records everything that you're doing on your computer and then makes it really easy for you to search it. Which, it's just incredible. I don't know if you work this way, Lenny. But I feel like nowadays, I don't really go to tabs anymore. I kind of directly search for the thing that I'm searching for. And I think Rewind just fits that user behavior so, so well.\nLenny (01:02:06):\nAmazing. Eeke, this was so much fun. We got through everything I was hoping for, and more.\nLenny (01:02:09):\nTwo final questions. Where can folks find you online if they want to reach out, learn more, see what you're up to? And, how can listeners be useful to you?\nEeke de Milliano (01:02:16):\nDefinitely find me online on Twitter. It's @EekeDM. And, how can they help us? Try out the Retool product and give us some feedback.\nLenny (01:02:25):\nAmazing. Retool.com, right?\nEeke de Milliano (01:02:25):\nYes.\nLenny (01:02:26):\nAwesome. Thank you again, for being here.\nEeke de Milliano (01:02:28):\nThanks, Lenny.\nLenny (01:02:31):\nThank you so much for listening. If you found this valuable, you can subscribe to the show on Apple Podcasts, Spotify, or your favorite podcast app.\nLenny (01:02:39):\nAlso, please consider giving us a rating or leaving a review, as that really helps other listeners find the podcast. You can find all the past episodes or learn more about the show, at LennysPodcast.com. See you in the next episode.\n",
  "companies": [
    "Twitter",
    "Slack",
    "Atlassian",
    "Amazon",
    "Uber",
    "Lyft",
    "Square",
    "Apple",
    "Notion",
    "Airbnb",
    "Zoom",
    "Stripe",
    "Linear"
  ]
}