{
  "episode_name": "Melanie Perkins",
  "filename": "Melanie Perkins.txt",
  "segments": [
    {
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:00:00)",
      "timestamp_seconds": 0.0,
      "content": "There's a very famous story about Canva. Early on,"
    },
    {
      "speaker": "you pitched over a hundred investors and over a hundred investors said no to you.\n\nMelanie Perkins",
      "timestamp": "00:00:06)",
      "timestamp_seconds": 0.0,
      "content": "It was really clear in my mind that it was the future and I thought the investors were wrong, frankly. But investors also gave really helpful feedback and feedback. Often in the form of rejection, they would say, \"Oh, your market's not big enough,\" and I would say, \"It's going to be huge.\" And I'd add a new page in my pitch deck that said how big the market I believe was, and then they'd say, \"You're the same as some of other company.\" And I would say, \"Hey, now I've got a new slide in my pitch deck that shows all the players and the huge gap in the market that we believe we're going to fill.\""
    },
    {
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:00:33)",
      "timestamp_seconds": 0.0,
      "content": "One of your values,"
    },
    {
      "speaker": "Crazy Big Goals. I love that as a value.\n\nMelanie Perkins",
      "timestamp": "00:00:35)",
      "timestamp_seconds": 0.0,
      "content": "The thing that I love about a crazy big goal is that you feel completely inadequate before it. You want to work really hard to will it into existence. I really like to start by just imagining what is the future that you actually want Right now? I have a wall in my house in my office, which is my vision for what I'd like the world to look like in 2050."
    },
    {
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:00:52)",
      "timestamp_seconds": 0.0,
      "content": "I heard from one of your team members, Melissa Tan,"
    },
    {
      "speaker": "there's a deck like this for every project you kick off. There's this big vision deck.\n\nMelanie Perkins",
      "timestamp": "00:00:59)",
      "timestamp_seconds": 0.0,
      "content": "So we have this concept of chaos to clarity. Every idea starts in the chaos side, and then you have to work all the way to the other side, which is clarity. That very first step at the far end of chaos was quite an embarrassing step actually,"
    },
    {
      "speaker": "because you don't have mastery at that point. You don't have all the answers.\n\nLenny Rachitsky",
      "timestamp": "00:01:14)",
      "timestamp_seconds": 0.0,
      "content": "A lot of people think of Canva as like design graphics for social media and marketing and things like that, but you also have spreadsheets, whiteboards, charts,"
    },
    {
      "speaker": "AI coding tool.\n\nMelanie Perkins",
      "timestamp": "00:01:24)",
      "timestamp_seconds": 0.0,
      "content": "Was funny,"
    },
    {
      "speaker": "looking back from really old decks. We were trying to do AI before AI was actually a thing.\n\nLenny Rachitsky",
      "timestamp": "00:01:30)",
      "timestamp_seconds": 0.0,
      "content": "Today my guest is Melanie Perkins, CEO and co-founder of Canva. Melanie is on track to be the most successful female tech founder in history and one of the most successful founders, period. Canva is currently valued at over $42 billion, making over $3.3 billion in revenue a year. They've been profitable for eight years straight and are one of the hottest private tech companies in the world right now. But it wasn't always this way. Melanie was rejected by over 100 investors when she was trying to raise her first round. Their team spent two years rewriting their entire code base and were unable to ship any new features for over two years, something they expected to just take six months, and they even went through a big pivot early on from a yearbook publishing platform to the Canva that you know today,"
    },
    {
      "speaker": "Melanie does not do a lot of podcasts. She shares stories that I've never heard before and lessons that I'm still thinking about.",
      "timestamp": "00:02:21)",
      "timestamp_seconds": 0.0,
      "content": "This is a really rare opportunity to learn from a legendary founder. A huge thank you to Cameron Adams and Melissa Tan for suggesting topics for this conversation. Enjoy this podcast. Don't forget to subscribe and follow it in your favorite podcasting app or YouTube. And if you become an annual subscriber of my newsletter, you get a year free of 17 incredible products, including Devon, Lovable, Replit, Bolt, Encodia and Linear, Superhuman, DescriptUs, Flowgama, Perplexity, Warp, Granola, MagicPattern, DarkCast, ChatGPT and Mobbin. Head on over to lennysnewsletter.com and click product pass. With that, I bring you Melanie Perkins after a short word from our sponsors. My podcast guest, and I love talking about craft and taste and agency and product market fit. You know what we don't love talking about? SOC 2. That's where Vanta comes in. Vanta helps companies of all sizes get compliant fast and stay that way with industry leading AI,"
    },
    {
      "speaker": "automation and continuous monitoring.",
      "timestamp": "00:03:14)",
      "timestamp_seconds": 0.0,
      "content": "Whether you're a startup tackling your first SOC 2 or ISO 27001 or an enterprise managing vendor risk, Vanta's trust management platform makes it quicker, easier, and more scalable. Vanta also helps you complete security questionnaires up to five times faster so that you can win bigger deals sooner. The result. According to a recent IDC study, Vanta customers slashed over $500,000 a year and are three times more productive. Establishing trust isn't optional. Vanta makes it automatic. Get $1,000"
    },
    {
      "speaker": "off at vanta.com/lenny.",
      "timestamp": "00:03:50)",
      "timestamp_seconds": 0.0,
      "content": "Last year, 1.3% of global GDP flow through Stripe. That's over $1.4 trillion. Stripe helps ambitious founders start companies and scale them from pre-seed to IPO and beyond. Used by 78% of the Forbes AI-50 Stripe provides financial infrastructure for payments, billing and software to platforms and marketplaces so they can monetize faster, experiment with pricing and grow revenue. With Stripe, businesses achieve massive global scale faster than they would otherwise. And at the beginning of that journey is where Stripe Startups comes in. Stripe Startups is a program designed to support early-stage venture-backed businesses as they build, iterate and scale. Founders enrolled in Stripe Startups get access to credits to offset Stripe fees, expert insights,"
    },
    {
      "speaker": "and a focused community of other founders building on Stripe. You can learn more and apply for the program today at stripe.com/startups.",
      "timestamp": "00:04:49)",
      "timestamp_seconds": 0.0,
      "content": "Melanie,"
    },
    {
      "speaker": "Thank you so much for having me. I'm excited to be here.\n\nLenny Rachitsky",
      "timestamp": "00:04:55)",
      "timestamp_seconds": 0.0,
      "content": "I'm even more excited. It's such an honor to have you here. I am such a fan of yours. I'm such a fan of the company that you've built. Also just everyone I meet from Canva is just so nice and so awesome and so smart, and so clearly you've built something really special. I'm really excited to use this hour to learn as much as I can from you about how you did that. We were actually chatting ahead of this about what would make the best use of this hour. I asked you what you believe has been the biggest factor in the success of Canva. You described something called building a Column B company and Column B thinking, I've never heard of this before, so let us start there. What is building Column B company, what does that mean?"
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "00:05:35)",
      "timestamp_seconds": 0.0,
      "content": "Really great place to start. So I guess there's two ways of planning. The way that you can plan is you can dream of what is the perfect vision of the future, what future do you want to exist in, what would you like the world to look like? What would you like companies to look like? And then going from there, which is completely improbable, a completely crazy big dream, and then working hard to turn that into reality. And the alternate is, so just imagine you are building a castle on the hill and you're like, \"What would be the most magical, wonderful, mythical experience?\" And the other thing you can do is you can look at the bricks around you and you can say, \"What can I do with these bricks? How high can I stack them? What can I do?\" And I think most planning is often done by looking at the bricks and trying to stack them, and then you can create only so much. And so I guess the column B thinking is thinking about what is that magical wonderful future that you then want to invest years and decades of your life actually building?"
    },
    {
      "speaker": "Exactly that.\n\nLenny Rachitsky",
      "timestamp": "00:06:45)",
      "timestamp_seconds": 0.0,
      "content": "This is exactly the way actually Brian Chesky thought. I worked at Airbnb for a long time and it was always just, \"Think about the world, the dream and then work backwards from that,\" so there's a lot clearly also worked out. So clearly this is an important lesson in the example of Canva, just what would've been column A for what Canva could have been and how did you think about the column B approach of what Canva in a dreamland could be?"
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "00:07:07)",
      "timestamp_seconds": 0.0,
      "content": "So column A would've been nothing frankly, because the reality was when I was a university student with no company and no business or product or software experience, the reality would've been not very much. And so it was all column B, it was all thinking about the wild future that we wanted to create. Imagine what would be publishing in the future, what would communications look like in the future? And it seemed really impossible that it would stay on the desktop, it would stay really complicated. And it just seemed so apparent to me that in the future it was going to be completely different. Could I build that future? I had absolutely no idea, but the idea, it seemed completely likely, completely improbable that it wouldn't be the case that in the future, design would be online and collaborative and really simple. And so starting from that, we then took that concept and applied it to the school yearbook market in Australia with our first company Fusion Books. And then we applied it to Canva where we wanted to take it much,"
    },
    {
      "speaker": "much bigger.\n\nLenny Rachitsky",
      "timestamp": "00:08:08)",
      "timestamp_seconds": 0.0,
      "content": "Let's talk about just how to actually go about building a Column B company. Say a founder is listening to this and they're just like, \"Okay, I want to do this.\" What do they do? What are the steps? Where do you start?"
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "00:08:17)",
      "timestamp_seconds": 0.0,
      "content": "I really like to start by just imagining what is the future that you actually want? What is the world that you want to live in? What is the future of transportation? What is the future of healthcare? What is the future that you want to live in and exist in? And for example, right now I have a wall in my house in my office, which is my vision for what I'd like the world to look like in 2050. And so it's not necessarily that you can bring that into existence or you can will that into existence, but just to start to get clearer on what you would like that world to be like. Would you like it to be more inclusive? Would you like it? For me,"
    },
    {
      "speaker": "one of the things I desperately want is everyone on this planet to have their basic human needs met.",
      "timestamp": "00:08:56)",
      "timestamp_seconds": 0.0,
      "content": "What are those things that you believe are so important that you would love to see exist in that future? And I think an exercise we often do is what is wild success for X, or what is wild success for Y? And then equally, what is terrible failure for those things? And you can apply that just to abstract thinking in different industries. You can do that, apply that. We do that for the whole company for different areas of the company. And I think just taking that very long timescale of 10 years and getting a really crisp idea of what you want, of what you don't want,"
    },
    {
      "speaker": "that's sort of the first step. And I think a lot of people don't spend quite enough time imagining that. And then the next part is you don't want to just have this crazy big dream and then do nothing about turning it into reality.",
      "timestamp": "00:09:43)",
      "timestamp_seconds": 0.0,
      "content": "You kind of want to have a ladder that goes all the way up to the moon, which is your crazy, wild vision. And then you want to have rungs that just work its way up step by step. And so you want to get that really clear picture of the future that you would like and then just take little step, after little step, after little step. And it doesn't matter how small that first step is or how seemingly inconsequential if it is working towards that future that you want to will into existence,"
    },
    {
      "speaker": "then you'll keep on climbing up that ladder in the right direction.\n\nLenny Rachitsky",
      "timestamp": "00:10:10)",
      "timestamp_seconds": 0.0,
      "content": "I think a lot of people hearing this might feel like, \"I do this. Yeah, I have a vision. I know where I'm going. I have this big idea.\" What do you think they might be missing about just what this actually means and why they're probably not thinking big enough,"
    },
    {
      "speaker": "they're not making the time to think this.\n\nMelanie Perkins",
      "timestamp": "00:10:23)",
      "timestamp_seconds": 0.0,
      "content": "I think it is easy to be discouraged by the two, because they're completely two complete odds. They're completely different ends of the spectrum. So one is dreaming about the future, not that you think you can will into existence, it's just the future that you want. And then the next part is taking the tiny step that might be extremely microscopic and it feels a little embarrassing to be like, \"I want a future that is,\" whatever it might be. And then to take such a microscopic step because I think you often have the future in one side or don't spend much time thinking about that. You're just thinking about the bricks before you. And so I think it's also naturally we all get distracted by day-to-day. It's your email, your Slack, the things that are kind of in your face,"
    },
    {
      "speaker": "the reality that lives around you every day that kind of pulls you into this moment right now.",
      "timestamp": "00:11:14)",
      "timestamp_seconds": 0.0,
      "content": "And so I think actually just making time to spend thinking about that is probably one of the most critical pieces. Just literally dreaming what is wild success in 10 years, what is terrible failure in 10 years is a really great place to start, is just spending some time there. And then even if that is so big and so vast and so wild, having that very first step is so important because then you take that little tiny first step and then the next step then that compounds for us,"
    },
    {
      "speaker": "it's been compounding over a decade as we continue to work towards that same mission and vision.\n\nLenny Rachitsky",
      "timestamp": "00:11:49)",
      "timestamp_seconds": 0.0,
      "content": "I want to hear how you operationalize this. I heard from one of your team members, Melissa Tan, that there's a deck like this for every project you kick off. There's this big vision deck. Talk about what that looks like, because I think that's where people are like, \"Okay, how do I actually do this?\""
    },
    {
      "speaker": "Talk about that deck.\n\nMelanie Perkins",
      "timestamp": "00:12:04)",
      "timestamp_seconds": 0.0,
      "content": "So we have this concept of chaos to clarity and every idea starts in the chaos side, and then you have to work all the way to the other side, which is clarity. And so chaos can be an idea, it can be a problem, it can be a philosophy or a belief. And I've got a joke that I find funny. I'm not sure if you will, but how do you go from chaos to clarity? You add clarity. And so the idea is that each little step from chaos to clarity is the very first step might be literally writing it down. So rather than it being in your head, you've written it down, then the next step might be starting to create a pitch deck on it. And the next step might be starting to refine that, turning it into some designs, turning into a prototype. And then as it kind of goes from chaos to clarity, it starts to become more and more real and more and more people can see it. And so just taking those little incremental steps that adds clarity with every single step, then starts to help will it into existence rather than it being something that's completely amorphous and just stays in your head. So I think that's why visual communication for us is so important, is because otherwise, if it's just in your head,"
    },
    {
      "speaker": "no one else can see it and you can't will it into existence.\n\nLenny Rachitsky",
      "timestamp": "00:13:13)",
      "timestamp_seconds": 0.0,
      "content": "This makes me think about this concept of an ugly baby from the book, Creativity Inc., by I think Ed Catmull where he talks about how new ideas or this ugly baby that nobody wants to look at and deal with that I think he says they want to kill. I don't know why you would do that with an ugly baby. But there are these very soft, fragile things and it's really important to not kill them early and give them a chance to survive. And it's kind what I'm hearing here is have this big vision that many people are be like, \"No, wait. This is completely absurd.\" And I love this idea of, \"Okay, but here's one step we could take there to see if this could be a thing.\""
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "00:13:48)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, I completely agree. And I think that's the thing is that that very first step at the very far end of chaos, it's very embarrassing because you're like, \"I have this idea that is so big and so wild and how the hell would I do that? I have no idea.\" And so it's quite a embarrassing step, actually, because you don't have mastery at that point. You don't have all the answers. In fact, you have likely none of the answers, but you just have the idea that you think would be cool. And ideally you get the idea that it would be so cool that you want to work really hard to will that into existence. And so I think one of the really key parts is not only just having the idea but thinking it's so cool that you're going to work for years to will it into existence. Actually Melissa did a really amazing pitch deck recently about the vision of, I won't go into the details right here, but the vision of her space and I was really excited about it. And so I think that that's the great thing about a pitch deck,"
    },
    {
      "speaker": "is that other people can see your thinking and your thinking actually gets clarified as well as you go through that process.\n\nLenny Rachitsky",
      "timestamp": "00:14:50)",
      "timestamp_seconds": 0.0,
      "content": "I talked to Melissa, I talked to a bunch of other people that work at Canva, that have worked at Canva, and something else I heard along these lines is this phrase, Crazy Big Goals, which I think is one of your values. Crazy Big Goals. I love that as a value. Why is that so important? How does that fit into this?"
    },
    {
      "speaker": "And just talk about the power of having Crazy Big Goals.\n\nMelanie Perkins",
      "timestamp": "00:15:08)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, so right from the start of Canva, it was truly a crazy-big goal. We're like, \"We want to empower the world of design and take all these things that are super complicated and put them into one platform and make it accessible to the whole world. And we want to, rather than it be super expensive and unaffordable, we want to empower everyone everywhere in the world to design.\" So I mean, that was the epitome of a crazy big goal. And if we macro out even further, we've got this two-step plan, build one of the world's most valuable companies and do the most good we can do. So again, a rather crazy big goal. And I think the thing that I love about a crazy big goal is that you feel completely inadequate before it. Another crazy big goal. We'd love to see everyone's basic human needs met on the planet. Completely crazy big, that truly shouldn't be. It's kind of absolutely absurd that that's the case,"
    },
    {
      "speaker": "but we can go into that later.",
      "timestamp": "00:16:02)",
      "timestamp_seconds": 0.0,
      "content": "But I think with a crazy big goal, then you want to work really hard to will it into existence. And so if you start with a reasonable goal or a realistic goal, then you kind of get to it and you're like, \"Oh cool, whatever.\" Or more importantly, if something happens, all the problems and roadblocks come along as they always do, then you're like, \"Okay, I won't bother with that.\" And then you can just go and choose another course. And so a crazy big goal is both crazy big,"
    },
    {
      "speaker": "but it's also something that you think is incredibly important that you actually want to will into existence because it is so much work to will a crazy big goal into existence. So it better be one that you want to actually achieve.\n\nLenny Rachitsky",
      "timestamp": "00:16:45)",
      "timestamp_seconds": 0.0,
      "content": "Is there a crazy big goal that you set that comes to mind maybe as a good example of, \"This is what I'm talking about?\" Maybe a product you launched or feature back in the day?"
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "00:16:53)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, I mean so many things. So we have our mission to empower the world to design and we break it down into mission pillars. So empower everyone to design anything with every ingredient in every language on every device, obviously a mouthful. But then what we do is we take successive goals every year towards this mission. And so for designing anything, we started off with social media and presentations and docs and websites and whiteboards and video. And so every year we're just launching more and more things to fulfill that part of the mission of empowering everyone to design anything. And then equally in every language we started in English and then it was Spanish and then it was 20"
    },
    {
      "speaker": "languages and then a hundred languages and then hard languages like Arabic and Hebrew and Urdu and right to left languages. And now we're in a hundred plus languages now and now we're really doubling down on the localization experience to make it feel truly local in every market around the world.",
      "timestamp": "00:17:47)",
      "timestamp_seconds": 0.0,
      "content": "And so you can see how having these very big, audacious goals that you then just take a step after step towards helps then will it into existence or on every device. We started off obviously just with a web platform and then we launched our iPad app and then iPhone and then Android and then we spent years investing in cross-platform. So we have the same feature set across every device. And so you can see how these big amorphous things that seem very outlandish,"
    },
    {
      "speaker": "I see how all this is starting to fade together. There's this big crazy ambitious vision and below there are the mission pillars that are feeding into this vision and then the Crazy Big Goals within each of those mission pillars to measure your progress towards all these components of the mission.\n\nMelanie Perkins",
      "timestamp": "00:18:32)",
      "timestamp_seconds": 0.0,
      "content": "Exactly,"
    },
    {
      "speaker": "exactly.\n\nLenny Rachitsky",
      "timestamp": "00:18:34)",
      "timestamp_seconds": 0.0,
      "content": "Okay, so with all that in mind, there's also this kind of trade-off you have to make of just how ambitious you get because oftentimes sometimes maybe you never miss the goal, but many times people miss these very ambitious goals. How do you just find that balance between ambitious crazy but doable enough where people don't get discouraged?"
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "00:18:51)",
      "timestamp_seconds": 0.0,
      "content": "I think with a crazy big goal, the thing we have been really great at is achieving them. The timeframe that we achieve them on has not always been very reliable. We have certainly not been able to have pin dart. What's it?"
    },
    {
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:19:07)",
      "timestamp_seconds": 0.0,
      "content": "Bullseye?"
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "00:19:08)",
      "timestamp_seconds": 0.0,
      "content": "We have not been very accurate with timing, but it's really interesting. I look back at a 2021 vision deck that we made obviously in 2021, but it was about 2026 and it was fascinating to see how much we'd actually been able to achieve from that vision deck and how many things were currently still in flight. And so by having that, I thought in 2021, some of those things may have happened a little quicker, but over the last five years they've really been coming into reality. And so we might think things are going to take six months and they take a year. We might think things are going to take six months and they take two years. This has been the case. We might think something's actually going to take our entire lifetime as some of those really truly Crazy Big Goals. And in fact, I don't even know if we can ever achieve them frankly. But they're such an important goal that even if you make a little step in their direction,"
    },
    {
      "speaker": "they're worthwhile nonetheless.\n\nLenny Rachitsky",
      "timestamp": "00:20:01)",
      "timestamp_seconds": 0.0,
      "content": "Whether you like him or not, Elon, this is similar to his, if you watch him, he sets these really ambitious goals and then often is far late on achieving them,"
    },
    {
      "speaker": "but clearly it has worked out in achieving the crazy things that he's achieved. Something else I hear is you celebrate these goals in a really unique way. Talk about that.\n\nMelanie Perkins",
      "timestamp": "00:20:18)",
      "timestamp_seconds": 0.0,
      "content": "So when we have these Crazy Big Goals, we also have couple them with really fun celebrations. And so we attempt to make the Crazy Big Goals happen in a moment in time. So then when we achieve them, we actually have a really fun moment because if you're just trying to plod towards the top of the mountain always and you never take a little moment to pat yourself on the back,"
    },
    {
      "speaker": "it would feel a little arduous. And so over the years we had all sorts of fun little celebrations where we have smashed great plates and released doves and had a La Tomatina festival.",
      "timestamp": "00:20:51)",
      "timestamp_seconds": 0.0,
      "content": "All sorts of fun things just to take a moment with the team to celebrate that huge achievement. And so I think that you want to celebrate what you want to really focus on and what you want everyone to take that moment. So when you achieve that crazy big goal when we launch in Spanish, when we hit a hundred languages and then the so forth across the company, taking that moment to actually pat yourself on the back and pat the teams on the back and say, \"Hey, we did this thing. That thing that seemed really hard, we've now achieved.\" And the mission is often each of the different mission pillars, they're obviously a long area of investment that's going to take a long time to get to,"
    },
    {
      "speaker": "We need to bring that one back. We haven't done that one in a while.\n\nLenny Rachitsky",
      "timestamp": "00:21:49)",
      "timestamp_seconds": 0.0,
      "content": "That's a good one. I just love how concrete you're making this. So it's set these Crazy Big Goals, confine the component of the goals, set numbers there and then figure out the kind of steps you take to achieve these things. All fail is very easy. On the flip side of that, this is a segue. People hear these stories, they hear your story, they see Canva over the years and it's just this up into the right huge success story, one of the most successful companies in history. I imagine there have been many periods where things weren't going so great and when maybe things didn't look like they would work out. So let me just ask you this over the course of building Canva, once it started to click and started to feel like it was going to be a thing, was there a point where it started to again feel like, \"Wow, maybe this may not work out. Maybe there's a huge setback that we may not get over?\""
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "00:22:35)",
      "timestamp_seconds": 0.0,
      "content": "I think it's just a constant evolution. Every time the company doubles in size, pretty much all your systems break, all the things that were working don't work. A little example, in the early days we'd stand up and everyone would present their goals, what they're working on every day, every week. And then it kind of moved every month and then it was just taking too long because we've got so many people. And then it was sort of like we'd started doing these things called season openers and season openers were really fun where we got the entire company together, we talked about the goals that we'd achieved. And it was so funny because ahead of season openers,"
    },
    {
      "speaker": "everyone would launch everything because they wanted to do it ahead of the season opener. And then we'd also set the goals for the coming cycle for the coming season at that point in time.",
      "timestamp": "00:23:17)",
      "timestamp_seconds": 0.0,
      "content": "But then they started to become six hours long because we had so many people and so many teams. And so trying to find that right with the same philosophies of deep context for everyone with the same philosophies of the celebrations and the goals and trying to find that right flavor at every stage of scale is definitely hard. And so I think it's just a constant work in progress. Or back to your earlier point about timing of things, we were doing a front-end rewrite and we thought it would take about six months. It was really important because it was critical for cross-platform. It was critical for right to left. It was critical because we could only have five people working in our editor at any point in time because of the way the code base was structured and we thought it was going to take six months and then it took two years and it was two years of not shipping any product,"
    },
    {
      "speaker": "two years of a product company not being able to ship product.",
      "timestamp": "00:24:14)",
      "timestamp_seconds": 0.0,
      "content": "And that is such a core motivation for our team. He's shipping something, seeing great customer feedback and that kind of makes everyone feel happy and you've got momentum and it just felt like we're in a dark, dark tunnel that we could hardly see the end of the tunnel. And we didn't really know how long it was going to take because it just had to take as long as the tunnel was going to take. And it was a very hard time because other people would be launching this and that. And it was eventually we got out of that tunnel and it was extremely important that we did that work. We've now got two and a half thousand engineers and we're able to deliver amazing things that would've just been completely infeasible and simultaneous collaboration, so many things were baked into this. But yeah,"
    },
    {
      "speaker": "For two years.\n\nLenny Rachitsky",
      "timestamp": "00:25:17)",
      "timestamp_seconds": 0.0,
      "content": "I feel like every builder listening to this knows exactly what you've been through and maybe not on that scale in those stakes, but you start on something, \"Oh yeah, it'll take a few weeks,\""
    },
    {
      "speaker": "Totally.\n\nLenny Rachitsky",
      "timestamp": "00:25:29)",
      "timestamp_seconds": 0.0,
      "content": "Just was the mood really, I don't know, sad internally? Two years, that's a long time not to ship anything. Just what was it like internally during that period?"
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "00:25:39)",
      "timestamp_seconds": 0.0,
      "content": "I think it was kind of everything internally. We made it into a bit of a game. We had this game board and I bought these little rubber ducky sort of bath toys and we had, so we all the little components represented as a bath toy on this board and there was all these stages of went launched in product. There was an emergency lane at the end of it was home and hosed. And we did these weekly stand ups where everyone would come in and talk where their bath toy was at and just, we tried to make it fun for the team. So it was partly fun and it was partly distressing as all of our investors were like, \"Hey, that thing.\""
    },
    {
      "speaker": "So I think it was both things at the same time. It was bonding let's say.\n\nLenny Rachitsky",
      "timestamp": "00:26:30)",
      "timestamp_seconds": 0.0,
      "content": "Okay. Speaking of investors, speaking of other hard times, there's a very famous story about Canva. Early on you pitched over a hundred investors and over a hundred investors said no to you when you were just starting Canva. I think that's important. The investors than any founder I've talked to actually tries to pitch. It's impressive you tried that hard and went for so many pitches and finally got someone to take a bet. Now you are something like a $40 billion company making 3.3 billion ARR. I think there's something like $240 million monthly active users, one of the hottest private companies in the world. Just how does this feel?"
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "00:27:06)",
      "timestamp_seconds": 0.0,
      "content": "I don't know. It was really clear in my mind that it was the future and I thought the investors were wrong, frankly. But investors also gave really helpful feedback and feedback often in the form of rejection. So they would say, \"Oh, your market's not big enough.\" And I would say, \"It's going to be huge.\" And I'd add a new page in my pitch deck that said how big the market I believe was. And then they'd say, \"You're the same as some other company,\" coupled with rejection, and I would say, \"Hey, now I've got a new slide in my pitch deck that shows all the players and the huge gap in the market that we believe we're going to fill.\" Or most investors just knew absolutely nothing about design or the industry that we're in. And so we then ended up with the first few slides saying, \"Here's the lay of the land today. Here's the problem that we're going to solve.\" (00:27:53): And so while it was extraordinarily frustrating, their feedback made us stronger and made our pitch deck stronger. And it was sort of from that chaos to clarity. At the start it was this idea and then through the copious amounts of rejection, the pitch deck got stronger and more refined. So then when people, the first time I remember I spoke to someone for hours and they eventually got it. They were really committed to understanding what we were trying to do, but then not everyone has six hours to understand a concept. And so being able to take all the gems of wisdom from that conversation and have that understood really clearly in a really short period of time and have all of the reasons that people were rejecting us pre-answered in that initial pitch deck was really important. And I think that's probably one of the reasons why when I look back at our 2012 pitch deck,"
    },
    {
      "speaker": "it's so valid and really still captures what we're doing today. And so I think that rejection in some ways makes you stronger if you can persist through.\n\nLenny Rachitsky",
      "timestamp": "00:28:50)",
      "timestamp_seconds": 0.0,
      "content": "Well, I think beyond that, I've never heard this part of the story. It's not just persisting, it's actually iterating and taking feedback that you're hearing to continue to evolve the pitch to a place where, \"Okay, I finally get what you're doing.\" That is such a cool part of the story. How much of that vision and product changed throughout that journey versus just the way you pitched it and convinced people?"
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "00:29:10)",
      "timestamp_seconds": 0.0,
      "content": "It was pretty consistent, but the way we articulated it changed greatly. And so for example, I wouldn't, in the early days, articulate the problem very much. And I went into, \"Here's the cool solution.\" And so then the first few pages became very much more problem-based because if people don't understand the problem then they can't understand or care about your solution. And so there was a lot of refinement on the way it was articulated,"
    },
    {
      "speaker": "but the actual vision itself I think was pretty consistent through.\n\nLenny Rachitsky",
      "timestamp": "00:29:38)",
      "timestamp_seconds": 0.0,
      "content": "Guessing a lot of founders ask for your advice on raising money, getting started, having gone through so much rejection early on. What's your general advice to folks that are having a hard time fundraising?"
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "00:29:48)",
      "timestamp_seconds": 0.0,
      "content": "I mean, I can only go on my experience, but I think it's sort of the dark tunnel analogy. Or chaos to clarity, let's go with that one. It's a slightly friendlier analogy and I think just taking the rejection and turning into things that you can control. So I can control my pitch deck, I can control the number of people I'm speaking to and I just spoke to literally everyone. And I think that continuing to use it to refine it rather than taking it as a personal rejection, I think it's really important to think how can I improve? How can I help someone to understand it? Some people are never going to understand it. I remember pitching an investor that had the lean startup book behind them when I was pitching them and they were never going to like Canva. We were not the lean startup. That was not the way that we were approaching it whatsoever. So there's some people that are just going to never like you and that's okay. I think it's important to find some people that do what you're trying to say and trying to do and kind of finding your tribe,"
    },
    {
      "speaker": "I think.\n\nLenny Rachitsky",
      "timestamp": "00:30:47)",
      "timestamp_seconds": 0.0,
      "content": "As an investor, this is really interesting to hear because it tells you there are companies like Canva there that everyone's turning down, a hundred investors passed on,"
    },
    {
      "speaker": "that you might still be able to invest in.",
      "timestamp": "00:30:58)",
      "timestamp_seconds": 0.0,
      "content": "Talking about your growth as a leader, say if you compare Melanie of today to Melanie of, I don't know, 12, 13 years ago when you were just starting Canva, what would you say is most different in terms of leadership?"
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "00:31:11)",
      "timestamp_seconds": 0.0,
      "content": "I don't really know. Probably if you ask other people around me, they'd probably be more observant. But it is funny because there's some things that I think that I need to change and then I realize you go into it the same as some other company. And sometimes we even try that for a while and then we try that out and we're like... It didn't really work for us. And it's kind of building a house that you want every brick in the house to match. And if you go and try and take some bricks from someone else's house and stick it in your house, it's probably going to not look very matched. And so trying to find things that are authentic to us and are authentic to everything that's come before it, is just that constant, constant thing. And then each scale of each stage of scale of the company rather than going, taking someone else's bricks and trying to stick that in your house,"
    },
    {
      "speaker": "trying to build the thing that's authentic.",
      "timestamp": "00:31:59)",
      "timestamp_seconds": 0.0,
      "content": "So I think there's many things that are the same, but obviously the stage and scale and we're constantly having to give away hats. And so you kind of think about it in the very early days. We just a few of us, two of us in Fusion and then three of us in a little tiny group, and you kind of wear a hundred hats and then you have to be able to give away those hats to other people that can then do that way better than yourself. And so I'm sure there's been a few skills I guess I would've had to have developed over the last decade to be able to give away those hats. But yeah,"
    },
    {
      "speaker": "I think there's a lot of things that we've had to do and double down on that was more authentic to the way we did it in the early days actually.\n\nLenny Rachitsky",
      "timestamp": "00:32:37)",
      "timestamp_seconds": 0.0,
      "content": "I love that story. I think again, if anyone working at a company that has gone through a lot of growth has experienced that when people from other companies come in and, \"Here's how we did it at this company.\" Is there an example of some there that just like, \"Here's something that this company brought in and people from this company thought we should do and we try it and didn't work?\""
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "00:32:54)",
      "timestamp_seconds": 0.0,
      "content": "I won't go into specific examples, but so many times over. And I think that, I mean maybe that's probably, in answer your other question, we did things our way because that was the only way we knew. And there was many, many times over the years that we didn't have confidence in the way we were doing things and we were like, \"Oh, they've done it from a big company that's bigger than our company. Let's go do that.\" And that hasn't always worked out so well for us. And so yeah, I think confidence in how we take what is authentic to us and do it at the next level of scale is a constant work in progress. It feels like, as I was saying before,"
    },
    {
      "speaker": "systems break and need to be reinvented but also reimagined for that next layer of scale rather than going to try to get something off the shelf from another company.\n\nLenny Rachitsky",
      "timestamp": "00:33:39)",
      "timestamp_seconds": 0.0,
      "content": "I imagine it also helped that you were in Australia away from the Bay Area and where all these other big companies are at,"
    },
    {
      "speaker": "just being able to do it your own way.\n\nMelanie Perkins",
      "timestamp": "00:33:48)",
      "timestamp_seconds": 0.0,
      "content": "Yeah,"
    },
    {
      "speaker": "very much so.\n\nLenny Rachitsky",
      "timestamp": "00:33:50)",
      "timestamp_seconds": 0.0,
      "content": "Did you know that I have a whole team that helps me with my podcast and with my newsletter? I want everyone on that team to be super happy and thrive in the roles. JustWorks knows that your employees are more than just your employees, they're your people. My team is spread out across Colorado, Australia, Nepal, West Africa and San Francisco. My life would be so incredibly complicated to hire people internationally to pay people on time and in their local currencies and to answer their HR questions 24/7. But with JustWorks, it's super easy whether you're setting up your own automated payroll, offering premium benefits or hiring internationally. JustWorks offer simple software and 24 7 human support from small business experts for you and your people. They do your human resources so that you can do right by your people, JustWorks,"
    },
    {
      "speaker": "for your people.",
      "timestamp": "00:34:38)",
      "timestamp_seconds": 0.0,
      "content": "Is there anything else that is a good example of how you did something pretty different from how other companies operate? Anything else that comes to mind as a fun example?"
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "00:34:48)",
      "timestamp_seconds": 0.0,
      "content": "The goal driven structure, I think the things that we were talking about before. So the mission, actually breaking that down into the mission pillars, breaking those mission pillars down into the goals that we're then pursuing and then celebrating those goals when we do achieve them, I think is a deeply underloved way of building a company. Often people have a mission that's kind of on the wall somewhere and then what they're actually doing and the way they actually make money and the way people actually spend their time is in a very, very different direction from that original mission. And I think the magic is when you can bring those two things together and so you can have your mission, you can have your mission pillars that actually are helping to achieve that. And I think there's a real authenticity in that for customers as well, is that you are actually doing the thing that you promised you do, and it all ladders up together. It's certainly not an easy way to run a company, but I think that when you do get that formula, I think that there's a lot of authenticity with what you're saying you're doing,"
    },
    {
      "speaker": "you're actually doing.\n\nLenny Rachitsky",
      "timestamp": "00:35:47)",
      "timestamp_seconds": 0.0,
      "content": "I want to come back to that. That's a whole really cool process. Do you have with closing the loop with customers, but something else I want to talk about while we're in this topic of growth over time. I saw you post something about how you had to realize they had to slow down and not just work, work,"
    },
    {
      "speaker": "work like crazy. Talk about just that realization and why that ended up being so valuable.\n\nMelanie Perkins",
      "timestamp": "00:36:06)",
      "timestamp_seconds": 0.0,
      "content": "So in the early days, I would just work seven days a week round the clock. In our very first company, we actually had printing presses because we were printing the yearbooks in my mom's house and then delivering them to schools around Australia. And in the early days of Canva, we certainly were working all weekend, all hours of the day. It was just constant. But when you've been doing this for a while, if you just keep working at that pace, I don't think it's good for anyone's health, mental health or anything else. So I think finding ways to continue, I still work extraordinarily hard, but to continue to have that balance in my day to day where I actually go to sleep, I find time to do things like going for walks or doing yoga,"
    },
    {
      "speaker": "journaling I find extraordinarily helpful to make sure that I can always bring my best to everything that I'm doing.\n\nLenny Rachitsky",
      "timestamp": "00:37:00)",
      "timestamp_seconds": 0.0,
      "content": "It's easy to say that kind of stuff. It must be really hard to actually make time for that thing. Is there anything for those sorts of things, is there anything that you do that allows you to actually protect that time to actually do these things? Because as you said,"
    },
    {
      "speaker": "there's a billion things that are just looking for your attention constantly.\n\nMelanie Perkins",
      "timestamp": "00:37:15)",
      "timestamp_seconds": 0.0,
      "content": "I feel like I've developed some healthy habits over the years. I don't have emails on my phone and so when I shut my laptop, I actually tune out and then if there's a real issue, I'll get an emergency call or page. But I think trying to delineate I think is really important. So when I'm working, I'm all in and then when I'm not working, I'm all out. And actually giving that mental space I think is really important. I've spoken to a lot of founders that haven't quite found that and then do struggle with it. So when they're working every weekend it feels like the right thing, but then sometimes you can miss the forest from the trees when you're just working harder and harder,"
    },
    {
      "speaker": "I want to come back to this closing the loop process. Let's say that you have where you figure out what to build. A lot of your ideas come actually from the community. Talk about just that process and how many of your ideas actually came from your community.\n\nMelanie Perkins",
      "timestamp": "00:38:17)",
      "timestamp_seconds": 0.0,
      "content": "Oh, it's one of my favorite things. We've been doing it for years now, and so we get more than a million requests from our community every year and we've got a whole incredible team that then tallies them, breaks them down, and then delivers them to all of our product teams and then those actually get closed. So this year we've closed more than 200 loops, but we know that each one of those things is going to be loved and needed by so many more people that don't bother to actually fill out the request form. So many things from gradient text, like little things like gradient text to really big things like our Sheets product. There's just been countless products. In the early days with our AI products,"
    },
    {
      "speaker": "we didn't release them to teachers because we knew there was a lot of hesitancy for teachers using AI in the classroom.",
      "timestamp": "00:39:03)",
      "timestamp_seconds": 0.0,
      "content": "And we got so many requests from teachers saying, \"Can I please use this MagicWrite in the classroom?\" And so with them we unlocked that and put on safety controls for teachers. And so it's just constant, actually. It's just part of our product process. I think there's two parts to product. One is building the future and towards the mission and the mission pillars as I was saying before. And the other is actually listening to our community and building what they want. And so I think that that's the two core pieces of product in my mind. And the closing the loop comes in so many different forms. There's the explicit asks, and then the other thing that we double down on all the time is user testing and watching people use it. And if people hesitate clicking a button or people don't quite understand how something works, it's amazing to me how you can find 10"
    },
    {
      "speaker": "random people on the internet and they can give such astute feedback that then is so representative for such a large number of people. I've personally run hundreds if not thousands of user tests myself and it's been deeply embedded in our product teams also.\n\nLenny Rachitsky",
      "timestamp": "00:40:03)",
      "timestamp_seconds": 0.0,
      "content": "Wow, that must be really stressful for someone looking at a test of Canva,"
    },
    {
      "speaker": "trying to try something when you're in the room.\n\nMelanie Perkins",
      "timestamp": "00:40:08)",
      "timestamp_seconds": 0.0,
      "content": "It's actually, we do it all online actually. I mean the ones I've run are typically online. So people are so much more frank I think when it's just them and their camera and they don't really... Yeah,"
    },
    {
      "speaker": "they tell you really how it is.\n\nLenny Rachitsky",
      "timestamp": "00:40:24)",
      "timestamp_seconds": 0.0,
      "content": "Is there a tool or a kind of a process there that you find really helpful? I don't know if you want to name names of products or anything like that,"
    },
    {
      "speaker": "but it's something that you find helpful or useful.\n\nMelanie Perkins",
      "timestamp": "00:40:31)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, we use a lot of UserTesting.com,"
    },
    {
      "speaker": "find that super valuable.\n\nLenny Rachitsky",
      "timestamp": "00:40:36)",
      "timestamp_seconds": 0.0,
      "content": "All right, go user testing. Okay. Something else that I know is really important to you and also really unique to Canva is something that's called the two-step plan. You mentioned this earlier, I want to definitely talk about this. What is the two-step plan? Why is this so important to you?"
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "00:40:50)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, so when you were asking about Crazy Big Goals, I think this is our most macro, most crazy biggest goal. Step one, build one of the world's most valuable companies and step two, do the most good we can do. And in our early days I thought I'd do step one and then step two and realize that actually step one can fuel step two and step two can fuel step one. And so that's been a really big part of Canva for some years now. In the early days we took the 1% pledge, which I think is an incredible program. Every single person, every single company should take that where you give 1% of time, money,"
    },
    {
      "speaker": "equity and profitability. And I think that's a really easy thing to do in the early days that then can compound greatly over time. We also knew that Canva's equity was obviously going to be a really key part of it.",
      "timestamp": "00:41:35)",
      "timestamp_seconds": 0.0,
      "content": "So Cliff and I owned a little over 30% of Canva, and so we decided we were going to take 30% of Canva and use it to do the most good we can do. And we are doing that. So we're doing all of our donating through the Canva Foundation. We've just, over the last few years, we've donated $50 million to GiveDirectly, where they give money directly to people in Malawi who are in extreme poverty and then they can use that money on their family to go to school, to get healthcare, to start small businesses, to get a roof so they can sleep in without being wet. Just real truly basic human needs things. And we've just announced that we're going to be giving another a hundred million dollars over the next four years to people in extreme poverty. And it's just like when you go and sit with people and you hear about how they're spending, what's very microscopic amount at $550 doesn't buy us that much,"
    },
    {
      "speaker": "but it's a life-changing amount of money for people in extreme poverty and it's truly transformational what it can do.",
      "timestamp": "00:42:39)",
      "timestamp_seconds": 0.0,
      "content": "And you meet people and you hear their stories and it's truly the best money I could ever imagine spending. And that crazy big dream I was mentioning earlier of everyone having basic human needs met, it's so completely insane that isn't the case today. There's no specific reason why people don't have their basic human needs met on our planet, but we just haven't got to act together as humanity. And so that is a truly crazy, big dream. But back to the two-step plan. Step one,"
    },
    {
      "speaker": "build one of the world's most valuable companies and step two do the most good we can do. And finding ways to do that at the same time I think is extraordinarily important.\n\nLenny Rachitsky",
      "timestamp": "00:43:17)",
      "timestamp_seconds": 0.0,
      "content": "That's incredible. It makes me think about, not to mention Elon again, but Elon's three-step strategy plan and it's like build better cars versus this is like, \"Okay, solve all the problems of the world and make the world a better place.\" What a better master plan to compare. Something else about this that I love is a lot of companies have this,"
    },
    {
      "speaker": "have something philanthropic going on with the company and it's like sitting in a doc on some page. It's part of their mission. It's not actually that big of a deal to them. What I hear from folks at Canva is something you talk about all the time. This is an actually core part of how you work and think and how you set goals and set vision and missions.\n\nMelanie Perkins",
      "timestamp": "00:43:53)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, I'm happy to hear that. I wouldn't do Canva if it wasn't going to have a positive impact on the world. For me, getting really rich is not a goal unto itself whatsoever. It's a means to an end and I've been very blessed to be able to do some work and that creates wealth that can then go and have people's basic human needs met. But they're working just as hard, but they don't have the opportunity. And even our education product, it's now used by a hundred million people each month and we are in most school districts and rolled out across countries and being able to bring quality education tools to every, and we give that away for free as well. Being able to help empower schools all around the world and we're going to be doubling down and doubling down into that product to bring quality education to all. I think it gives so much more meaning behind work. We've also, between our education product and our non-profit program where we also give away our paid product for free, we are giving away 1.5 billion of product a year now. And so the impact that that can have and the ripple effect of that I think is pretty great. And I think for all of us, it gives a lot more meaning to our work than, \"Get Rich.\""
    },
    {
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:45:07)",
      "timestamp_seconds": 0.0,
      "content": "Okay. So speaking of product, coming back to that, you guys are launching something, maybe you've already launched it by the time this comes out, what I heard described as the biggest launching canvas history, no big deal, that's a high bar. Considering all the things you guys have launched, what are you launching? Why is it such a big deal?"
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "00:45:24)",
      "timestamp_seconds": 0.0,
      "content": "We are extraordinarily excited about what we are launching. I guess the whole mission of Canva is to empower the world to design. And so what has been enabled by new technology with all of AI has been just really profound. Enabling people to take their idea and turn it into design a design and have as little friction between those two points. So we are doubling down radically on our video product and bring some incredible capabilities to our mobile and desktop platform. We are launching email, which has been one of our most hotly requested features from enterprise customers around the world and business customers around the world who want to be able to design with Canva's drag and drop ease and to be able to create an email. We are launching forms, we are launching,"
    },
    {
      "speaker": "probably one of the most exciting things is the way we're embedding AI across the entire product suite.",
      "timestamp": "00:46:12)",
      "timestamp_seconds": 0.0,
      "content": "And so you can actually use AI to design a presentation, a video, a email, a website. All of these things can actually now be done inside the core editor, inside the design tab, which is used by 170. It's used 170 million times a month. And then on our elements tab, which is used 900 million times a month, we are also embedding AI. So you can actually generate a video, you can generate a canvas code and you can generate photos all directly inside that platform. And then we're also launching comments as lots of our customers use Canvas to comment and collaborate. And now you can actually just tag at Canvas and you can collaborate. You can just say, \"Hey, can you make this title shorter? Can you do this? Can you do that?\" And it has all of the context of the design so in situ,"
    },
    {
      "speaker": "you can actually just have a collaborator that can help get your work done. So we are pretty excited about all of this.\n\nLenny Rachitsky",
      "timestamp": "00:47:12)",
      "timestamp_seconds": 0.0,
      "content": "Amazing. Something I'm going to just let people know, I don't know if people know all this, how many products you all have now. I think a lot of people think of Canva as a design graphics for social media and marketing and things like that, but you also have spreadsheets, docs, whiteboards, charts, code, AI coding tool. And now what I'm hearing is email forums. There's probably a few other things I'm not thinking [inaudible 00:47:36]-"
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "00:47:35)",
      "timestamp_seconds": 0.0,
      "content": "Yeah,"
    },
    {
      "speaker": "truly design anything. We're literally living up to that.\n\nLenny Rachitsky",
      "timestamp": "00:47:35)",
      "timestamp_seconds": 0.0,
      "content": "Oh my god,"
    },
    {
      "speaker": "it's happening.\n\nMelanie Perkins",
      "timestamp": "00:47:38)",
      "timestamp_seconds": 0.0,
      "content": "100 million people design a presentation in Canva each month now and it's pretty fascinating to see that when you speak to, I saw a tweet some time ago. They were talking about how it's a generational thing that a certain generation uses Microsoft, a certain generation uses Google. Gen Z, the way they design a presentation is in Canva, but it's not just generational for those with other generational ilk,"
    },
    {
      "speaker": "but it is been fascinating to see that come to life.\n\nLenny Rachitsky",
      "timestamp": "00:48:11)",
      "timestamp_seconds": 0.0,
      "content": "The email product, is that like a email client product or It's a design emails that you can then send through your products?"
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "00:48:17)",
      "timestamp_seconds": 0.0,
      "content": "It is design emails, so you can design email,"
    },
    {
      "speaker": "then you can take that code and you can pop it into any email platform that you use.\n\nLenny Rachitsky",
      "timestamp": "00:48:24)",
      "timestamp_seconds": 0.0,
      "content": "How do you think about products you're going to expand to, I know there's trade secrets here. You don't want to tell everyone where you're going next, but just how do you approach,"
    },
    {
      "speaker": "here's where we're going next.\n\nMelanie Perkins",
      "timestamp": "00:48:31)",
      "timestamp_seconds": 0.0,
      "content": "So our mission, empower world design, empower everyone to design anything with every ingredient in every language on every device, and just take those things very literally. So to literally design anything, to literally publish anywhere. And so we now print in 50"
    },
    {
      "speaker": "something countries around the world and you can get it printed and delivered to your house. And we plant it.\n\nLenny Rachitsky",
      "timestamp": "00:48:54)",
      "timestamp_seconds": 0.0,
      "content": "I actually did that,"
    },
    {
      "speaker": "while you're on it.\n\nMelanie Perkins",
      "timestamp": "00:48:55)",
      "timestamp_seconds": 0.0,
      "content": "Oh,"
    },
    {
      "speaker": "awesome.\n\nLenny Rachitsky",
      "timestamp": "00:48:59)",
      "timestamp_seconds": 0.0,
      "content": "I wasn't planning this,"
    },
    {
      "speaker": "but I had a print thing delivered to my house. It's so cool.\n\nMelanie Perkins",
      "timestamp": "00:49:02)",
      "timestamp_seconds": 0.0,
      "content": "Oh,"
    },
    {
      "speaker": "Exactly. Just click print and it pops up beautifully packaged to your door.\n\nLenny Rachitsky",
      "timestamp": "00:49:10)",
      "timestamp_seconds": 0.0,
      "content": "I don't know how that works. Yeah, I don't know how you did that,"
    },
    {
      "speaker": "but it worked. How cool.\n\nMelanie Perkins",
      "timestamp": "00:49:14)",
      "timestamp_seconds": 0.0,
      "content": "But it's very cool. And so yeah, I guess literally bring these things to life. Oh, we're like launching 3D as well. So all of these things we will be bringing to life literally. And just picking off what is the most strategically important next thing to enable everyone to design anything,"
    },
    {
      "speaker": "to enable everyone to publish anywhere. And we have been doing that for a decade and we'll continue to do that forever more using the latest technology to truly bring people's ideas to life.\n\nLenny Rachitsky",
      "timestamp": "00:49:40)",
      "timestamp_seconds": 0.0,
      "content": "Okay, so this is helpful. So if someone's like, \"Oh, will Canva come for my space?\" Are people designing thing that was design and also, what was it? Publish?"
    },
    {
      "speaker": "Publishing anywhere.\n\nLenny Rachitsky",
      "timestamp": "00:49:50)",
      "timestamp_seconds": 0.0,
      "content": "Okay. Publishing and designing. Okay. So if you're doing any designing or publishing,"
    },
    {
      "speaker": "watch out.\n\nMelanie Perkins",
      "timestamp": "00:49:57)",
      "timestamp_seconds": 0.0,
      "content": "From a macro perspective, there was creativity tools and productivity tools. And what Canva really does is we're literally smack bang in the middle of that Venn diagram of creativity and productivity,"
    },
    {
      "speaker": "rather than making our customers have to make a choice between those two suites.\n\nLenny Rachitsky",
      "timestamp": "00:50:13)",
      "timestamp_seconds": 0.0,
      "content": "Something I wasn't planning on asking about, but I think it's on everyone's minds. There's always this Figma and Adobe and then there's Canva and there's kind of a bunch of places we could go with this. One is just at the beginning of the journey where a lot of founders try to figure out their wedge and their specific niche. Just how did you think about that? \"Here's how we might have a chance to...\" I know Figma wasn't even around back then, I don't think. Just how did you approach your early wedge of users?"
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "00:50:38)",
      "timestamp_seconds": 0.0,
      "content": "One of the most important things that we did was we didn't really worry about competitors at all. We actually just saw where is there a gap in the market that we can uniquely fill, and what can we solve a problem, a core problem that people currently have today? And so with our first company that was yearbooks in Australia and there wasn't great tools and these yearbook coordinators got thrown in to have to design something and they'd have no design experience. And we spoke to every single customer. We gave them an over the phone tutorial, we understood all of their pain points, we got continuous customer feedback,"
    },
    {
      "speaker": "and then we tried to iterate and improve.",
      "timestamp": "00:51:12)",
      "timestamp_seconds": 0.0,
      "content": "And then when we were thinking about Canva, a few years into that, actually one of the schools said, \"I love this product so much. Can I use it to design newsletters?\" And they had all sorts of other things that they wanted to use it for, and we kind of looked around and were like, \"Oh, there's still nothing on the market.\" This was a few years into it, that actually does the thing that we're doing, but for all these other things. And so it was much more like where is the gap in the market that people are currently having a pain point? And if you can solve that pain point really well and solve it in such a way that people actually want to pay for it because it is truly solving a real pain point that they have,"
    },
    {
      "speaker": "I think that kind of sets it up for success rather than be a problem or a solution looking for a problem.\n\nLenny Rachitsky",
      "timestamp": "00:51:53)",
      "timestamp_seconds": 0.0,
      "content": "So what I'm hearing there is you didn't overthink, \"Here's my CP, here's the wedge and the strategy of how we expand into this large thing.\" It's like, \"Here's people with a problem that hasn't been solved in years that we keep seeing. Let's try to solve it.\""
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "00:52:04)",
      "timestamp_seconds": 0.0,
      "content": "Exactly that. And if you take that problem centered approach that helps people to achieve something they actually want to do in the real life, you're probably going to be at a reasonably good spot, especially if it maps to a larger market. That's a particularly great thing. If it only solves one person's problem, that might not be a great company going forward. But if a few people have that same problem... But I think that again, back to that big ladder and that first rung,"
    },
    {
      "speaker": "I think it's better to solve a small number of people's problem really well than trying to solve a large number of people's problem. Not very well at all.\n\nLenny Rachitsky",
      "timestamp": "00:52:39)",
      "timestamp_seconds": 0.0,
      "content": "Something I can't not ask about is just how you think about AI in your product. You mentioned how you integrated or all through the product, just you guys are doing really good stuff with AI. A lot of companies are struggling to find something really that works great. Do you have just a philosophy of, \"Here's how we integrate AI into Canva,\" where it ends up being really helpful and people love it?"
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "00:52:56)",
      "timestamp_seconds": 0.0,
      "content": "Your question is actually the answer at the same time. I think being able to integrate it into the product where it actually helps people to get their work done where it genuinely helps them to achieve their goals, and then being really open to listening to your community and hearing what they're loving, what they're struggling with and refining from there I think is really, really important. Just because AI is all the rage and investors really like AI doesn't necessarily mean it should be front and center, but if it can genuinely help your customers to achieve their goals. So the thing that I was mentioning before, enabling people to communicate their ideas and have little friction between those two points, AI is just kind of naturally a very critical part of that equation for us. In fact, it was funny looking back from really old decks. We were trying to do AI before AI was actually a thing because it really was critical to what we were trying to do even in our 2012"
    },
    {
      "speaker": "deck. You can kind of imagine how AI very much fit into the equation because of exactly what we're trying to do.\n\nLenny Rachitsky",
      "timestamp": "00:53:57)",
      "timestamp_seconds": 0.0,
      "content": "I'm going to keep us on the AI thread and take us to AI Corner, which is a recurring segment on this podcast. So here's the question: what's a way you've found in your personal life and work life to use AI where it ends up being really helpful, something really interesting that people might find useful?"
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "00:54:11)",
      "timestamp_seconds": 0.0,
      "content": "So many things. So AI is often the first. If I'm having an idea, it'll be a first place that I go and explore the idea. And now with Canva, and you can just tag Canva, I can say, \"Give me more ideas of this,\" and it's shockingly great because it has all of the context from the design. It's actually integrated deeply into your workflow. Another really fun thing I do is an AI walk and it's when I just put my ear pods in and then I go for a walk and I just say everything on my mind and I use that to then kind of filter out my thoughts and figure out what are the things I need to action. And it kind of helps again, get out of the weeds and think about things from a more macro perspective rather than from the things that might be in my Slack messages or in my email. It just gives you that sort of helpful vantage point I find. So yeah,"
    },
    {
      "speaker": "so many things.\n\nLenny Rachitsky",
      "timestamp": "00:55:01)",
      "timestamp_seconds": 0.0,
      "content": "For the Voice Note tool, is there a tool that you find useful for that?"
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "00:55:04)",
      "timestamp_seconds": 0.0,
      "content": "Yeah, I might use Apple Notes or directly into Canva Docs,"
    },
    {
      "speaker": "Exactly.\n\nLenny Rachitsky",
      "timestamp": "00:55:19)",
      "timestamp_seconds": 0.0,
      "content": "... dictation sort of thing. Nothing fancy?"
    },
    {
      "speaker": "Okay.\n\nMelanie Perkins",
      "timestamp": "00:55:21)",
      "timestamp_seconds": 0.0,
      "content": "Yeah,"
    },
    {
      "speaker": "I like it.\n\nLenny Rachitsky",
      "timestamp": "00:55:23)",
      "timestamp_seconds": 0.0,
      "content": "This reminded me of, you mentioned earlier in our conversation you had this vision board that you said is for 2050. Is that right?"
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "00:55:30)",
      "timestamp_seconds": 0.0,
      "content": "Yeah,"
    },
    {
      "speaker": "that's right.\n\nLenny Rachitsky",
      "timestamp": "00:55:31)",
      "timestamp_seconds": 0.0,
      "content": "Can you share something from that vision board?"
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "00:55:35)",
      "timestamp_seconds": 0.0,
      "content": "I'll tell you why the vision board came about because it's only been in recent months. I did feel like as humanity, we are on a bit of a freight train and that freight training is, I think if we take a lot of visions for a lot of different companies and a lot of things that are happening and you just fast-forward 50 years or you do 2050 and you say, \"Are we in a safer world? Is the world the place that we want our kids to grow up in? Is this the humanity that we want?\" I didn't feel that the train that we are headed on always feels great. In fact, it scared me quite greatly for a whole host of reasons. And so I sat with that feeling for a little and then I kind of got to work on my 2050"
    },
    {
      "speaker": "walls and back to the chaos to clarity.",
      "timestamp": "00:56:22)",
      "timestamp_seconds": 0.0,
      "content": "The first thing was riding my 2050 wall and I've really been loving, I've got a whole on the 2050 wall, started with a lot of quotes. Everything good was once imagined and many other quotes were along those similar lines. And then rather than just being fearful of the things that I'm worried about for society and for humanity, I started to think what would the alternative be? What is that vision that I would love to see us have basic human needs for all global education being a basic human right that everyone experiences all the really important things that we want as humanity. And again, using vision and using imagination and just dreaming about the future. And I find it really fascinating in my day-to-day by literally having it beside me as I work every day, the little tiny decisions that can kind of help to angle towards that future that we want and can I help will any of that into existence?"
    },
    {
      "speaker": "I honestly don't know.",
      "timestamp": "00:57:24)",
      "timestamp_seconds": 0.0,
      "content": "But I feel like just by starting to write it down some little brainstorm exercise with a number of other people and starting to just etch out, how do we get closer and closer to that. On my vision of the future, it's community. It's the whole of humanity trying to dream bigger and to dream bigger goals. And then us actually rising to that occasion in the world. We don't want, I think loneliness is rife, purpose is gone. What we teach people in schools is pointless. And in my vision for 2050, it's none of those things. Communities are bound to fall. We all have deep purpose. And that deep purpose springs from having bigger dreams that we collectively go out and achieve. Something that we're doing at our Canva world to a keynote in two weeks time, which I think is going to be after this is released, we've been asking people what is one goal you'd like to see the world achieved in our lifetime? (00:58:25): And then people literally writing it down I think is pretty powerful. And then people sharing that with other people I think is pretty powerful. And then us actually figuring out how the hell do we turn? That reality that we all deeply desperately want into existence, I think is genuinely one of the biggest questions of our time. But then again, rather than trying to tackle that entire thing by yourself, how do you take that first tiny step that starts to see that in your own life, in your own family, in your own community?"
    },
    {
      "speaker": "And I think that's where we'll get purpose from and I think that is one of the key answers to loneliness is actually working towards something bigger than yourself.\n\nLenny Rachitsky",
      "timestamp": "00:59:02)",
      "timestamp_seconds": 0.0,
      "content": "Wow. I really appreciate you sharing all that. I was thinking as you're talking,"
    },
    {
      "speaker": "just considering how wildly successful Canva has been and just how ambitious that was when you started. I would not be at all surprised that this actually happens and that you achieve this very difficult vision.\n\nMelanie Perkins",
      "timestamp": "00:59:18)",
      "timestamp_seconds": 0.0,
      "content": "It's not something that I alone can achieve. I think it has to be obviously a global collective effort because there's zero chance I can go and achieve basic human needs for all. But I think that I'd like to change that. I'd like to help change the mood. I'd like to help change the way we're thinking about things. I genuinely think we need to move course a little and decide not what are all the things that we... what's the freight train we're currently on, but what is it that we actually want? What do we want our societies to look like? What do we want the world to look like? Is it good enough that there's people, hundreds of millions of people that can't eat? What the hell?"
    },
    {
      "speaker": "It just literally makes no sense.\n\nLenny Rachitsky",
      "timestamp": "01:00:03)",
      "timestamp_seconds": 0.0,
      "content": "A column B world,"
    },
    {
      "speaker": "Absolutely.\n\nLenny Rachitsky",
      "timestamp": "01:00:07)",
      "timestamp_seconds": 0.0,
      "content": "Melanie, this was incredible. Before we get to our very exciting lightning round, is there anything else that you wanted to share? Anything else you want to leave listeners with?"
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "01:00:17)",
      "timestamp_seconds": 0.0,
      "content": "You have been extremely extensive. I don't think I've got anything else to add,"
    },
    {
      "speaker": "frankly.\n\nLenny Rachitsky",
      "timestamp": "01:00:20)",
      "timestamp_seconds": 0.0,
      "content": "That's the goal. That's the goal. With that, we've reached our very exciting lightning round. Melanie, are you ready?"
    },
    {
      "speaker": "Let's go.\n\nLenny Rachitsky",
      "timestamp": "01:00:27)",
      "timestamp_seconds": 0.0,
      "content": "First question, what are two or three books that you find yourself recommending most to other people?"
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "01:00:31)",
      "timestamp_seconds": 0.0,
      "content": "One of the books I love is The Power of Moments, and it talks, am I supposed to be really fast and not tell you about it?"
    },
    {
      "speaker": "It's all good.\n\nMelanie Perkins",
      "timestamp": "01:00:39)",
      "timestamp_seconds": 0.0,
      "content": "Okay. Two books, the Power of Moments, and one of the books early on I read was Designing the Obvious,"
    },
    {
      "speaker": "which I found very insightful.\n\nLenny Rachitsky",
      "timestamp": "01:00:48)",
      "timestamp_seconds": 0.0,
      "content": "I like they shifted to fast mode. You don't have to go superfast. All good. What is a favorite product you've recently discovered that you really love?"
    },
    {
      "speaker": "I love the Calm app. It is my daily companion. I use it to meditate. I use it to listen to music. I just find it very calming.\n\nLenny Rachitsky",
      "timestamp": "01:01:05)",
      "timestamp_seconds": 0.0,
      "content": "Okay. First question. I usually ask about movies and TV shows. I hear you don't watch a lot because you're so busy and have so much going on. So I'm going to try it, new question I haven't asked before. I'm curious where this goes. So excluding Canva, what's a product you'd love to work on someday, whether it's like an existing other company like, \"Oh, I wish I could work on that thing,\""
    },
    {
      "speaker": "or just a new product you'd love to build maybe after the Canva chapter.\n\nMelanie Perkins",
      "timestamp": "01:01:27)",
      "timestamp_seconds": 0.0,
      "content": "I feel like my Canva chapter's going to go on for a long time, so I don't know,"
    },
    {
      "speaker": "because we've got-\n\nLenny Rachitsky",
      "timestamp": "01:01:27)",
      "timestamp_seconds": 0.0,
      "content": "On the side,"
    },
    {
      "speaker": "on the side.\n\nMelanie Perkins",
      "timestamp": "01:01:33)",
      "timestamp_seconds": 0.0,
      "content": "..."
    },
    {
      "speaker": "decent plans side and we're pretty extensive.\n\nLenny Rachitsky",
      "timestamp": "01:01:33)",
      "timestamp_seconds": 0.0,
      "content": "Okay,"
    },
    {
      "speaker": "maybe a company you'd love to fund. There we go.\n\nMelanie Perkins",
      "timestamp": "01:01:36)",
      "timestamp_seconds": 0.0,
      "content": "I feel like there's a lot of opportunity to create global infrastructure that is truly empowering. And so as I look at my 2050 wall,"
    },
    {
      "speaker": "I think there's a lot of things that are currently only exclusively available to a small number of people that should be available to everyone. And so the more that we can do to uplift the rising tide lifts all boats I think is a thing that's just so of such critical importance. And I think there is this weird belief that you can be fine and everyone else can be not fine and that's all cool. I don't think that's cool. I think everyone suffers in such a case. So I think more things that help everyone to rise.\n\nLenny Rachitsky",
      "timestamp": "01:02:21)",
      "timestamp_seconds": 0.0,
      "content": "Maybe along those lines, but maybe not, is there a life motto that you find yourself coming back to and work your own life?"
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "01:02:28)",
      "timestamp_seconds": 0.0,
      "content": "There's a few. I love the quote, happiness is when what you think, what you say and what you do are in harmony. I feel like that's a constant aspiration. And then I've just been so obsessed lately with the idea that everything is led by imagination. That imagination is the very first step of that creative process. So everything is good because once imagined is a quote you're going to be seeing from Canva all the time now because it is true that if you don't imagine it, you can't will it into existence. And in fact,"
    },
    {
      "speaker": "everything great that we experience in life was first imagined.\n\nLenny Rachitsky",
      "timestamp": "01:03:00)",
      "timestamp_seconds": 0.0,
      "content": "Wow. There's so much power to that one thought nugget there is just, there's all these tools now that can make building so much easier. You can just build anything you want, just describe it. But so many people are just like, I'm in the same boat. I'm just stuck. \"What do I want?\" I don't even don't know what I need. What should I build? And that's exactly what you're talking about there. Okay. Last question. So I saw it somewhere that you were an aspiring figure skater in your early years in high school, you had to wake up at 4:30 A.M. to practice. Is there something you learned from that period of your life that was helpful in building Canva?"
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "01:03:36)",
      "timestamp_seconds": 0.0,
      "content": "So many things are quite directly applicable, falling down over and over again and getting up and trying again, the importance of hard work and determination. I think the falling down, it was quite literal in my figure skating in days, and maybe it was a little more metaphorical in today,"
    },
    {
      "speaker": "but it is constant.\n\nLenny Rachitsky",
      "timestamp": "01:03:57)",
      "timestamp_seconds": 0.0,
      "content": "You're right. I wonder what that metaphor is for figure skating. I don't know. Anyway, Melanie, this was incredible. I am so thankful that you agreed to do this. Two final questions: where can folks find you if they want to maybe reach out, send you feedback on Canvas or join Canva, and how can listeners be useful to you?"
    },
    {
      "speaker": "Melanie Perkins",
      "timestamp": "01:04:12)",
      "timestamp_seconds": 0.0,
      "content": "Really great questions. So you can find me on LinkedIn. That's where I post the most. And you can go to and I can get the URL to give us your wishes and we want to hear them and we literally listen to them. It doesn't just go into a suggestion box. And then how can they be helpful? Use Canva, spread Canva, teach Canva. We're doing a Canva World Tour through October,"
    },
    {
      "speaker": "which is probably going to be updated when this is posted.",
      "timestamp": "01:04:43)",
      "timestamp_seconds": 0.0,
      "content": "Come to our events. We do events all around the world and we'd love to see you and to hear from you. And if you are in a company, starting a company, try and do the 1% pledge. Try and figure out your own version of the two-step plan and try and build products and in every decision that you make that actually makes the world that you want to live in. I think there's this kind of belief sometimes that the world is created by other people, but we all have a very active hand in creating the world that we live in. And every decision that you make for investors, every company that you fund, is that contributing the world to the world that you want to live in? Or is it creating the freight train that none of us want to be on?"
    },
    {
      "speaker": "Lenny Rachitsky",
      "timestamp": "01:05:27)",
      "timestamp_seconds": 0.0,
      "content": "I have to ask before I let you go. Are you going to have the rap dancers at the next Canva event?"
    },
    {
      "speaker": "You'll have to wait and see.\n\nLenny Rachitsky",
      "timestamp": "01:05:34)",
      "timestamp_seconds": 0.0,
      "content": "Okay. Melanie,"
    },
    {
      "speaker": "thank you so much for being here.\n\nMelanie Perkins",
      "timestamp": "01:05:38)",
      "timestamp_seconds": 0.0,
      "content": "Thank you so much, Lenny,"
    },
    {
      "speaker": "for having me and your great well-researched questions.\n\nLenny Rachitsky",
      "timestamp": "01:05:42)",
      "timestamp_seconds": 0.0,
      "content": "Thank you. Bye everyone. Thank you so much for listening. If you found this valuable, you can subscribe to the show on Apple Podcasts, Spotify, or your favorite podcast app. Also, please consider giving us a rating or leaving a review as that really helps other listeners find the podcast. You can find all past episodes or learn more about the show at Lenny'sPodcasts.com. See you in the next episode."
    }
  ],
  "num_segments": 148,
  "full_text": "Lenny Rachitsky (00:00:00):\nThere's a very famous story about Canva. Early on, you pitched over a hundred investors and over a hundred investors said no to you.\n\nMelanie Perkins (00:00:06):\nIt was really clear in my mind that it was the future and I thought the investors were wrong, frankly. But investors also gave really helpful feedback and feedback. Often in the form of rejection, they would say, \"Oh, your market's not big enough,\" and I would say, \"It's going to be huge.\" And I'd add a new page in my pitch deck that said how big the market I believe was, and then they'd say, \"You're the same as some of other company.\" And I would say, \"Hey, now I've got a new slide in my pitch deck that shows all the players and the huge gap in the market that we believe we're going to fill.\"\n\nLenny Rachitsky (00:00:33):\nOne of your values, Crazy Big Goals. I love that as a value.\n\nMelanie Perkins (00:00:35):\nThe thing that I love about a crazy big goal is that you feel completely inadequate before it. You want to work really hard to will it into existence. I really like to start by just imagining what is the future that you actually want Right now? I have a wall in my house in my office, which is my vision for what I'd like the world to look like in 2050.\n\nLenny Rachitsky (00:00:52):\nI heard from one of your team members, Melissa Tan, there's a deck like this for every project you kick off. There's this big vision deck.\n\nMelanie Perkins (00:00:59):\nSo we have this concept of chaos to clarity. Every idea starts in the chaos side, and then you have to work all the way to the other side, which is clarity. That very first step at the far end of chaos was quite an embarrassing step actually, because you don't have mastery at that point. You don't have all the answers.\n\nLenny Rachitsky (00:01:14):\nA lot of people think of Canva as like design graphics for social media and marketing and things like that, but you also have spreadsheets, whiteboards, charts, AI coding tool.\n\nMelanie Perkins (00:01:24):\nWas funny, looking back from really old decks. We were trying to do AI before AI was actually a thing.\n\nLenny Rachitsky (00:01:30):\nToday my guest is Melanie Perkins, CEO and co-founder of Canva. Melanie is on track to be the most successful female tech founder in history and one of the most successful founders, period. Canva is currently valued at over $42 billion, making over $3.3 billion in revenue a year. They've been profitable for eight years straight and are one of the hottest private tech companies in the world right now. But it wasn't always this way. Melanie was rejected by over 100 investors when she was trying to raise her first round. Their team spent two years rewriting their entire code base and were unable to ship any new features for over two years, something they expected to just take six months, and they even went through a big pivot early on from a yearbook publishing platform to the Canva that you know today, Melanie does not do a lot of podcasts. She shares stories that I've never heard before and lessons that I'm still thinking about.\n\n(00:02:21):\nThis is a really rare opportunity to learn from a legendary founder. A huge thank you to Cameron Adams and Melissa Tan for suggesting topics for this conversation. Enjoy this podcast. Don't forget to subscribe and follow it in your favorite podcasting app or YouTube. And if you become an annual subscriber of my newsletter, you get a year free of 17 incredible products, including Devon, Lovable, Replit, Bolt, Encodia and Linear, Superhuman, DescriptUs, Flowgama, Perplexity, Warp, Granola, MagicPattern, DarkCast, ChatGPT and Mobbin. Head on over to lennysnewsletter.com and click product pass. With that, I bring you Melanie Perkins after a short word from our sponsors. My podcast guest, and I love talking about craft and taste and agency and product market fit. You know what we don't love talking about? SOC 2. That's where Vanta comes in. Vanta helps companies of all sizes get compliant fast and stay that way with industry leading AI, automation and continuous monitoring.\n\n(00:03:14):\nWhether you're a startup tackling your first SOC 2 or ISO 27001 or an enterprise managing vendor risk, Vanta's trust management platform makes it quicker, easier, and more scalable. Vanta also helps you complete security questionnaires up to five times faster so that you can win bigger deals sooner. The result. According to a recent IDC study, Vanta customers slashed over $500,000 a year and are three times more productive. Establishing trust isn't optional. Vanta makes it automatic. Get $1,000 off at vanta.com/lenny.\n\n(00:03:50):\nLast year, 1.3% of global GDP flow through Stripe. That's over $1.4 trillion. Stripe helps ambitious founders start companies and scale them from pre-seed to IPO and beyond. Used by 78% of the Forbes AI-50 Stripe provides financial infrastructure for payments, billing and software to platforms and marketplaces so they can monetize faster, experiment with pricing and grow revenue. With Stripe, businesses achieve massive global scale faster than they would otherwise. And at the beginning of that journey is where Stripe Startups comes in. Stripe Startups is a program designed to support early-stage venture-backed businesses as they build, iterate and scale. Founders enrolled in Stripe Startups get access to credits to offset Stripe fees, expert insights, and a focused community of other founders building on Stripe. You can learn more and apply for the program today at stripe.com/startups.\n\n(00:04:49):\nMelanie, thank you so much for being here and welcome to the podcast.\n\nMelanie Perkins (00:04:53):\nThank you so much for having me. I'm excited to be here.\n\nLenny Rachitsky (00:04:55):\nI'm even more excited. It's such an honor to have you here. I am such a fan of yours. I'm such a fan of the company that you've built. Also just everyone I meet from Canva is just so nice and so awesome and so smart, and so clearly you've built something really special. I'm really excited to use this hour to learn as much as I can from you about how you did that. We were actually chatting ahead of this about what would make the best use of this hour. I asked you what you believe has been the biggest factor in the success of Canva. You described something called building a Column B company and Column B thinking, I've never heard of this before, so let us start there. What is building Column B company, what does that mean?\n\nMelanie Perkins (00:05:35):\nReally great place to start. So I guess there's two ways of planning. The way that you can plan is you can dream of what is the perfect vision of the future, what future do you want to exist in, what would you like the world to look like? What would you like companies to look like? And then going from there, which is completely improbable, a completely crazy big dream, and then working hard to turn that into reality. And the alternate is, so just imagine you are building a castle on the hill and you're like, \"What would be the most magical, wonderful, mythical experience?\" And the other thing you can do is you can look at the bricks around you and you can say, \"What can I do with these bricks? How high can I stack them? What can I do?\" And I think most planning is often done by looking at the bricks and trying to stack them, and then you can create only so much. And so I guess the column B thinking is thinking about what is that magical wonderful future that you then want to invest years and decades of your life actually building? And so that's column A and column B in a nutshell.\n\nLenny Rachitsky (00:06:37):\nSo column A is the traditional just work from today's world. Column B is work from this dream reality and work backwards from how to achieve that.\n\nMelanie Perkins (00:06:44):\nExactly that.\n\nLenny Rachitsky (00:06:45):\nThis is exactly the way actually Brian Chesky thought. I worked at Airbnb for a long time and it was always just, \"Think about the world, the dream and then work backwards from that,\" so there's a lot clearly also worked out. So clearly this is an important lesson in the example of Canva, just what would've been column A for what Canva could have been and how did you think about the column B approach of what Canva in a dreamland could be?\n\nMelanie Perkins (00:07:07):\nSo column A would've been nothing frankly, because the reality was when I was a university student with no company and no business or product or software experience, the reality would've been not very much. And so it was all column B, it was all thinking about the wild future that we wanted to create. Imagine what would be publishing in the future, what would communications look like in the future? And it seemed really impossible that it would stay on the desktop, it would stay really complicated. And it just seemed so apparent to me that in the future it was going to be completely different. Could I build that future? I had absolutely no idea, but the idea, it seemed completely likely, completely improbable that it wouldn't be the case that in the future, design would be online and collaborative and really simple. And so starting from that, we then took that concept and applied it to the school yearbook market in Australia with our first company Fusion Books. And then we applied it to Canva where we wanted to take it much, much bigger.\n\nLenny Rachitsky (00:08:08):\nLet's talk about just how to actually go about building a Column B company. Say a founder is listening to this and they're just like, \"Okay, I want to do this.\" What do they do? What are the steps? Where do you start?\n\nMelanie Perkins (00:08:17):\nI really like to start by just imagining what is the future that you actually want? What is the world that you want to live in? What is the future of transportation? What is the future of healthcare? What is the future that you want to live in and exist in? And for example, right now I have a wall in my house in my office, which is my vision for what I'd like the world to look like in 2050. And so it's not necessarily that you can bring that into existence or you can will that into existence, but just to start to get clearer on what you would like that world to be like. Would you like it to be more inclusive? Would you like it? For me, one of the things I desperately want is everyone on this planet to have their basic human needs met.\n\n(00:08:56):\nWhat are those things that you believe are so important that you would love to see exist in that future? And I think an exercise we often do is what is wild success for X, or what is wild success for Y? And then equally, what is terrible failure for those things? And you can apply that just to abstract thinking in different industries. You can do that, apply that. We do that for the whole company for different areas of the company. And I think just taking that very long timescale of 10 years and getting a really crisp idea of what you want, of what you don't want, that's sort of the first step. And I think a lot of people don't spend quite enough time imagining that. And then the next part is you don't want to just have this crazy big dream and then do nothing about turning it into reality.\n\n(00:09:43):\nYou kind of want to have a ladder that goes all the way up to the moon, which is your crazy, wild vision. And then you want to have rungs that just work its way up step by step. And so you want to get that really clear picture of the future that you would like and then just take little step, after little step, after little step. And it doesn't matter how small that first step is or how seemingly inconsequential if it is working towards that future that you want to will into existence, then you'll keep on climbing up that ladder in the right direction.\n\nLenny Rachitsky (00:10:10):\nI think a lot of people hearing this might feel like, \"I do this. Yeah, I have a vision. I know where I'm going. I have this big idea.\" What do you think they might be missing about just what this actually means and why they're probably not thinking big enough, they're not making the time to think this.\n\nMelanie Perkins (00:10:23):\nI think it is easy to be discouraged by the two, because they're completely two complete odds. They're completely different ends of the spectrum. So one is dreaming about the future, not that you think you can will into existence, it's just the future that you want. And then the next part is taking the tiny step that might be extremely microscopic and it feels a little embarrassing to be like, \"I want a future that is,\" whatever it might be. And then to take such a microscopic step because I think you often have the future in one side or don't spend much time thinking about that. You're just thinking about the bricks before you. And so I think it's also naturally we all get distracted by day-to-day. It's your email, your Slack, the things that are kind of in your face, the reality that lives around you every day that kind of pulls you into this moment right now.\n\n(00:11:14):\nAnd so I think actually just making time to spend thinking about that is probably one of the most critical pieces. Just literally dreaming what is wild success in 10 years, what is terrible failure in 10 years is a really great place to start, is just spending some time there. And then even if that is so big and so vast and so wild, having that very first step is so important because then you take that little tiny first step and then the next step then that compounds for us, it's been compounding over a decade as we continue to work towards that same mission and vision.\n\nLenny Rachitsky (00:11:49):\nI want to hear how you operationalize this. I heard from one of your team members, Melissa Tan, that there's a deck like this for every project you kick off. There's this big vision deck. Talk about what that looks like, because I think that's where people are like, \"Okay, how do I actually do this?\" Talk about that deck.\n\nMelanie Perkins (00:12:04):\nSo we have this concept of chaos to clarity and every idea starts in the chaos side, and then you have to work all the way to the other side, which is clarity. And so chaos can be an idea, it can be a problem, it can be a philosophy or a belief. And I've got a joke that I find funny. I'm not sure if you will, but how do you go from chaos to clarity? You add clarity. And so the idea is that each little step from chaos to clarity is the very first step might be literally writing it down. So rather than it being in your head, you've written it down, then the next step might be starting to create a pitch deck on it. And the next step might be starting to refine that, turning it into some designs, turning into a prototype. And then as it kind of goes from chaos to clarity, it starts to become more and more real and more and more people can see it. And so just taking those little incremental steps that adds clarity with every single step, then starts to help will it into existence rather than it being something that's completely amorphous and just stays in your head. So I think that's why visual communication for us is so important, is because otherwise, if it's just in your head, no one else can see it and you can't will it into existence.\n\nLenny Rachitsky (00:13:13):\nThis makes me think about this concept of an ugly baby from the book, Creativity Inc., by I think Ed Catmull where he talks about how new ideas or this ugly baby that nobody wants to look at and deal with that I think he says they want to kill. I don't know why you would do that with an ugly baby. But there are these very soft, fragile things and it's really important to not kill them early and give them a chance to survive. And it's kind what I'm hearing here is have this big vision that many people are be like, \"No, wait. This is completely absurd.\" And I love this idea of, \"Okay, but here's one step we could take there to see if this could be a thing.\"\n\nMelanie Perkins (00:13:48):\nYeah, I completely agree. And I think that's the thing is that that very first step at the very far end of chaos, it's very embarrassing because you're like, \"I have this idea that is so big and so wild and how the hell would I do that? I have no idea.\" And so it's quite a embarrassing step, actually, because you don't have mastery at that point. You don't have all the answers. In fact, you have likely none of the answers, but you just have the idea that you think would be cool. And ideally you get the idea that it would be so cool that you want to work really hard to will that into existence. And so I think one of the really key parts is not only just having the idea but thinking it's so cool that you're going to work for years to will it into existence. Actually Melissa did a really amazing pitch deck recently about the vision of, I won't go into the details right here, but the vision of her space and I was really excited about it. And so I think that that's the great thing about a pitch deck, is that other people can see your thinking and your thinking actually gets clarified as well as you go through that process.\n\nLenny Rachitsky (00:14:50):\nI talked to Melissa, I talked to a bunch of other people that work at Canva, that have worked at Canva, and something else I heard along these lines is this phrase, Crazy Big Goals, which I think is one of your values. Crazy Big Goals. I love that as a value. Why is that so important? How does that fit into this? And just talk about the power of having Crazy Big Goals.\n\nMelanie Perkins (00:15:08):\nYeah, so right from the start of Canva, it was truly a crazy-big goal. We're like, \"We want to empower the world of design and take all these things that are super complicated and put them into one platform and make it accessible to the whole world. And we want to, rather than it be super expensive and unaffordable, we want to empower everyone everywhere in the world to design.\" So I mean, that was the epitome of a crazy big goal. And if we macro out even further, we've got this two-step plan, build one of the world's most valuable companies and do the most good we can do. So again, a rather crazy big goal. And I think the thing that I love about a crazy big goal is that you feel completely inadequate before it. Another crazy big goal. We'd love to see everyone's basic human needs met on the planet. Completely crazy big, that truly shouldn't be. It's kind of absolutely absurd that that's the case, but we can go into that later.\n\n(00:16:02):\nBut I think with a crazy big goal, then you want to work really hard to will it into existence. And so if you start with a reasonable goal or a realistic goal, then you kind of get to it and you're like, \"Oh cool, whatever.\" Or more importantly, if something happens, all the problems and roadblocks come along as they always do, then you're like, \"Okay, I won't bother with that.\" And then you can just go and choose another course. And so a crazy big goal is both crazy big, but it's also something that you think is incredibly important that you actually want to will into existence because it is so much work to will a crazy big goal into existence. So it better be one that you want to actually achieve.\n\nLenny Rachitsky (00:16:45):\nIs there a crazy big goal that you set that comes to mind maybe as a good example of, \"This is what I'm talking about?\" Maybe a product you launched or feature back in the day?\n\nMelanie Perkins (00:16:53):\nYeah, I mean so many things. So we have our mission to empower the world to design and we break it down into mission pillars. So empower everyone to design anything with every ingredient in every language on every device, obviously a mouthful. But then what we do is we take successive goals every year towards this mission. And so for designing anything, we started off with social media and presentations and docs and websites and whiteboards and video. And so every year we're just launching more and more things to fulfill that part of the mission of empowering everyone to design anything. And then equally in every language we started in English and then it was Spanish and then it was 20 languages and then a hundred languages and then hard languages like Arabic and Hebrew and Urdu and right to left languages. And now we're in a hundred plus languages now and now we're really doubling down on the localization experience to make it feel truly local in every market around the world.\n\n(00:17:47):\nAnd so you can see how having these very big, audacious goals that you then just take a step after step towards helps then will it into existence or on every device. We started off obviously just with a web platform and then we launched our iPad app and then iPhone and then Android and then we spent years investing in cross-platform. So we have the same feature set across every device. And so you can see how these big amorphous things that seem very outlandish, you can then just will into existence after continual investment for a decade and it compounds over time.\n\nLenny Rachitsky (00:18:20):\nI see how all this is starting to fade together. There's this big crazy ambitious vision and below there are the mission pillars that are feeding into this vision and then the Crazy Big Goals within each of those mission pillars to measure your progress towards all these components of the mission.\n\nMelanie Perkins (00:18:32):\nExactly, exactly.\n\nLenny Rachitsky (00:18:34):\nOkay, so with all that in mind, there's also this kind of trade-off you have to make of just how ambitious you get because oftentimes sometimes maybe you never miss the goal, but many times people miss these very ambitious goals. How do you just find that balance between ambitious crazy but doable enough where people don't get discouraged?\n\nMelanie Perkins (00:18:51):\nI think with a crazy big goal, the thing we have been really great at is achieving them. The timeframe that we achieve them on has not always been very reliable. We have certainly not been able to have pin dart. What's it?\n\nLenny Rachitsky (00:19:07):\nBullseye?\n\nMelanie Perkins (00:19:08):\nWe have not been very accurate with timing, but it's really interesting. I look back at a 2021 vision deck that we made obviously in 2021, but it was about 2026 and it was fascinating to see how much we'd actually been able to achieve from that vision deck and how many things were currently still in flight. And so by having that, I thought in 2021, some of those things may have happened a little quicker, but over the last five years they've really been coming into reality. And so we might think things are going to take six months and they take a year. We might think things are going to take six months and they take two years. This has been the case. We might think something's actually going to take our entire lifetime as some of those really truly Crazy Big Goals. And in fact, I don't even know if we can ever achieve them frankly. But they're such an important goal that even if you make a little step in their direction, they're worthwhile nonetheless.\n\nLenny Rachitsky (00:20:01):\nWhether you like him or not, Elon, this is similar to his, if you watch him, he sets these really ambitious goals and then often is far late on achieving them, but clearly it has worked out in achieving the crazy things that he's achieved. Something else I hear is you celebrate these goals in a really unique way. Talk about that.\n\nMelanie Perkins (00:20:18):\nSo when we have these Crazy Big Goals, we also have couple them with really fun celebrations. And so we attempt to make the Crazy Big Goals happen in a moment in time. So then when we achieve them, we actually have a really fun moment because if you're just trying to plod towards the top of the mountain always and you never take a little moment to pat yourself on the back, it would feel a little arduous. And so over the years we had all sorts of fun little celebrations where we have smashed great plates and released doves and had a La Tomatina festival.\n\n(00:20:51):\nAll sorts of fun things just to take a moment with the team to celebrate that huge achievement. And so I think that you want to celebrate what you want to really focus on and what you want everyone to take that moment. So when you achieve that crazy big goal when we launch in Spanish, when we hit a hundred languages and then the so forth across the company, taking that moment to actually pat yourself on the back and pat the teams on the back and say, \"Hey, we did this thing. That thing that seemed really hard, we've now achieved.\" And the mission is often each of the different mission pillars, they're obviously a long area of investment that's going to take a long time to get to, but being able to celebrate each of the rungs on that on the way there I think is extraordinarily important. And then everyone works extraordinarily hard to bring them to life and then it gives everyone a little moment to feel proud of themselves.\n\nLenny Rachitsky (00:21:43):\nIt'd be very motivating to get to just break a bunch of plates. I really like that. Celebration strategy.\n\nMelanie Perkins (00:21:47):\nWe need to bring that one back. We haven't done that one in a while.\n\nLenny Rachitsky (00:21:49):\nThat's a good one. I just love how concrete you're making this. So it's set these Crazy Big Goals, confine the component of the goals, set numbers there and then figure out the kind of steps you take to achieve these things. All fail is very easy. On the flip side of that, this is a segue. People hear these stories, they hear your story, they see Canva over the years and it's just this up into the right huge success story, one of the most successful companies in history. I imagine there have been many periods where things weren't going so great and when maybe things didn't look like they would work out. So let me just ask you this over the course of building Canva, once it started to click and started to feel like it was going to be a thing, was there a point where it started to again feel like, \"Wow, maybe this may not work out. Maybe there's a huge setback that we may not get over?\"\n\nMelanie Perkins (00:22:35):\nI think it's just a constant evolution. Every time the company doubles in size, pretty much all your systems break, all the things that were working don't work. A little example, in the early days we'd stand up and everyone would present their goals, what they're working on every day, every week. And then it kind of moved every month and then it was just taking too long because we've got so many people. And then it was sort of like we'd started doing these things called season openers and season openers were really fun where we got the entire company together, we talked about the goals that we'd achieved. And it was so funny because ahead of season openers, everyone would launch everything because they wanted to do it ahead of the season opener. And then we'd also set the goals for the coming cycle for the coming season at that point in time.\n\n(00:23:17):\nBut then they started to become six hours long because we had so many people and so many teams. And so trying to find that right with the same philosophies of deep context for everyone with the same philosophies of the celebrations and the goals and trying to find that right flavor at every stage of scale is definitely hard. And so I think it's just a constant work in progress. Or back to your earlier point about timing of things, we were doing a front-end rewrite and we thought it would take about six months. It was really important because it was critical for cross-platform. It was critical for right to left. It was critical because we could only have five people working in our editor at any point in time because of the way the code base was structured and we thought it was going to take six months and then it took two years and it was two years of not shipping any product, two years of a product company not being able to ship product.\n\n(00:24:14):\nAnd that is such a core motivation for our team. He's shipping something, seeing great customer feedback and that kind of makes everyone feel happy and you've got momentum and it just felt like we're in a dark, dark tunnel that we could hardly see the end of the tunnel. And we didn't really know how long it was going to take because it just had to take as long as the tunnel was going to take. And it was a very hard time because other people would be launching this and that. And it was eventually we got out of that tunnel and it was extremely important that we did that work. We've now got two and a half thousand engineers and we're able to deliver amazing things that would've just been completely infeasible and simultaneous collaboration, so many things were baked into this. But yeah, it was not a fun period of time. A product company not shipping product is not really a recipe for fun.\n\nLenny Rachitsky (00:25:15):\nFor two years.\n\nMelanie Perkins (00:25:16):\nFor two years.\n\nLenny Rachitsky (00:25:17):\nI feel like every builder listening to this knows exactly what you've been through and maybe not on that scale in those stakes, but you start on something, \"Oh yeah, it'll take a few weeks,\" and then a year later you're still working on it.\n\nMelanie Perkins (00:25:27):\nTotally.\n\nLenny Rachitsky (00:25:29):\nJust was the mood really, I don't know, sad internally? Two years, that's a long time not to ship anything. Just what was it like internally during that period?\n\nMelanie Perkins (00:25:39):\nI think it was kind of everything internally. We made it into a bit of a game. We had this game board and I bought these little rubber ducky sort of bath toys and we had, so we all the little components represented as a bath toy on this board and there was all these stages of went launched in product. There was an emergency lane at the end of it was home and hosed. And we did these weekly stand ups where everyone would come in and talk where their bath toy was at and just, we tried to make it fun for the team. So it was partly fun and it was partly distressing as all of our investors were like, \"Hey, that thing.\" So I think it was both things at the same time. It was bonding let's say.\n\nLenny Rachitsky (00:26:30):\nOkay. Speaking of investors, speaking of other hard times, there's a very famous story about Canva. Early on you pitched over a hundred investors and over a hundred investors said no to you when you were just starting Canva. I think that's important. The investors than any founder I've talked to actually tries to pitch. It's impressive you tried that hard and went for so many pitches and finally got someone to take a bet. Now you are something like a $40 billion company making 3.3 billion ARR. I think there's something like $240 million monthly active users, one of the hottest private companies in the world. Just how does this feel?\n\nMelanie Perkins (00:27:06):\nI don't know. It was really clear in my mind that it was the future and I thought the investors were wrong, frankly. But investors also gave really helpful feedback and feedback often in the form of rejection. So they would say, \"Oh, your market's not big enough.\" And I would say, \"It's going to be huge.\" And I'd add a new page in my pitch deck that said how big the market I believe was. And then they'd say, \"You're the same as some other company,\" coupled with rejection, and I would say, \"Hey, now I've got a new slide in my pitch deck that shows all the players and the huge gap in the market that we believe we're going to fill.\" Or most investors just knew absolutely nothing about design or the industry that we're in. And so we then ended up with the first few slides saying, \"Here's the lay of the land today. Here's the problem that we're going to solve.\"\n\n(00:27:53):\nAnd so while it was extraordinarily frustrating, their feedback made us stronger and made our pitch deck stronger. And it was sort of from that chaos to clarity. At the start it was this idea and then through the copious amounts of rejection, the pitch deck got stronger and more refined. So then when people, the first time I remember I spoke to someone for hours and they eventually got it. They were really committed to understanding what we were trying to do, but then not everyone has six hours to understand a concept. And so being able to take all the gems of wisdom from that conversation and have that understood really clearly in a really short period of time and have all of the reasons that people were rejecting us pre-answered in that initial pitch deck was really important. And I think that's probably one of the reasons why when I look back at our 2012 pitch deck, it's so valid and really still captures what we're doing today. And so I think that rejection in some ways makes you stronger if you can persist through.\n\nLenny Rachitsky (00:28:50):\nWell, I think beyond that, I've never heard this part of the story. It's not just persisting, it's actually iterating and taking feedback that you're hearing to continue to evolve the pitch to a place where, \"Okay, I finally get what you're doing.\" That is such a cool part of the story. How much of that vision and product changed throughout that journey versus just the way you pitched it and convinced people?\n\nMelanie Perkins (00:29:10):\nIt was pretty consistent, but the way we articulated it changed greatly. And so for example, I wouldn't, in the early days, articulate the problem very much. And I went into, \"Here's the cool solution.\" And so then the first few pages became very much more problem-based because if people don't understand the problem then they can't understand or care about your solution. And so there was a lot of refinement on the way it was articulated, but the actual vision itself I think was pretty consistent through.\n\nLenny Rachitsky (00:29:38):\nGuessing a lot of founders ask for your advice on raising money, getting started, having gone through so much rejection early on. What's your general advice to folks that are having a hard time fundraising?\n\nMelanie Perkins (00:29:48):\nI mean, I can only go on my experience, but I think it's sort of the dark tunnel analogy. Or chaos to clarity, let's go with that one. It's a slightly friendlier analogy and I think just taking the rejection and turning into things that you can control. So I can control my pitch deck, I can control the number of people I'm speaking to and I just spoke to literally everyone. And I think that continuing to use it to refine it rather than taking it as a personal rejection, I think it's really important to think how can I improve? How can I help someone to understand it? Some people are never going to understand it. I remember pitching an investor that had the lean startup book behind them when I was pitching them and they were never going to like Canva. We were not the lean startup. That was not the way that we were approaching it whatsoever. So there's some people that are just going to never like you and that's okay. I think it's important to find some people that do what you're trying to say and trying to do and kind of finding your tribe, I think.\n\nLenny Rachitsky (00:30:47):\nAs an investor, this is really interesting to hear because it tells you there are companies like Canva there that everyone's turning down, a hundred investors passed on, that you might still be able to invest in.\n\n(00:30:58):\nTalking about your growth as a leader, say if you compare Melanie of today to Melanie of, I don't know, 12, 13 years ago when you were just starting Canva, what would you say is most different in terms of leadership?\n\nMelanie Perkins (00:31:11):\nI don't really know. Probably if you ask other people around me, they'd probably be more observant. But it is funny because there's some things that I think that I need to change and then I realize you go into it the same as some other company. And sometimes we even try that for a while and then we try that out and we're like... It didn't really work for us. And it's kind of building a house that you want every brick in the house to match. And if you go and try and take some bricks from someone else's house and stick it in your house, it's probably going to not look very matched. And so trying to find things that are authentic to us and are authentic to everything that's come before it, is just that constant, constant thing. And then each scale of each stage of scale of the company rather than going, taking someone else's bricks and trying to stick that in your house, trying to build the thing that's authentic.\n\n(00:31:59):\nSo I think there's many things that are the same, but obviously the stage and scale and we're constantly having to give away hats. And so you kind of think about it in the very early days. We just a few of us, two of us in Fusion and then three of us in a little tiny group, and you kind of wear a hundred hats and then you have to be able to give away those hats to other people that can then do that way better than yourself. And so I'm sure there's been a few skills I guess I would've had to have developed over the last decade to be able to give away those hats. But yeah, I think there's a lot of things that we've had to do and double down on that was more authentic to the way we did it in the early days actually.\n\nLenny Rachitsky (00:32:37):\nI love that story. I think again, if anyone working at a company that has gone through a lot of growth has experienced that when people from other companies come in and, \"Here's how we did it at this company.\" Is there an example of some there that just like, \"Here's something that this company brought in and people from this company thought we should do and we try it and didn't work?\"\n\nMelanie Perkins (00:32:54):\nI won't go into specific examples, but so many times over. And I think that, I mean maybe that's probably, in answer your other question, we did things our way because that was the only way we knew. And there was many, many times over the years that we didn't have confidence in the way we were doing things and we were like, \"Oh, they've done it from a big company that's bigger than our company. Let's go do that.\" And that hasn't always worked out so well for us. And so yeah, I think confidence in how we take what is authentic to us and do it at the next level of scale is a constant work in progress. It feels like, as I was saying before, systems break and need to be reinvented but also reimagined for that next layer of scale rather than going to try to get something off the shelf from another company.\n\nLenny Rachitsky (00:33:39):\nI imagine it also helped that you were in Australia away from the Bay Area and where all these other big companies are at, just being able to do it your own way.\n\nMelanie Perkins (00:33:48):\nYeah, very much so.\n\nLenny Rachitsky (00:33:50):\nDid you know that I have a whole team that helps me with my podcast and with my newsletter? I want everyone on that team to be super happy and thrive in the roles. JustWorks knows that your employees are more than just your employees, they're your people. My team is spread out across Colorado, Australia, Nepal, West Africa and San Francisco. My life would be so incredibly complicated to hire people internationally to pay people on time and in their local currencies and to answer their HR questions 24/7. But with JustWorks, it's super easy whether you're setting up your own automated payroll, offering premium benefits or hiring internationally. JustWorks offer simple software and 24 7 human support from small business experts for you and your people. They do your human resources so that you can do right by your people, JustWorks, for your people.\n\n(00:34:38):\nIs there anything else that is a good example of how you did something pretty different from how other companies operate? Anything else that comes to mind as a fun example?\n\nMelanie Perkins (00:34:48):\nThe goal driven structure, I think the things that we were talking about before. So the mission, actually breaking that down into the mission pillars, breaking those mission pillars down into the goals that we're then pursuing and then celebrating those goals when we do achieve them, I think is a deeply underloved way of building a company. Often people have a mission that's kind of on the wall somewhere and then what they're actually doing and the way they actually make money and the way people actually spend their time is in a very, very different direction from that original mission. And I think the magic is when you can bring those two things together and so you can have your mission, you can have your mission pillars that actually are helping to achieve that. And I think there's a real authenticity in that for customers as well, is that you are actually doing the thing that you promised you do, and it all ladders up together. It's certainly not an easy way to run a company, but I think that when you do get that formula, I think that there's a lot of authenticity with what you're saying you're doing, you're actually doing.\n\nLenny Rachitsky (00:35:47):\nI want to come back to that. That's a whole really cool process. Do you have with closing the loop with customers, but something else I want to talk about while we're in this topic of growth over time. I saw you post something about how you had to realize they had to slow down and not just work, work, work like crazy. Talk about just that realization and why that ended up being so valuable.\n\nMelanie Perkins (00:36:06):\nSo in the early days, I would just work seven days a week round the clock. In our very first company, we actually had printing presses because we were printing the yearbooks in my mom's house and then delivering them to schools around Australia. And in the early days of Canva, we certainly were working all weekend, all hours of the day. It was just constant. But when you've been doing this for a while, if you just keep working at that pace, I don't think it's good for anyone's health, mental health or anything else. So I think finding ways to continue, I still work extraordinarily hard, but to continue to have that balance in my day to day where I actually go to sleep, I find time to do things like going for walks or doing yoga, journaling I find extraordinarily helpful to make sure that I can always bring my best to everything that I'm doing.\n\nLenny Rachitsky (00:37:00):\nIt's easy to say that kind of stuff. It must be really hard to actually make time for that thing. Is there anything for those sorts of things, is there anything that you do that allows you to actually protect that time to actually do these things? Because as you said, there's a billion things that are just looking for your attention constantly.\n\nMelanie Perkins (00:37:15):\nI feel like I've developed some healthy habits over the years. I don't have emails on my phone and so when I shut my laptop, I actually tune out and then if there's a real issue, I'll get an emergency call or page. But I think trying to delineate I think is really important. So when I'm working, I'm all in and then when I'm not working, I'm all out. And actually giving that mental space I think is really important. I've spoken to a lot of founders that haven't quite found that and then do struggle with it. So when they're working every weekend it feels like the right thing, but then sometimes you can miss the forest from the trees when you're just working harder and harder, but maybe you're actually working on the wrong thing. And so I think being able to step away a little just to be able to get perspective is actually really beneficial.\n\nLenny Rachitsky (00:38:04):\nI want to come back to this closing the loop process. Let's say that you have where you figure out what to build. A lot of your ideas come actually from the community. Talk about just that process and how many of your ideas actually came from your community.\n\nMelanie Perkins (00:38:17):\nOh, it's one of my favorite things. We've been doing it for years now, and so we get more than a million requests from our community every year and we've got a whole incredible team that then tallies them, breaks them down, and then delivers them to all of our product teams and then those actually get closed. So this year we've closed more than 200 loops, but we know that each one of those things is going to be loved and needed by so many more people that don't bother to actually fill out the request form. So many things from gradient text, like little things like gradient text to really big things like our Sheets product. There's just been countless products. In the early days with our AI products, we didn't release them to teachers because we knew there was a lot of hesitancy for teachers using AI in the classroom.\n\n(00:39:03):\nAnd we got so many requests from teachers saying, \"Can I please use this MagicWrite in the classroom?\" And so with them we unlocked that and put on safety controls for teachers. And so it's just constant, actually. It's just part of our product process. I think there's two parts to product. One is building the future and towards the mission and the mission pillars as I was saying before. And the other is actually listening to our community and building what they want. And so I think that that's the two core pieces of product in my mind. And the closing the loop comes in so many different forms. There's the explicit asks, and then the other thing that we double down on all the time is user testing and watching people use it. And if people hesitate clicking a button or people don't quite understand how something works, it's amazing to me how you can find 10 random people on the internet and they can give such astute feedback that then is so representative for such a large number of people. I've personally run hundreds if not thousands of user tests myself and it's been deeply embedded in our product teams also.\n\nLenny Rachitsky (00:40:03):\nWow, that must be really stressful for someone looking at a test of Canva, trying to try something when you're in the room.\n\nMelanie Perkins (00:40:08):\nIt's actually, we do it all online actually. I mean the ones I've run are typically online. So people are so much more frank I think when it's just them and their camera and they don't really... Yeah, they tell you really how it is.\n\nLenny Rachitsky (00:40:24):\nIs there a tool or a kind of a process there that you find really helpful? I don't know if you want to name names of products or anything like that, but it's something that you find helpful or useful.\n\nMelanie Perkins (00:40:31):\nYeah, we use a lot of UserTesting.com, find that super valuable.\n\nLenny Rachitsky (00:40:36):\nAll right, go user testing. Okay. Something else that I know is really important to you and also really unique to Canva is something that's called the two-step plan. You mentioned this earlier, I want to definitely talk about this. What is the two-step plan? Why is this so important to you?\n\nMelanie Perkins (00:40:50):\nYeah, so when you were asking about Crazy Big Goals, I think this is our most macro, most crazy biggest goal. Step one, build one of the world's most valuable companies and step two, do the most good we can do. And in our early days I thought I'd do step one and then step two and realize that actually step one can fuel step two and step two can fuel step one. And so that's been a really big part of Canva for some years now. In the early days we took the 1% pledge, which I think is an incredible program. Every single person, every single company should take that where you give 1% of time, money, equity and profitability. And I think that's a really easy thing to do in the early days that then can compound greatly over time. We also knew that Canva's equity was obviously going to be a really key part of it.\n\n(00:41:35):\nSo Cliff and I owned a little over 30% of Canva, and so we decided we were going to take 30% of Canva and use it to do the most good we can do. And we are doing that. So we're doing all of our donating through the Canva Foundation. We've just, over the last few years, we've donated $50 million to GiveDirectly, where they give money directly to people in Malawi who are in extreme poverty and then they can use that money on their family to go to school, to get healthcare, to start small businesses, to get a roof so they can sleep in without being wet. Just real truly basic human needs things. And we've just announced that we're going to be giving another a hundred million dollars over the next four years to people in extreme poverty. And it's just like when you go and sit with people and you hear about how they're spending, what's very microscopic amount at $550 doesn't buy us that much, but it's a life-changing amount of money for people in extreme poverty and it's truly transformational what it can do.\n\n(00:42:39):\nAnd you meet people and you hear their stories and it's truly the best money I could ever imagine spending. And that crazy big dream I was mentioning earlier of everyone having basic human needs met, it's so completely insane that isn't the case today. There's no specific reason why people don't have their basic human needs met on our planet, but we just haven't got to act together as humanity. And so that is a truly crazy, big dream. But back to the two-step plan. Step one, build one of the world's most valuable companies and step two do the most good we can do. And finding ways to do that at the same time I think is extraordinarily important.\n\nLenny Rachitsky (00:43:17):\nThat's incredible. It makes me think about, not to mention Elon again, but Elon's three-step strategy plan and it's like build better cars versus this is like, \"Okay, solve all the problems of the world and make the world a better place.\" What a better master plan to compare. Something else about this that I love is a lot of companies have this, have something philanthropic going on with the company and it's like sitting in a doc on some page. It's part of their mission. It's not actually that big of a deal to them. What I hear from folks at Canva is something you talk about all the time. This is an actually core part of how you work and think and how you set goals and set vision and missions.\n\nMelanie Perkins (00:43:53):\nYeah, I'm happy to hear that. I wouldn't do Canva if it wasn't going to have a positive impact on the world. For me, getting really rich is not a goal unto itself whatsoever. It's a means to an end and I've been very blessed to be able to do some work and that creates wealth that can then go and have people's basic human needs met. But they're working just as hard, but they don't have the opportunity. And even our education product, it's now used by a hundred million people each month and we are in most school districts and rolled out across countries and being able to bring quality education tools to every, and we give that away for free as well. Being able to help empower schools all around the world and we're going to be doubling down and doubling down into that product to bring quality education to all. I think it gives so much more meaning behind work. We've also, between our education product and our non-profit program where we also give away our paid product for free, we are giving away 1.5 billion of product a year now. And so the impact that that can have and the ripple effect of that I think is pretty great. And I think for all of us, it gives a lot more meaning to our work than, \"Get Rich.\"\n\nLenny Rachitsky (00:45:07):\nOkay. So speaking of product, coming back to that, you guys are launching something, maybe you've already launched it by the time this comes out, what I heard described as the biggest launching canvas history, no big deal, that's a high bar. Considering all the things you guys have launched, what are you launching? Why is it such a big deal?\n\nMelanie Perkins (00:45:24):\nWe are extraordinarily excited about what we are launching. I guess the whole mission of Canva is to empower the world to design. And so what has been enabled by new technology with all of AI has been just really profound. Enabling people to take their idea and turn it into design a design and have as little friction between those two points. So we are doubling down radically on our video product and bring some incredible capabilities to our mobile and desktop platform. We are launching email, which has been one of our most hotly requested features from enterprise customers around the world and business customers around the world who want to be able to design with Canva's drag and drop ease and to be able to create an email. We are launching forms, we are launching, probably one of the most exciting things is the way we're embedding AI across the entire product suite.\n\n(00:46:12):\nAnd so you can actually use AI to design a presentation, a video, a email, a website. All of these things can actually now be done inside the core editor, inside the design tab, which is used by 170. It's used 170 million times a month. And then on our elements tab, which is used 900 million times a month, we are also embedding AI. So you can actually generate a video, you can generate a canvas code and you can generate photos all directly inside that platform. And then we're also launching comments as lots of our customers use Canvas to comment and collaborate. And now you can actually just tag at Canvas and you can collaborate. You can just say, \"Hey, can you make this title shorter? Can you do this? Can you do that?\" And it has all of the context of the design so in situ, you can actually just have a collaborator that can help get your work done. So we are pretty excited about all of this.\n\nLenny Rachitsky (00:47:12):\nAmazing. Something I'm going to just let people know, I don't know if people know all this, how many products you all have now. I think a lot of people think of Canva as a design graphics for social media and marketing and things like that, but you also have spreadsheets, docs, whiteboards, charts, code, AI coding tool. And now what I'm hearing is email forums. There's probably a few other things I'm not thinking [inaudible 00:47:36]-\n\nMelanie Perkins (00:47:35):\nYeah, truly design anything. We're literally living up to that.\n\nLenny Rachitsky (00:47:35):\nOh my god, it's happening.\n\nMelanie Perkins (00:47:38):\n100 million people design a presentation in Canva each month now and it's pretty fascinating to see that when you speak to, I saw a tweet some time ago. They were talking about how it's a generational thing that a certain generation uses Microsoft, a certain generation uses Google. Gen Z, the way they design a presentation is in Canva, but it's not just generational for those with other generational ilk, but it is been fascinating to see that come to life.\n\nLenny Rachitsky (00:48:11):\nThe email product, is that like a email client product or It's a design emails that you can then send through your products?\n\nMelanie Perkins (00:48:17):\nIt is design emails, so you can design email, then you can take that code and you can pop it into any email platform that you use.\n\nLenny Rachitsky (00:48:24):\nHow do you think about products you're going to expand to, I know there's trade secrets here. You don't want to tell everyone where you're going next, but just how do you approach, here's where we're going next.\n\nMelanie Perkins (00:48:31):\nSo our mission, empower world design, empower everyone to design anything with every ingredient in every language on every device, and just take those things very literally. So to literally design anything, to literally publish anywhere. And so we now print in 50 something countries around the world and you can get it printed and delivered to your house. And we plant it.\n\nLenny Rachitsky (00:48:54):\nI actually did that, while you're on it.\n\nMelanie Perkins (00:48:55):\nOh, awesome.\n\nLenny Rachitsky (00:48:59):\nI wasn't planning this, but I had a print thing delivered to my house. It's so cool.\n\nMelanie Perkins (00:49:02):\nOh, yeah. Exactly.\n\nLenny Rachitsky (00:49:04):\nWe have to go to a print shop in this freaking graphic and well here's a button. Let's click that.\n\nMelanie Perkins (00:49:07):\nExactly. Just click print and it pops up beautifully packaged to your door.\n\nLenny Rachitsky (00:49:10):\nI don't know how that works. Yeah, I don't know how you did that, but it worked. How cool.\n\nMelanie Perkins (00:49:14):\nBut it's very cool. And so yeah, I guess literally bring these things to life. Oh, we're like launching 3D as well. So all of these things we will be bringing to life literally. And just picking off what is the most strategically important next thing to enable everyone to design anything, to enable everyone to publish anywhere. And we have been doing that for a decade and we'll continue to do that forever more using the latest technology to truly bring people's ideas to life.\n\nLenny Rachitsky (00:49:40):\nOkay, so this is helpful. So if someone's like, \"Oh, will Canva come for my space?\" Are people designing thing that was design and also, what was it? Publish?\n\nMelanie Perkins (00:49:49):\nPublishing anywhere.\n\nLenny Rachitsky (00:49:50):\nOkay. Publishing and designing. Okay. So if you're doing any designing or publishing, watch out.\n\nMelanie Perkins (00:49:57):\nFrom a macro perspective, there was creativity tools and productivity tools. And what Canva really does is we're literally smack bang in the middle of that Venn diagram of creativity and productivity, rather than making our customers have to make a choice between those two suites.\n\nLenny Rachitsky (00:50:13):\nSomething I wasn't planning on asking about, but I think it's on everyone's minds. There's always this Figma and Adobe and then there's Canva and there's kind of a bunch of places we could go with this. One is just at the beginning of the journey where a lot of founders try to figure out their wedge and their specific niche. Just how did you think about that? \"Here's how we might have a chance to...\" I know Figma wasn't even around back then, I don't think. Just how did you approach your early wedge of users?\n\nMelanie Perkins (00:50:38):\nOne of the most important things that we did was we didn't really worry about competitors at all. We actually just saw where is there a gap in the market that we can uniquely fill, and what can we solve a problem, a core problem that people currently have today? And so with our first company that was yearbooks in Australia and there wasn't great tools and these yearbook coordinators got thrown in to have to design something and they'd have no design experience. And we spoke to every single customer. We gave them an over the phone tutorial, we understood all of their pain points, we got continuous customer feedback, and then we tried to iterate and improve.\n\n(00:51:12):\nAnd then when we were thinking about Canva, a few years into that, actually one of the schools said, \"I love this product so much. Can I use it to design newsletters?\" And they had all sorts of other things that they wanted to use it for, and we kind of looked around and were like, \"Oh, there's still nothing on the market.\" This was a few years into it, that actually does the thing that we're doing, but for all these other things. And so it was much more like where is the gap in the market that people are currently having a pain point? And if you can solve that pain point really well and solve it in such a way that people actually want to pay for it because it is truly solving a real pain point that they have, I think that kind of sets it up for success rather than be a problem or a solution looking for a problem.\n\nLenny Rachitsky (00:51:53):\nSo what I'm hearing there is you didn't overthink, \"Here's my CP, here's the wedge and the strategy of how we expand into this large thing.\" It's like, \"Here's people with a problem that hasn't been solved in years that we keep seeing. Let's try to solve it.\"\n\nMelanie Perkins (00:52:04):\nExactly that. And if you take that problem centered approach that helps people to achieve something they actually want to do in the real life, you're probably going to be at a reasonably good spot, especially if it maps to a larger market. That's a particularly great thing. If it only solves one person's problem, that might not be a great company going forward. But if a few people have that same problem... But I think that again, back to that big ladder and that first rung, I think it's better to solve a small number of people's problem really well than trying to solve a large number of people's problem. Not very well at all.\n\nLenny Rachitsky (00:52:39):\nSomething I can't not ask about is just how you think about AI in your product. You mentioned how you integrated or all through the product, just you guys are doing really good stuff with AI. A lot of companies are struggling to find something really that works great. Do you have just a philosophy of, \"Here's how we integrate AI into Canva,\" where it ends up being really helpful and people love it?\n\nMelanie Perkins (00:52:56):\nYour question is actually the answer at the same time. I think being able to integrate it into the product where it actually helps people to get their work done where it genuinely helps them to achieve their goals, and then being really open to listening to your community and hearing what they're loving, what they're struggling with and refining from there I think is really, really important. Just because AI is all the rage and investors really like AI doesn't necessarily mean it should be front and center, but if it can genuinely help your customers to achieve their goals. So the thing that I was mentioning before, enabling people to communicate their ideas and have little friction between those two points, AI is just kind of naturally a very critical part of that equation for us. In fact, it was funny looking back from really old decks. We were trying to do AI before AI was actually a thing because it really was critical to what we were trying to do even in our 2012 deck. You can kind of imagine how AI very much fit into the equation because of exactly what we're trying to do.\n\nLenny Rachitsky (00:53:57):\nI'm going to keep us on the AI thread and take us to AI Corner, which is a recurring segment on this podcast. So here's the question: what's a way you've found in your personal life and work life to use AI where it ends up being really helpful, something really interesting that people might find useful?\n\nMelanie Perkins (00:54:11):\nSo many things. So AI is often the first. If I'm having an idea, it'll be a first place that I go and explore the idea. And now with Canva, and you can just tag Canva, I can say, \"Give me more ideas of this,\" and it's shockingly great because it has all of the context from the design. It's actually integrated deeply into your workflow. Another really fun thing I do is an AI walk and it's when I just put my ear pods in and then I go for a walk and I just say everything on my mind and I use that to then kind of filter out my thoughts and figure out what are the things I need to action. And it kind of helps again, get out of the weeds and think about things from a more macro perspective rather than from the things that might be in my Slack messages or in my email. It just gives you that sort of helpful vantage point I find. So yeah, so many things.\n\nLenny Rachitsky (00:55:01):\nFor the Voice Note tool, is there a tool that you find useful for that?\n\nMelanie Perkins (00:55:04):\nYeah, I might use Apple Notes or directly into Canva Docs, and then I actually just do the brain dump into Canva Docs and then just summarize them.\n\nLenny Rachitsky (00:55:16):\nGot it. And so you just use native microphone-\n\nMelanie Perkins (00:55:19):\nExactly.\n\nLenny Rachitsky (00:55:19):\n... dictation sort of thing. Nothing fancy?\n\nMelanie Perkins (00:55:20):\nYeah.\n\nLenny Rachitsky (00:55:20):\nOkay.\n\nMelanie Perkins (00:55:21):\nYeah, I like it.\n\nLenny Rachitsky (00:55:23):\nThis reminded me of, you mentioned earlier in our conversation you had this vision board that you said is for 2050. Is that right?\n\nMelanie Perkins (00:55:30):\nYeah, that's right.\n\nLenny Rachitsky (00:55:31):\nCan you share something from that vision board?\n\nMelanie Perkins (00:55:35):\nI'll tell you why the vision board came about because it's only been in recent months. I did feel like as humanity, we are on a bit of a freight train and that freight training is, I think if we take a lot of visions for a lot of different companies and a lot of things that are happening and you just fast-forward 50 years or you do 2050 and you say, \"Are we in a safer world? Is the world the place that we want our kids to grow up in? Is this the humanity that we want?\" I didn't feel that the train that we are headed on always feels great. In fact, it scared me quite greatly for a whole host of reasons. And so I sat with that feeling for a little and then I kind of got to work on my 2050 walls and back to the chaos to clarity.\n\n(00:56:22):\nThe first thing was riding my 2050 wall and I've really been loving, I've got a whole on the 2050 wall, started with a lot of quotes. Everything good was once imagined and many other quotes were along those similar lines. And then rather than just being fearful of the things that I'm worried about for society and for humanity, I started to think what would the alternative be? What is that vision that I would love to see us have basic human needs for all global education being a basic human right that everyone experiences all the really important things that we want as humanity. And again, using vision and using imagination and just dreaming about the future. And I find it really fascinating in my day-to-day by literally having it beside me as I work every day, the little tiny decisions that can kind of help to angle towards that future that we want and can I help will any of that into existence? I honestly don't know.\n\n(00:57:24):\nBut I feel like just by starting to write it down some little brainstorm exercise with a number of other people and starting to just etch out, how do we get closer and closer to that. On my vision of the future, it's community. It's the whole of humanity trying to dream bigger and to dream bigger goals. And then us actually rising to that occasion in the world. We don't want, I think loneliness is rife, purpose is gone. What we teach people in schools is pointless. And in my vision for 2050, it's none of those things. Communities are bound to fall. We all have deep purpose. And that deep purpose springs from having bigger dreams that we collectively go out and achieve. Something that we're doing at our Canva world to a keynote in two weeks time, which I think is going to be after this is released, we've been asking people what is one goal you'd like to see the world achieved in our lifetime?\n\n(00:58:25):\nAnd then people literally writing it down I think is pretty powerful. And then people sharing that with other people I think is pretty powerful. And then us actually figuring out how the hell do we turn? That reality that we all deeply desperately want into existence, I think is genuinely one of the biggest questions of our time. But then again, rather than trying to tackle that entire thing by yourself, how do you take that first tiny step that starts to see that in your own life, in your own family, in your own community? And I think that's where we'll get purpose from and I think that is one of the key answers to loneliness is actually working towards something bigger than yourself.\n\nLenny Rachitsky (00:59:02):\nWow. I really appreciate you sharing all that. I was thinking as you're talking, just considering how wildly successful Canva has been and just how ambitious that was when you started. I would not be at all surprised that this actually happens and that you achieve this very difficult vision.\n\nMelanie Perkins (00:59:18):\nIt's not something that I alone can achieve. I think it has to be obviously a global collective effort because there's zero chance I can go and achieve basic human needs for all. But I think that I'd like to change that. I'd like to help change the mood. I'd like to help change the way we're thinking about things. I genuinely think we need to move course a little and decide not what are all the things that we... what's the freight train we're currently on, but what is it that we actually want? What do we want our societies to look like? What do we want the world to look like? Is it good enough that there's people, hundreds of millions of people that can't eat? What the hell? It just literally makes no sense.\n\nLenny Rachitsky (01:00:03):\nA column B world, you might say.\n\nMelanie Perkins (01:00:06):\nAbsolutely.\n\nLenny Rachitsky (01:00:07):\nMelanie, this was incredible. Before we get to our very exciting lightning round, is there anything else that you wanted to share? Anything else you want to leave listeners with?\n\nMelanie Perkins (01:00:17):\nYou have been extremely extensive. I don't think I've got anything else to add, frankly.\n\nLenny Rachitsky (01:00:20):\nThat's the goal. That's the goal. With that, we've reached our very exciting lightning round. Melanie, are you ready?\n\nMelanie Perkins (01:00:25):\nLet's go.\n\nLenny Rachitsky (01:00:27):\nFirst question, what are two or three books that you find yourself recommending most to other people?\n\nMelanie Perkins (01:00:31):\nOne of the books I love is The Power of Moments, and it talks, am I supposed to be really fast and not tell you about it?\n\nLenny Rachitsky (01:00:37):\nIt's all good.\n\nMelanie Perkins (01:00:39):\nOkay. Two books, the Power of Moments, and one of the books early on I read was Designing the Obvious, which I found very insightful.\n\nLenny Rachitsky (01:00:48):\nI like they shifted to fast mode. You don't have to go superfast. All good. What is a favorite product you've recently discovered that you really love? Not Canva.\n\nMelanie Perkins (01:00:56):\nI love the Calm app. It is my daily companion. I use it to meditate. I use it to listen to music. I just find it very calming.\n\nLenny Rachitsky (01:01:05):\nOkay. First question. I usually ask about movies and TV shows. I hear you don't watch a lot because you're so busy and have so much going on. So I'm going to try it, new question I haven't asked before. I'm curious where this goes. So excluding Canva, what's a product you'd love to work on someday, whether it's like an existing other company like, \"Oh, I wish I could work on that thing,\" or just a new product you'd love to build maybe after the Canva chapter.\n\nMelanie Perkins (01:01:27):\nI feel like my Canva chapter's going to go on for a long time, so I don't know, because we've got-\n\nLenny Rachitsky (01:01:27):\nOn the side, on the side.\n\nMelanie Perkins (01:01:33):\n... decent plans side and we're pretty extensive.\n\nLenny Rachitsky (01:01:33):\nOkay, maybe a company you'd love to fund. There we go.\n\nMelanie Perkins (01:01:36):\nI feel like there's a lot of opportunity to create global infrastructure that is truly empowering. And so as I look at my 2050 wall, I think there's a lot of things that are currently only exclusively available to a small number of people that should be available to everyone. And so the more that we can do to uplift the rising tide lifts all boats I think is a thing that's just so of such critical importance. And I think there is this weird belief that you can be fine and everyone else can be not fine and that's all cool. I don't think that's cool. I think everyone suffers in such a case. So I think more things that help everyone to rise.\n\nLenny Rachitsky (01:02:21):\nMaybe along those lines, but maybe not, is there a life motto that you find yourself coming back to and work your own life?\n\nMelanie Perkins (01:02:28):\nThere's a few. I love the quote, happiness is when what you think, what you say and what you do are in harmony. I feel like that's a constant aspiration. And then I've just been so obsessed lately with the idea that everything is led by imagination. That imagination is the very first step of that creative process. So everything is good because once imagined is a quote you're going to be seeing from Canva all the time now because it is true that if you don't imagine it, you can't will it into existence. And in fact, everything great that we experience in life was first imagined.\n\nLenny Rachitsky (01:03:00):\nWow. There's so much power to that one thought nugget there is just, there's all these tools now that can make building so much easier. You can just build anything you want, just describe it. But so many people are just like, I'm in the same boat. I'm just stuck. \"What do I want?\" I don't even don't know what I need. What should I build? And that's exactly what you're talking about there. Okay. Last question. So I saw it somewhere that you were an aspiring figure skater in your early years in high school, you had to wake up at 4:30 A.M. to practice. Is there something you learned from that period of your life that was helpful in building Canva?\n\nMelanie Perkins (01:03:36):\nSo many things are quite directly applicable, falling down over and over again and getting up and trying again, the importance of hard work and determination. I think the falling down, it was quite literal in my figure skating in days, and maybe it was a little more metaphorical in today, but it is constant.\n\nLenny Rachitsky (01:03:57):\nYou're right. I wonder what that metaphor is for figure skating. I don't know. Anyway, Melanie, this was incredible. I am so thankful that you agreed to do this. Two final questions: where can folks find you if they want to maybe reach out, send you feedback on Canvas or join Canva, and how can listeners be useful to you?\n\nMelanie Perkins (01:04:12):\nReally great questions. So you can find me on LinkedIn. That's where I post the most. And you can go to and I can get the URL to give us your wishes and we want to hear them and we literally listen to them. It doesn't just go into a suggestion box. And then how can they be helpful? Use Canva, spread Canva, teach Canva. We're doing a Canva World Tour through October, which is probably going to be updated when this is posted.\n\n(01:04:43):\nCome to our events. We do events all around the world and we'd love to see you and to hear from you. And if you are in a company, starting a company, try and do the 1% pledge. Try and figure out your own version of the two-step plan and try and build products and in every decision that you make that actually makes the world that you want to live in. I think there's this kind of belief sometimes that the world is created by other people, but we all have a very active hand in creating the world that we live in. And every decision that you make for investors, every company that you fund, is that contributing the world to the world that you want to live in? Or is it creating the freight train that none of us want to be on?\n\nLenny Rachitsky (01:05:27):\nI have to ask before I let you go. Are you going to have the rap dancers at the next Canva event?\n\nMelanie Perkins (01:05:33):\nYou'll have to wait and see.\n\nLenny Rachitsky (01:05:34):\nOkay. Melanie, thank you so much for being here.\n\nMelanie Perkins (01:05:38):\nThank you so much, Lenny, for having me and your great well-researched questions.\n\nLenny Rachitsky (01:05:42):\nThank you. Bye everyone. Thank you so much for listening. If you found this valuable, you can subscribe to the show on Apple Podcasts, Spotify, or your favorite podcast app. Also, please consider giving us a rating or leaving a review as that really helps other listeners find the podcast. You can find all past episodes or learn more about the show at Lenny'sPodcasts.com. See you in the next episode.\n\n",
  "companies": [
    "Microsoft",
    "Google",
    "Box",
    "Bolt",
    " Lovable",
    "Slack",
    "Figma",
    "Meta",
    "LinkedIn",
    "Perplexity",
    "Apple",
    "Segment",
    "Airbnb",
    "Stripe",
    "Anthropic",
    "Linear",
    "Replit"
  ]
}